Repository: translationfeedback/feedback
Catalog: xlf/39/61/45/396145.*.001.xlf
Languages: ru

source: See also <a href="https://jsfiddle.net/Lr4eay5e/4/"><strong>this Fiddle</strong></a>!
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите также </font></font><a href="https://jsfiddle.net/Lr4eay5e/4/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эту скрипку</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> !</font></font>

source: Set <code>position:absolute</code> and <code>top:50%</code> on the child container to move the top down to the middle of the parent.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Установите </font></font> <code>position:absolute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>top:50%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> на дочернем контейнере, чтобы переместить верхнюю часть к середине родительского контейнера.</font></font>

source: Set margin-top:-yy where yy is half the height of the child container to offset the item up.
ru: Установите margin-top:-yy где yy-это половина высоты дочернего контейнера для смещения предмета вверх.

source: Show code snippet
ru: Показать фрагмент кода

source: Specify a fixed height on the child container.
ru: Укажите фиксированную высоту на детском контейнере.

source: Specify the parent container as <code>position:relative</code> or <code>position:absolute</code>.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Укажите родительский контейнер как </font></font> <code>position:relative</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> или </font></font> <code>position:absolute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Support starts with IE8.
ru: Поддержка начинается с IE8.

source: Thank Chris Coyier from CSS Tricks for <a href="http://css-tricks.com/centering-in-the-unknown/">this article</a>.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Спасибо Крису Койеру из CSS Tricks за </font></font><a href="http://css-tricks.com/centering-in-the-unknown/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эту статью</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: The answer from Billbad only works with a fixed width of the <code>.inner</code> div. This solution works for a dynamic width by adding the attribute <code>text-align: center</code> to the <code>.outer</code> div.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ответ от Billbad работает только с фиксированной шириной </font></font> <code>.inner</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> div. </font><font style="vertical-align: inherit;">Это решение работает для динамической ширины, добавляя атрибут </font></font> <code>text-align: center</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> к </font></font> <code>.outer</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> div.</font></font>

source: The content box:
ru: Коробка с содержимым:

source: The contents can be easily centered by using flexbox. The following code shows the CSS for the container inside which the contents needs to be centered:
ru: Содержимое может быть легко отцентрировано с помощью флексбокса.Следующий код показывает CSS для контейнера,внутри которого содержимое должно быть отцентрировано:

source: The easiest solution is below:
ru: Самое простое решение находится ниже:

source: The example below will center a div to the center within your browser. What's important (in my example) is to set <code>height: 100%</code> to <code>body</code> and <code>html</code> and then <code>min-height: 100%</code> to your container.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">В приведенном ниже примере центр в центре вашего браузера. </font><font style="vertical-align: inherit;">Важно (в моем примере) установить </font></font> <code>height: 100%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для </font></font> <code>body</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и </font></font> <code>html</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а затем </font></font> <code>min-height: 100%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для вашего контейнера.</font></font>

source: The following link presents a simple way of doing it with just 3 lines in your CSS:
ru: Следующая ссылка представляет простой способ сделать это,используя всего 3 строки в CSS:

source: The inner container:
ru: Внутренний контейнер:

source: The outer container:
ru: Внешний контейнер:

source: The simplest way would be the following <strong>3 lines</strong> of CSS:
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Самым простым способом были бы следующие </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3 строки</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> CSS:</font></font>

source: The three lines of code using <code>transform</code> works practically on modern browsers and Internet&nbsp;Explorer:
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Три строки кода с использованием </font></font> <code>transform</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> работают практически в современных браузерах и Internet Explorer:</font></font>

source: There is a trick I found out recently: You need to use <code>top 50%</code> &amp; then you do a <code>translateY(-50%)</code>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Недавно я обнаружил одну хитрость: вам нужно использовать </font></font> <code>top 50%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> а затем вы </font></font> <code>translateY(-50%)</code>

source: There is also a technique to do the vertical centering using JavaScript. <a href="http://www.alistapart.com/d/footers/footer_variation1.html">Vertical alignment of content with JavaScript &amp; CSS</a> demonstrates it.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Существует также методика вертикального центрирования с использованием JavaScript. </font></font><a href="http://www.alistapart.com/d/footers/footer_variation1.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вертикальное выравнивание контента с помощью JavaScript и CSS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> демонстрирует это.</font></font>

source: This is always where I go when I have to come back to <a href="http://phrogz.net/css/vertical-align/index.html">this issue</a>.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это всегда, куда я иду, когда я должен вернуться к </font></font><a href="http://phrogz.net/css/vertical-align/index.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">этому вопросу</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: This is the simplest method I found and I use it all the time (<a href="http://jsfiddle.net/Nhs6j/">jsFiddle demo here</a>)
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Это самый простой метод, который я нашел, и я использую его все время ( </font></font><a href="http://jsfiddle.net/Nhs6j/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">демонстрация jsFiddle здесь</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>

source: To center the div on a page, <a href="http://jsfiddle.net/xKH7w/">check the fiddle link</a>.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Чтобы центрировать div на странице, </font></font><a href="http://jsfiddle.net/xKH7w/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">проверьте ссылку скрипты</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Unfortunately &mdash; but not surprisingly &mdash; the solution is more complicated than one would wish it to be. Also unfortunately, you'll need to use additional divs around the div you want vertically centered.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">К сожалению - но не удивительно - решение более сложное, чем хотелось бы. </font><font style="vertical-align: inherit;">Также, к сожалению, вам нужно будет использовать дополнительные элементы div вокруг элемента, который вы хотите вертикально центрировать.</font></font>

source: Vertical Centering in CSS
ru: Вертикальная центровка в CSS

source: View A Working Example With Dynamic Content
ru: Посмотреть рабочий пример с динамическим содержимым

source: You can add any content you want to the content box without caring about its width or height!
ru: Вы можете добавлять любой контент,не заботясь о его ширине и высоте!

source: You need a parent to decide the height and a child to center.
ru: Вам нужен родитель,который определит рост,а ребенок-центр.

source: or by <strong>using <code>display: flex;</code> and <code>margin: auto;</code></strong>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">или </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">используя </font></font> <code>display: flex;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">и </font></font> <code>margin: auto;</code> </strong>

source: should have <code>display: inline-block;</code>
ru: должен иметь <code>display: inline-block;</code>

source: should have <code>display: table-cell;</code>
ru: должен иметь <code>display: table-cell;</code>

source: should have <code>display: table;</code>
ru: должен иметь <code>display: table;</code>

source: should have <code>text-align: center;</code>
ru: должен иметь <code>text-align: center;</code>

source: should have <code>vertical-align: middle;</code>
ru: должен иметь <code>vertical-align: middle;</code>

source: should re-adjust the horizontal text-alignment to for example <code>text-align: left;</code> or <code>text-align: right;</code>, unless you want text to be centered
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">следует заново настроить горизонтальное выравнивание </font></font> <code>text-align: left;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> например, </font><font style="vertical-align: inherit;">text-align: left; </font><font style="vertical-align: inherit;">или </font></font> <code>text-align: right;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, если вы не хотите, чтобы текст центрировался</font></font>

source: ‣demo: <a href="https://jsfiddle.net/6m640rpp/">https://jsfiddle.net/6m640rpp/</a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Moдемо: </font></font><a href="https://jsfiddle.net/6m640rpp/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://jsfiddle.net/6m640rpp/</font></font></a>
