Repository: translationfeedback/feedback
Catalog: xlf/39/61/45/396145.*.001.xlf
Languages: ru

source: 'position' relative messes up the styling if the current div is in the body and has no container div. However 'fixed' seems to work, but it obviously fixes the content in the center of the viewport
ru: Относительное "положение" нарушает стилистику,если текущий div находится в теле и не имеет контейнерного div.Похоже,что 'fix' работает,но это,очевидно,исправляет содержимое в центре вью-порта

source: <a href="http://web.archive.org/web/20101107022613/http://www.laboratoriocaffeina.it/design/2007/05/11/vertical-centering-in-css-with-unknown-height-ie7-compatible.html">Vertical Centering in CSS with Unknown Height (Internet&nbsp;Explorer&nbsp;7 compatible)</a> (Archived article courtesy of the Wayback Machine)
ru: <a href="http://web.archive.org/web/20101107022613/http://www.laboratoriocaffeina.it/design/2007/05/11/vertical-centering-in-css-with-unknown-height-ie7-compatible.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вертикальное центрирование в CSS с неизвестной высотой (совместим с Internet Explorer 7)</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (Архивная статья любезно предоставлена ​​Wayback Machine)</font></font>

source: <a href="http://zerosixthree.se/vertical-align-anything-with-just-3-lines-of-css/">Vertical align anything with just 3 lines of CSS</a>.
ru: <a href="http://zerosixthree.se/vertical-align-anything-with-just-3-lines-of-css/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вертикальное выравнивание ничего с только 3 линии CSS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: <code>height</code> must be declared (see <a href="https://www.smashingmagazine.com/2013/08/absolute-horizontal-vertical-centering-css/#Height">Variable Height</a>)
ru: <code>height</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> должна быть объявлена ​​(см. </font></font><a href="https://www.smashingmagazine.com/2013/08/absolute-horizontal-vertical-centering-css/#Height"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Переменная высота</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>

source: <strike><a href="http://www.laboratoriocaffeina.it/design/2007/05/11/vertical-centering-in-css-with-unknown-height-ie7-compatible.html">Vertical Centering in CSS with Unknown Height (Internet&nbsp;Explorer&nbsp;7 compatible)</a></strike> (no longer live)
ru: <strike><a href="http://www.laboratoriocaffeina.it/design/2007/05/11/vertical-centering-in-css-with-unknown-height-ie7-compatible.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вертикальное центрирование в CSS с неизвестной высотой (совместимо с Internet Explorer 7)</font></font></a></strike><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (больше не работает)</font></font>

source: <strong>1) position: relative;</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) положение: относительное;</font></font></strong>

source: <strong>2) top: 50%;</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">2) верх: 50%;</font></font></strong>

source: <strong>3) transform: translateY(-50%);</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">3) преобразование: translateY (-50%);</font></font></strong>

source: <strong>Credits to</strong>: <em>Sebastian Ekstr&ouml;m</em>.
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кредиты для</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Себастьян Экстрём</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: <strong>Using flex property of CSS.</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Использование свойства flex в CSS.</font></font></strong>

source: <strong>Using percentage(%) height and width.</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Используя процент (%) высоты и ширины.</font></font></strong>

source: <strong>show text center</strong>
ru: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">показать текстовый центр</font></font></strong>

source: <sub>Source: <a href="https://www.smashingmagazine.com/2013/08/absolute-horizontal-vertical-centering-css">Absolute Horizontal And Vertical Centering In CSS</a></sub>
ru: <sub><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Источник: </font></font><a href="https://www.smashingmagazine.com/2013/08/absolute-horizontal-vertical-centering-css"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Абсолютное горизонтальное и вертикальное центрирование в CSS</font></font></a></sub>

source: A modern way to center an element vertically would be to use <a href="http://css-tricks.com/snippets/css/a-guide-to-flexbox/"><code>flexbox</code></a>.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Современный способ </font></font><a href="http://css-tricks.com/snippets/css/a-guide-to-flexbox/"> <code>flexbox</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> элемент по вертикали - использовать </font><font style="vertical-align: inherit;">flexbox</font><font style="vertical-align: inherit;"> .</font></font>

source: Actually you need two div's for vertical centering. The div containing the content must have a width and height.
ru: Вообще-то тебе нужны два дайвера для вертикального выравнивания по центру.Див,содержащий содержимое,должен иметь ширину и высоту.

source: After a lot of research I finally found the ultimate solution. It works even for floated elements. <a href="http://zerosixthree.se/vertical-align-anything-with-just-3-lines-of-css">View Source</a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">После долгих исследований я наконец нашел окончательное решение. </font><font style="vertical-align: inherit;">Это работает даже для плавающих элементов. </font></font><a href="http://zerosixthree.se/vertical-align-anything-with-just-3-lines-of-css"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просмотреть исходный код</font></font></a>

source: Also I used this styling for centering some overlay divs and found that in Mozilla all elements inside this transformed div had lost their bottom borders. Possibly a rendering issue. But adding just the minimal padding to some of them rendered it correctly. Chrome and Internet&nbsp;Explorer (surprisingly) rendered the boxes without any need for padding
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Также я использовал этот стиль для центрирования некоторых оверлеев div и обнаружил, что в Mozilla все элементы внутри этого трансформированного div потеряли свои нижние границы. </font><font style="vertical-align: inherit;">Возможно проблема рендеринга. </font><font style="vertical-align: inherit;">Но добавление только минимального отступа к некоторым из них сделало это правильно. </font><font style="vertical-align: inherit;">Chrome и Internet Explorer (на удивление) рендерили поля без необходимости заполнения.</font></font>

source: An example of this in code:
ru: Пример этого в коде:

source: And read <a href="http://www.smashingmagazine.com/2013/08/09/absolute-horizontal-vertical-centering-css/">this article</a> for an explanation. Note: <code>Height</code> is necessary.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">И прочитайте </font></font><a href="http://www.smashingmagazine.com/2013/08/09/absolute-horizontal-vertical-centering-css/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эту статью</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> для объяснения. </font><font style="vertical-align: inherit;">Примечание: </font></font> <code>Height</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> необходима.</font></font>

source: Another option is to use a CSS 3 transform:
ru: Другой вариант-использовать преобразование CSS 3:

source: Another option is to use flex box, <a href="http://jsfiddle.net/abbasmhd/56mc4e2u/">check the fiddle link</a>.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Другой вариант - использовать flex box, </font></font><a href="http://jsfiddle.net/abbasmhd/56mc4e2u/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">проверьте ссылку на скрипку</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Below is the best all-around solution I could build to vertically and horizontally center a fixed-width, <strong>flexible height</strong> content box. It was tested and working for recent versions of Firefox, Opera, Chrome, and Safari.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ниже приведено лучшее универсальное решение, которое я мог бы построить для центрирования по вертикали и горизонтали в центре с </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">гибкой высотой</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Он был протестирован и работает для последних версий Firefox, Opera, Chrome и Safari.</font></font>

source: Browser Support: <a href="https://caniuse.com/#search=flexbox">Flexbox Browser Support</a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поддержка браузера: </font></font><a href="https://caniuse.com/#search=flexbox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">поддержка браузера Flexbox</font></font></a>

source: Browser Support: <a href="https://caniuse.com/#search=grid">Grid Browser Support</a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поддержка браузеров: поддержка </font></font><a href="https://caniuse.com/#search=grid"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Grid Browser</font></font></a>

source: CSS Grid
ru: CSS-сеть

source: Centered regardless of padding (without box-sizing!)
ru: Ценируется независимо от набивки (без размеров коробки!).

source: Centering horizontally and vertically
ru: Центрирование по горизонтали и вертикали

source: Centering only vertically
ru: Центрирование только по вертикали

source: Cross-browser (including Internet&nbsp;Explorer&nbsp;8 - Internet&nbsp;Explorer&nbsp;10 without hacks!)
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Кросс-браузер (включая Internet Explorer 8 - Internet Explorer 10 без хаков!)</font></font>

source: Edit 2020 : only use this if you need to support old browsers like IE8 (which you should refuse to do 😉). If not, use flexbox.
ru: Редактирование 2020:используйте его только в том случае,если вам нужна поддержка старых браузеров,таких как IE8 (от чего вы должны отказаться 😉).Если нет,используйте флексбокс.

source: Especially for parent divs with relative (unknown) height, the <a href="http://css-tricks.com/centering-in-the-unknown/">centering in the unknown</a> solution works great for me. There are some really nice code examples in the article.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Особенно для родительских элементов div с относительной (неизвестной) высотой </font></font><a href="http://css-tricks.com/centering-in-the-unknown/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">центрирование в неизвестном</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> решении прекрасно работает для меня. </font><font style="vertical-align: inherit;">В статье есть несколько действительно хороших примеров кода.</font></font>

source: Expand snippet
ru: Расширить фрагмент

source: Flexbox solution
ru: решение Flexbox

source: Flexbox support: <a href="http://caniuse.com/flexbox">http://caniuse.com/flexbox</a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Поддержка Flexbox: </font></font><a href="http://caniuse.com/flexbox"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://caniuse.com/flexbox</font></font></a>

source: Following is an <strong>EXAMPLE</strong>:
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ниже приведен </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">пример</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: For new comers please try
ru: Для новичков,пожалуйста,попробуйте

source: For standards-compliant browsers like Mozilla, Opera, Safari, etc. you need to set the outer div to be displayed as a <em>table</em> and the inner div to be displayed as a <em>table-cell</em> &mdash; which can then be vertically centered. For Internet Explorer, you need to <em>position</em> the inner div <em>absolutely</em> within the outer div and then specify the <em>top</em> as <em>50%</em>. The following pages explain this technique well and provide some code samples too:
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Для совместимых со стандартами браузеров, таких как Mozilla, Opera, Safari и т. Д., Необходимо установить внешний div, который будет отображаться в виде </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">таблицы,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> и внутренний div, который будет отображаться в виде </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ячейки таблицы,</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - который затем может быть центрирован по вертикали. </font><font style="vertical-align: inherit;">Для Internet Explorer вам необходимо </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">расположить</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутренний div </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">абсолютно</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> внутри внешнего div, а затем указать </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">верхнюю часть</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> как </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">50%</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Следующие страницы хорошо объясняют эту технику и также предоставляют некоторые примеры кода:</font></font>

source: For those who don't want to make the jump:
ru: Для тех,кто не хочет прыгать:

source: From: <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Grid_Layout/Box_Alignment_in_CSS_Grid_Layout#Center_an_item_in_the_area">Mozilla - Grid Documentation - Align Div Vertically</a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">От: </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Grid_Layout/Box_Alignment_in_CSS_Grid_Layout#Center_an_item_in_the_area"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Mozilla - Сетка Документация - Выровнять Div по вертикали</font></font></a>

source: Here is the <a href="http://jsfiddle.net/ssPDD/">result</a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Вот </font></font><a href="http://jsfiddle.net/ssPDD/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">результат</font></font></a>

source: How can I center a <code>div</code> vertically in all major browsers, including Internet Explorer 6?
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Как я могу </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вертикально во всех основных браузерах, включая Internet Explorer 6?</font></font>

source: How to vertically center a div for all browsers
ru: Как вертикально отцентрировать дайв для всех браузеров.

source: I am adding this answer since I found some incompleteness in the previous version of this answer (and Stack Overflow won't allow me to simply comment).
ru: Я добавляю этот ответ,так как нашел некоторую незавершенность в предыдущей версии этого ответа (а Переполнение стека не позволяет мне просто так комментировать).

source: I built in some dynamic content to test the flexibility and would love to know if anyone sees any problems with it. It should work well for centered overlays also -- lightbox, pop-up, etc.
ru: Я встроил динамический контент для проверки гибкости и хотел бы знать,не видит ли кто-нибудь проблем с ним.Он должен хорошо работать и для центрированных накладок-лайтбокс,всплывающие окна и т.д.

source: I did it with this (change width, height, margin-top and margin-left accordingly):
ru: Я сделал это с помощью этого (измените ширину,высоту,маржин-топ и маржин-лево соответственно):

source: I just wrote this CSS and to know more, please go through: <a href="http://zerosixthree.se/vertical-align-anything-with-just-3-lines-of-css/">This article with vertical align anything with just 3 lines of CSS</a>.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я только что написал этот CSS и, чтобы узнать больше, пожалуйста, пройдите: </font></font><a href="http://zerosixthree.se/vertical-align-anything-with-just-3-lines-of-css/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Эта статья с вертикальным выравниванием всего с 3 строками CSS</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: I know the question has already an answer however I saw utility in the link for its simplicity.
ru: Я знаю,что ответ на вопрос уже есть,но я увидел в ссылке полезность для ее простоты.

source: I think a solid solution for all browsers without using flexbox - "align-items: center;" is a combination of display: table and vertical-align: middle;.
ru: Думаю,солидным решением для всех браузеров без использования флексбокса-"выравнивание элементов:по центру;" является сочетание отображения:табличное и вертикальное выравнивание:среднее;.

source: I want to center a <code>div</code> vertically with CSS. I don't want tables or JavaScript, but only pure CSS. I found some solutions, but all of them are missing Internet Explorer 6 support.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Я хочу </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> вертикально с помощью CSS. </font><font style="vertical-align: inherit;">Я не хочу таблиц или JavaScript, а только чистый CSS. </font><font style="vertical-align: inherit;">Я нашел несколько решений, но во всех них отсутствует поддержка Internet Explorer 6.</font></font>

source: If someone cares for Internet&nbsp;Explorer&nbsp;10 (and later) only, use <code>flexbox</code>:
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Если кому-то </font></font> <code>flexbox</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> только Internet Explorer 10 (и более поздние </font><font style="vertical-align: inherit;">версии</font><font style="vertical-align: inherit;"> ), используйте </font><font style="vertical-align: inherit;">flexbox</font><font style="vertical-align: inherit;"> :</font></font>

source: If you don't care about Internet Explorer 6 and 7, you can use a technique that involves two containers.
ru: Если вас не волнует Internet Explorer 6 и 7,вы можете использовать технику,которая включает в себя два контейнера.

source: If you want to center both horizontally and vertically, you also need the following.
ru: Если вы хотите отцентрировать и по горизонтали,и по вертикали,вам также нужно следующее.

source: It was tested in Chrome, Firefox, Opera, and Internet&nbsp;Explorer.
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Он был протестирован в Chrome, Firefox, Opera и Internet Explorer.</font></font>

source: Just do it: Add the class at your <code>div</code>:
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Просто сделайте это: добавьте класс в ваш </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Not answering for browser compatibility but to also mention the new Grid and the not so new Flexbox feature.
ru: Не отвечая на вопрос о совместимости с браузером,но также упомянуть о новой Grid и не очень новой функции Flexbox.

source: Note: a parent element is given the styles.
ru: Примечание:родительскому элементу присваиваются стили.

source: Now the flexbox solution is a very easy way for modern browsers, so I recommend this for you:
ru: Теперь решение flexbox-это очень простой способ для современных браузеров,поэтому я рекомендую его вам:

source: One more I can't see on the list:
ru: Еще один,который я не вижу в списке:

source: Recommended setting <code>overflow: auto</code> to prevent content spillover (see Overflow)
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Рекомендуемая настройка </font></font> <code>overflow: auto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> чтобы предотвратить распространение контента (см. Переполнение)</font></font>

source: Related: <a href="https://stackoverflow.com/questions/16702881/center-image-vertical-and-horizontal/46375063#46375063">Center a Image</a>
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Связанный: </font></font><a href="https://stackoverflow.com/questions/16702881/center-image-vertical-and-horizontal/46375063#46375063"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Center a Image</font></font></a>

source: Responsive with percentages and min-/max-
ru: Отзывчивый с процентами и мин-макс-

source: See also <a href="https://jsfiddle.net/Lr4eay5e/1/"><strong>this Fiddle</strong></a>!
ru: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Смотрите также </font></font><a href="https://jsfiddle.net/Lr4eay5e/1/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">эту скрипку</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> !</font></font>
