Repository: translationfeedback/feedback
Catalog: xlf/14/99/43/91/14994391.*.001.xlf
Languages: es

source: AngularJS doesn't need (or want) you to find elements using selectors - the primary difference between AngularJS's <strong>jqLite</strong> versus full-blown <strong>jQuery</strong> is that <a href="https://docs.angularjs.org/api/ng/function/angular.element">jqLite does not support selectors</a>.
es: AngularJS no necesita (o no quiere) que encuentre elementos usando selectores: la diferencia principal entre <strong>jqLite</strong> de AngularJS y <strong>jQuery</strong> completo es que <a href="https://docs.angularjs.org/api/ng/function/angular.element">jqLite no admite selectores</a> .

source: AngularJS extends HTML, so you don't have to put <code>&lt;div&gt;</code> all over the place just to make an application. It makes HTML actually work for applications rather than what it was designed for, which is static, educational web pages. It accomplishes this in a roundabout way using JavaScript, but fundamentally it is an extension of HTML, not JavaScript.
es: AngularJS extiende HTML, por lo que no tiene que poner <code>&lt;div&gt;</code> por todas partes solo para hacer una aplicaci&oacute;n. Hace que HTML realmente funcione para aplicaciones en lugar de para lo que fue dise&ntilde;ado, que es p&aacute;ginas web est&aacute;ticas y educativas. Lo logra de una manera indirecta usando JavaScript, pero fundamentalmente es una extensi&oacute;n de HTML, no JavaScript.

source: AngularJS gives us service objects.
es: AngularJS nos da objetos de servicio.

source: AngularJS gives you modules into which you can place your code. If you're writing a script that talks to Flickr for example, you might want to create a Flickr module to wrap all your Flickr related functions in. Modules can include other modules (DI). Your main application is usually a module, and this should include all the other modules your application will depend on.
es: AngularJS te da módulos en los que puedes colocar tu código.Si estás escribiendo un guión que habla con Flickr por ejemplo,tal vez quieras crear un módulo de Flickr para envolver todas tus funciones relacionadas con Flickr.Los módulos pueden incluir otros módulos (DI).Su aplicación principal suele ser un módulo,y éste debe incluir todos los demás módulos de los que dependerá su aplicación.

source: AngularJS has $scope objects. These are special objects created and maintained by AngularJS in which you store your model. Certain directives will spawn a new $scope, which by default inherits from its wrapping $scope using JavaScript prototypical inheritance. The $scope object is accessible in the controller and the view.
es: AngularJS tiene objetos de $scope.Estos son objetos especiales creados y mantenidos por AngularJS en los que almacena su modelo.Ciertas directivas darán lugar a un nuevo $scope,que por defecto hereda de su envoltorio $scope usando la herencia prototípica de JavaScript.El objeto $scope es accesible en el controlador y en la vista.

source: AngularJS has the concept of "Directives" for DOM manipulation and designing reusable UI components, so you should use it whenever you feel the need of doing DOM manipulation related stuff (directives are only place where you should write jQuery code while using AngularJS).
es: AngularJS tiene el concepto de "Directivas" para la manipulación de DOM y el diseño de componentes de interfaz de usuario reutilizables,por lo que debes usarlo siempre que sientas la necesidad de hacer cosas relacionadas con la manipulación de DOM (las directivas son sólo el lugar donde debes escribir el código jQuery mientras usas AngularJS).

source: AngularJS instead gives you a <strong>compiler</strong>.
es: AngularJS en cambio te da un <strong>compilador</strong> .

source: AngularJS involves some learning curve (more than jQuery :-).
es: AngularJS implica una cierta curva de aprendizaje (más que jQuery :-).

source: AngularJS is an MV* framework.
es: AngularJS es un marco MV*.

source: AngularJS is an entire client-side framework that uses the <a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller">MVC</a> pattern (check out their <a href="http://docs.angularjs.org/guide/concepts">graphical representation</a>). It greatly focuses on separation of concerns.
es: AngularJS es un marco completo del lado del cliente que utiliza el patr&oacute;n <a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller">MVC</a> (consulte su <a href="http://docs.angularjs.org/guide/concepts">representaci&oacute;n gr&aacute;fica</a> ). Se centra en gran medida en la separaci&oacute;n de las preocupaciones.

source: AngularJS itself includes a jQuery-lite edition within it. So for some basic DOM selection/manipulation, you really don't have to include the jQuery library (it saves many bytes to run on the network.)
es: La propia AngularJS incluye una edición jQuery-lite dentro de ella.Así que para una manipulación básica de la selección DOM,realmente no tienes que incluir la biblioteca jQuery (guarda muchos bytes para ejecutarse en la red).

source: AngularJS manages your dependencies for you. If you want an object, simply refer to it and AngularJS will get it for you.
es: AngularJS maneja sus dependencias por usted.Si quieres un objeto,simplemente refiérete a él y AngularJS te lo conseguirá.

source: AngularJS uses <strong>controllers</strong> and directives (each of which can have their own controller, and/or compile and linking functions) to remove behavior from the view/structure (HTML). Angular also has <strong>services</strong> and <strong>filters</strong> to help separate/organize your application.
es: AngularJS utiliza <strong>controladores</strong> y directivas (cada una de las cuales puede tener su propio controlador y / o compilar y vincular funciones) para eliminar el comportamiento de la vista / estructura (HTML). Angular tambi&eacute;n tiene <strong>servicios</strong> y <strong>filtros</strong> para ayudar a separar / organizar su aplicaci&oacute;n.

source: AngularJS will recognise that a FlickrService object is needed to instantiate the controller, and will provide one for us.
es: AngularJS reconocerá que se necesita un objeto FlickrService para instanciar el controlador,y nos proporcionará uno.

source: AngularJS: THE model is the truth, and you always think from that ANGLE.
es: AngularJS:EL modelo es la verdad,y siempre piensas desde ese ÁNGULO.

source: AngularJs Cool Principle - If you want some changes on your UI think from model data change perspective. Change your data and UI will re-render itself. You need not to play around DOM each time unless and until it is hardly required and that should also be handled through Angular Directives.
es: AngularJs Cool Principle-Si quieres algunos cambios en tu UI piensa desde la perspectiva del cambio de datos del modelo.Cambia tus datos y la interfaz de usuario se reproducirá.No necesitas jugar con el DOM cada vez a menos y hasta que apenas se requiera y eso también debe ser manejado a través de Directivas Angulares.

source: AngularJs and JQuery are completely different at every level except the JQLite functionality and you will see it once you start learning the AngularJs core features (I explained it below).
es: AngularJs y JQuery son completamente diferentes en todos los niveles excepto en la funcionalidad de JQLite y lo verás una vez que empieces a aprender las características principales de AngularJs (lo expliqué más abajo).

source: AngularJs is a client side framework that offers to build the independent client side application. JQuery is a client side library that play around the DOM.
es: AngularJs es un marco del lado del cliente que ofrece construir la aplicación independiente del lado del cliente.JQuery es una biblioteca del lado del cliente que juega alrededor del DOM.

source: Apart from mixing concerns, we also have the same problems of signifying intent that I mentioned before. But more importantly, we had to manually reference and update a DOM node. And if we want to delete a log entry, we have to code against the DOM for that too. How do we test the logic apart from the DOM? And what if we want to change the presentation?
es: Además de mezclar las preocupaciones,también tenemos los mismos problemas de intención de significar que mencioné antes.Pero lo más importante es que tuvimos que referenciar y actualizar manualmente un nodo DOM.Y si queremos borrar una entrada de registro,tenemos que codificar contra el DOM para eso también.¿Cómo probamos la lógica aparte del DOM? ¿Y si queremos cambiar la presentación?

source: Application design
es: Diseño de la aplicación

source: Are there any server-side considerations/restrictions?
es: ¿Hay alguna restricción de consideraciones del lado del servidor?

source: As a JavaScript MV* beginner and purely focusing on the application architecture (not the server/client-side matters), I would certainly recommend the following resource (which I am surprised wasn't mentioned yet): <a href="http://addyosmani.com/resources/essentialjsdesignpatterns/book/">JavaScript Design Patterns</a>, by Addy Osmani, as an introduction to different <strong>JavaScript Design Patterns</strong>. The terms used in this answer are taken from the linked document above. I'm not going to repeat what was worded really well in the accepted answer. Instead, this answer links back to the <strong>theoretical backgrounds</strong> which power AngularJS (and other libraries).
es: Como principiante de JavaScript MV * y centrado exclusivamente en la arquitectura de la aplicaci&oacute;n (no en el servidor / cliente), sin duda recomendar&iacute;a el siguiente recurso (que me sorprende que a&uacute;n no se haya mencionado): <a href="http://addyosmani.com/resources/essentialjsdesignpatterns/book/">Patrones de dise&ntilde;o de JavaScript</a> , por Addy Osmani , como introducci&oacute;n a diferentes <strong>patrones de dise&ntilde;o de JavaScript</strong> . Los t&eacute;rminos utilizados en esta respuesta se toman del documento vinculado anterior. No voy a repetir lo que fue redactado realmente bien en la respuesta aceptada. En cambio, esta respuesta se vincula con los <strong>antecedentes te&oacute;ricos</strong> que impulsan AngularJS (y otras bibliotecas).

source: At this point you likely have all sorts of questions concerning <a href="http://en.wikipedia.org/wiki/Search_engine_optimization">SEO</a> and accessibility, and rightly so. There are open issues here. Most screen readers will now parse JavaScript. Search engines can also index <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">AJAXed</a> content. Nevertheless, you will want to make sure you are using pushstate URLs and you have a decent sitemap. See here for a discussion of the issue: <a href="https://stackoverflow.com/a/23245379/687677">https://stackoverflow.com/a/23245379/687677</a>
es: En este punto, es probable que tenga todo tipo de preguntas sobre <a href="http://en.wikipedia.org/wiki/Search_engine_optimization">SEO</a> y accesibilidad, y con raz&oacute;n. Hay problemas abiertos aqu&iacute;. La mayor&iacute;a de los lectores de pantalla ahora analizar&aacute;n JavaScript. Los motores de b&uacute;squeda tambi&eacute;n pueden indexar contenido <a href="http://en.wikipedia.org/wiki/Ajax_%28programming%29">AJAXed</a> . Sin embargo, querr&aacute; asegurarse de que est&aacute; utilizando URL de estado de inserci&oacute;n y que tiene un mapa del sitio decente. Vea aqu&iacute; para una discusi&oacute;n del problema: <a href="https://stackoverflow.com/a/23245379/687677">https://stackoverflow.com/a/23245379/687677</a>

source: Attach a controller to each view (using ng-view and routing, or ng-controller). Have the controller find/get only whatever model data the view needs to do its job. Make controllers as thin as possible.
es: Adjuntar un controlador a cada vista (usando ng-view y routing,o ng-controller).Haz que el controlador encuentre sólo los datos del modelo que la vista necesita para hacer su trabajo.Haga los controladores tan delgados como sea posible.

source: Because AngularJS treats your HTML page as a template. The template is not supposed to be semantic as your content is typically stored in your model which ultimately comes from your API. AngularJS compiles your DOM with the model to produce a semantic web page.
es: Porque AngularJS trata su página HTML como una plantilla.La plantilla no se supone que sea semántica ya que su contenido es típicamente almacenado en su modelo que en última instancia proviene de su API.AngularJS compila tu DOM con el modelo para producir una página web semántica.

source: Because data binding is done from the template, using either an attribute or the curly brace syntax, it's super easy to do. There's little cognitive overhead associated with it so you'll find yourself doing it all the time.
es: Debido a que la vinculación de datos se hace desde la plantilla,usando un atributo o la sintaxis del rizo,es super fácil de hacer.Hay poca sobrecarga cognitiva asociada a ello,así que te encontrarás haciéndolo todo el tiempo.

source: Being a framework, it hosts your code and takes ownership of decisions about what to call and when!
es: Siendo un marco de trabajo,aloja su código y se hace cargo de las decisiones sobre qué llamar y cuándo!

source: Binds the input element to <code>$scope.user.name</code>. Updating the input will update the value in your current scope, and vice-versa.
es: Vincula el elemento de entrada a <code>$scope.user.name</code> . La actualizaci&oacute;n de la entrada actualizar&aacute; el valor en su alcance actual, y viceversa.

source: But because we have separation of concerns, we can do test-driven development iteratively in AngularJS! For example, let's say we want a super-simple directive to indicate in our menu what our current route is. We can declare what we want in the view of our application:
es: Pero debido a que tenemos la separación de las preocupaciones,podemos hacer el desarrollo de prueba de forma iterativa en AngularJS! Por ejemplo,digamos que queremos una directiva súper simple para indicar en nuestro menú cuál es nuestra ruta actual.Podemos declarar lo que queremos en la vista de nuestra aplicación:

source: But for that matter, our view could look like this:
es: Pero para el caso,nuestra vista podría verse así:

source: But in AngularJS, you must start from the ground up with your architecture in mind. Instead of starting by thinking "I have this piece of the DOM and I want to make it do X", you have to start with what you want to accomplish, then go about designing your application, and then finally go about designing your view.
es: Pero en AngularJS,debes empezar desde cero con tu arquitectura en mente.En lugar de empezar pensando "Tengo esta pieza del DOM y quiero que haga X",tienes que empezar con lo que quieres lograr,luego ir a diseñar tu aplicación,y finalmente ir a diseñar tu vista.

source: But let's dive a little deeper...
es: Pero vamos a bucear un poco más profundo...

source: By googling, I see that there is a standalone jQuery selector module out there. It's Sizzle.
es: Al buscar en Google,veo que hay un módulo selector de jQuery independiente por ahí.Es Sizzle.

source: CSS - Styling, without the CSS the page is still readable.
es: CSS-Estilo,sin el CSS la página sigue siendo legible.

source: Can you describe the paradigm shift that is necessary?
es: ¿Puede describir el cambio de paradigma que es necesario?

source: Closure vs. $scope
es: Cierre vs.alcance de los dólares

source: Controller - Your controller is a JavaScript function which hooks the view to the model. Its function is to initialise $scope. Depending on your application, you may or may not need to create a controller. You can have many controllers on a page.
es: Controlador-Su controlador es una función de JavaScript que engancha la vista al modelo.Su función es inicializar el $scope.Dependiendo de su aplicación,puede o no necesitar crear un controlador.Puedes tener muchos controladores en una página.

source: Controllers and providers (services, factories, etc.) are for modifying the data model, NOT HTML.
es: Los controladores y proveedores (servicios,fábricas,etc.)son para modificar el modelo de datos,NO el HTML.

source: DI means that instead of writing your application and wiring it together, you instead define a library of components, each identified by a string.
es: DI significa que en lugar de escribir su aplicación y conectarla,define una biblioteca de componentes,cada uno identificado por una cadena.

source: Data binding
es: La vinculación de los datos

source: Dependency injection
es: Inyección de dependencia

source: Developers new to AngularJS often ask a question like: how do I find all links of a specific kind and add a directive onto them. The developer is always flabbergasted when we reply: you don't. But the reason you don't do that is that this is like half-jQuery, half-AngularJS, and no good. The problem here is that the developer is trying to "do jQuery" in the context of AngularJS. That's never going to work well. The view <em>is</em> the official record. Outside of a directive (more on this below), you never, ever, <em>never</em> change the DOM. And directives are applied <em>in the view</em>, so intent is clear.
es: Los desarrolladores nuevos en AngularJS a menudo hacen una pregunta como: &iquest;c&oacute;mo encuentro todos los enlaces de un tipo espec&iacute;fico y agrego una directiva sobre ellos? El desarrollador siempre queda estupefacto cuando respondemos: usted no. Pero la raz&oacute;n por la que no haces eso es que esto es como half-jQuery, half-AngularJS, y no sirve. El problema aqu&iacute; es que el desarrollador est&aacute; tratando de "hacer jQuery" en el contexto de AngularJS. Eso nunca va a funcionar bien. La vista <em>es</em> el registro oficial. Fuera de una directiva (m&aacute;s sobre esto a continuaci&oacute;n), nunca, nunca, cambias el DOM. Y las directivas se aplican <em>en la vista</em> , por lo que la intenci&oacute;n es clara.

source: Directives can then in turn pull in additional Angular components such as controllers, services, etc. What comes out the bottom of the compiler is a fully formed web application, wired up and ready to go.
es: Las directivas pueden a su vez atraer componentes angulares adicionales como controladores,servicios,etc.Lo que sale de la parte inferior del compilador es una aplicación web completamente formada,conectada y lista para funcionar.

source: Distinct model layer
es: Distinta capa modelo

source: Doing so will allow you to leverage their <a href="http://docs.angularjs.org/api/ngResource.$resource">resource factory</a>, which creates an abstraction of your server side RESTful <a href="http://en.wikipedia.org/wiki/Application_programming_interface">API</a> and makes server-side calls (get, save, delete, etc.) incredibly easy.
es: Hacerlo le permitir&aacute; aprovechar su <a href="http://docs.angularjs.org/api/ngResource.$resource">f&aacute;brica de recursos</a> , lo que crea una abstracci&oacute;n de la <a href="http://en.wikipedia.org/wiki/Application_programming_interface">API</a> RESTful del lado del servidor y hace que las llamadas del lado del servidor (obtener, guardar, eliminar, etc.) sean incre&iacute;blemente f&aacute;ciles.

source: Don't even use jQuery. Don't even include it. It will hold you back. And when you come to a problem that you think you know how to solve in jQuery already, before you reach for the <code>$</code>, try to think about how to do it within the confines the AngularJS. If you don't know, ask! 19 times out of 20, the best way to do it doesn't need jQuery and to try to solve it with jQuery results in more work for you.
es: Ni siquiera uses jQuery. Ni siquiera lo incluyas. Te detendr&aacute;. Y cuando encuentre un problema que cree que ya sabe c&oacute;mo resolver en jQuery, antes de alcanzar el <code>$</code> , trate de pensar c&oacute;mo hacerlo dentro de los l&iacute;mites del AngularJS. Si no lo sabes, &iexcl;pregunta! 19 de cada 20 veces, la mejor manera de hacerlo no necesita jQuery y tratar de resolverlo con jQuery resulta en m&aacute;s trabajo para usted.

source: First know that <a href="http://en.wikipedia.org/wiki/Single-page_application">single-page applications</a> are <em>applications</em>. They're <em>not</em> webpages. So we need to think like a server-side developer <em>in addition</em> to thinking like a client-side developer. We have to think about how to divide our application into individual, extensible, testable components.
es: Primero sepa que <a href="http://en.wikipedia.org/wiki/Single-page_application">las aplicaciones de una sola p&aacute;gina</a> son <em>aplicaciones</em> . No son p&aacute;ginas web. Por lo tanto, debemos pensar como un desarrollador del lado del servidor <em>adem&aacute;s</em> de pensar como un desarrollador del lado del cliente. Tenemos que pensar en c&oacute;mo dividir nuestra aplicaci&oacute;n en componentes individuales, extensibles y comprobables.

source: First up, Angular doesn't replace jQuery
es: Primero,Angular no reemplaza a jQuery

source: First, jQuery was never necessary. There's nothing we did here that needed jQuery at all!
es: Primero,jQuery nunca fue necesario.¡No hay nada de lo que hicimos aquí que necesitara jQuery en absoluto!

source: For a view that looks like this:
es: Para una vista como esta:

source: For example, here I define a service:
es: Por ejemplo,aquí defino un servicio:

source: For example, if you want a carousel on your page, you might define an unordered list of figures, perhaps wrapped in a nav element. You might then write some jQuery to select the list on the page and restyle it as a gallery with timeouts to do the sliding animation.
es: Por ejemplo,si quiere un carrusel en su página,podría definir una lista de figuras sin orden,tal vez envueltas en un elemento de navegación.Luego podrías escribir algo de jQuery para seleccionar la lista de la página y volverla a diseñar como una galería con tiempos de espera para hacer la animación de deslizamiento.

source: For example, when you get data from THE server which you intend to display in some format in the DOM, in jQuery, you need to '1. FIND' where in the DOM you want to place this data, the '2. UPDATE/APPEND' it there by creating a new node or just setting its <a href="http://www.tizag.com/javascriptT/javascript-innerHTML.php">innerHTML</a>. Then when you want to update this view, you then '3. FIND' the location and '4. UPDATE'. This cycle of find and update all done within the same context of getting and formatting data from server is gone in AngularJS.
es: Por ejemplo, cuando obtiene datos del servidor THE que pretende mostrar en alg&uacute;n formato en el DOM, en jQuery, necesita '1. ENCONTRAR 'donde en el DOM desea colocar estos datos, el' 2. ACTUALIZAR / APROBAR 'all&iacute; creando un nuevo nodo o simplemente configurando su <a href="http://www.tizag.com/javascriptT/javascript-innerHTML.php">innerHTML</a> . Luego, cuando desee actualizar esta vista, entonces '3. ENCUENTRE 'la ubicaci&oacute;n y' 4. ACTUALIZAR'. Este ciclo de b&uacute;squeda y actualizaci&oacute;n, todo hecho dentro del mismo contexto de obtenci&oacute;n y formateo de datos del servidor, se ha ido en AngularJS.

source: For example:
es: Por ejemplo:

source: Fourth, closely related to the third, is that jqLite elements needn't be wrapped in <code>$</code> - the <code>element</code> that is passed to the <code>link</code> function would <em>already be</em> a jQuery element!
es: El cuarto, estrechamente relacionado con el tercero, es que los elementos jqLite no necesitan estar envueltos en <code>$</code> : &iexcl;el <code>element</code> o que se pasa a la funci&oacute;n de <code>link</code> <em>ya ser&iacute;a</em> un elemento jQuery!
