Repository: translationfeedback/feedback
Catalog: xlf/14/99/43/91/14994391.*.001.xlf
Languages: es

source: The template drives the application so we get HTML level granularity. If we want to make case by case exceptions, the template makes this easy.
es: La plantilla dirige la aplicación para que obtengamos granularidad a nivel HTML.Si queremos hacer excepciones caso por caso,la plantilla lo hace fácil.

source: The template is in the driving seat.
es: La plantilla está en el asiento del conductor.

source: The tendency with jQuery is to write great big plugins like lightbox which we then configure by passing in numerous values and options.
es: La tendencia con jQuery es escribir grandes plugins como lightbox que luego configuramos pasando numerosos valores y opciones.

source: The view is the "official record"
es: La vista es el "registro oficial"

source: There are a few things wrong with this:
es: Hay algunas cosas que están mal en esto:

source: These two do the same thing, but in the AngularJS version anyone looking at the template knows what's supposed to happen. Whenever a new member of the development team comes on board, she can look at this and then <em>know</em> that there is a directive called <code>dropdownMenu</code> operating on it; she doesn't need to intuit the right answer or sift through any code. The view told us what was supposed to happen. Much cleaner.
es: Estos dos hacen lo mismo, pero en la versi&oacute;n AngularJS cualquiera que mire la plantilla sabe lo que se supone que debe suceder. Cada vez que un nuevo miembro del equipo de desarrollo se une, puede ver esto y luego <em>saber</em> que hay una directiva llamada <code>dropdownMenu</code> que opera en &eacute;l; ella no necesita intuir la respuesta correcta o examinar cualquier c&oacute;digo. La vista nos dijo lo que se supon&iacute;a que suceder&iacute;a. Mucho m&aacute;s limpio.

source: They're apples and oranges. You don't want to compare them. They're two different things. AngularJs has already jQuery lite built in which allows you to perform basic DOM manipulation without even including the full blown jQuery version.
es: Son manzanas y naranjas.No quieres compararlas.Son dos cosas diferentes.AngularJs ya tiene jQuery lite incorporado que te permite realizar manipulación básica de DOM sin siquiera incluir la versión completa de jQuery.

source: Think about how you want to present your models -- your views. Create HTML templates for each view, using the necessary directives to get dynamic databinding.
es: Piensa en cómo quieres presentar a tus modelos...tus puntos de vista.Cree plantillas HTML para cada vista,usando las directivas necesarias para obtener una base de datos dinámica.

source: Think about your models. Create services or your own JavaScript objects for those models.
es: Piensa en tus modelos.Crea servicios o tus propios objetos JavaScript para esos modelos.

source: Think less about unobtrusive JavaScript, and instead think in terms of HTML extensions.
es: Piensa menos en un JavaScript discreto,y en su lugar piensa en términos de extensiones HTML.

source: Think of the logger we programmed in section 3. Even if we put that in a directive, we <em>still</em> want to do it the "Angular Way". It <em>still</em> doesn't take any DOM manipulation! There are lots of times when DOM manipulation is necessary, but it's a <em>lot</em> rarer than you think! Before doing DOM manipulation <em>anywhere</em> in your application, ask yourself if you really need to. There might be a better way.
es: Piense en el registrador que programamos en la secci&oacute;n 3. Incluso si lo ponemos en una directiva, <em>todav&iacute;a</em> queremos hacerlo "Angular Way". &iexcl; <em>Todav&iacute;a</em> no requiere ninguna manipulaci&oacute;n DOM! Hay muchas ocasiones en que es necesaria la manipulaci&oacute;n DOM, &iexcl;pero es <em>mucho</em> m&aacute;s raro de lo que piensas! Antes de realizar la manipulaci&oacute;n DOM en <em>cualquier parte</em> de su aplicaci&oacute;n, preg&uacute;ntese si realmente lo necesita. Puede haber una mejor manera.

source: Third, even assuming jQuery <em>was</em> required for this directive to work, jqLite (<code>angular.element</code>) will <em>always</em> use jQuery if it was loaded! So we needn't use the <code>$</code> - we can just use <code>angular.element</code>.
es: En tercer lugar, incluso suponiendo que <em>se</em> requiera jQuery para que esta directiva funcione, jqLite ( <code>angular.element</code> ) <em>siempre</em> usar&aacute; jQuery si se carg&oacute;. Por lo tanto, no necesitamos usar <code>$</code> , solo podemos usar <code>angular.element</code> .

source: This a little messy and a trifle frail. But in AngularJS, we can do this:
es: Esto es un poco desordenado y un poco frágil.Pero en AngularJS,podemos hacer esto:

source: This directive can be rewritten (even for very complicated cases!) much more simply like so:
es: Esta directiva puede ser reescrita (¡incluso para casos muy complicados!)de forma mucho más sencilla:

source: This is a mistake in AngularJS.
es: Esto es un error en AngularJS.

source: This is a radical inversion of control that takes some getting used to.
es: Se trata de una inversión radical de control a la que cuesta acostumbrarse.

source: This is by far one of the most awesome features of AngularJS and cuts out a lot of the need to do the kinds of DOM manipulations I mentioned in the previous section. AngularJS will automatically update your view so you don't have to! In jQuery, we respond to events and then update content. Something like:
es: Esta es,con mucho,una de las características más impresionantes de AngularJS y elimina la necesidad de hacer el tipo de manipulaciones DOM que mencioné en la sección anterior.¡AngularJS actualizará automáticamente tu vista para que no tengas que hacerlo! En jQuery,respondemos a los eventos y luego actualizamos el contenido.Algo así como:

source: This is normal, you should push through. Angular is worth it.
es: Esto es normal,deberías empujar a través.Angular vale la pena.

source: This is really part of section 3 on architecture, but it's so important that I'm putting it as its own top-level section.
es: Esto es realmente parte de la sección 3 sobre arquitectura,pero es tan importante que lo pongo como su propia sección de nivel superior.

source: This is the clever part. Because the structure of $scope inheritance roughly follows the structure of the DOM, elements have access to their own scope, and any containing scopes seamlessly, all the way up to the global $scope (which is not the same as the global scope).
es: Esta es la parte inteligente.Debido a que la estructura de la herencia de $scope sigue aproximadamente la estructura del DOM,los elementos tienen acceso a su propio alcance,y a cualquier otro que contenga alcances sin problemas,hasta el $scope global (que no es lo mismo que el alcance global).

source: This is the first big difference. To jQuery, your web page is a DOM to be manipulated. To AngularJS, your HTML is code to be compiled. AngularJS reads in your whole web page and literally compiles it into a new web page using its built in compiler.
es: Esta es la primera gran diferencia.Para jQuery,su página web es un DOM para ser manipulado.Para AngularJS,tu HTML es un código a ser compilado.AngularJS lee toda tu página web y literalmente la compila en una nueva página web usando su compilador incorporado.

source: This makes it much easier to pass data around, and to store data at an appropriate level. If a dropdown is unfolded, only the dropdown $scope needs to know about it. If the user updates their preferences, you might want to update the global $scope, and any nested scopes listening to the user preferences would automatically be alerted.
es: Esto facilita mucho la transmisión de datos y el almacenamiento de datos a un nivel apropiado.Si se despliega un desplegable,sólo el desplegable $scope necesita saberlo.Si el usuario actualiza sus preferencias,es posible que desee actualizar el $scope global,y cualquier alcance anidado que escuche las preferencias del usuario será alertado automáticamente.

source: This makes wiring things together very easy, and pretty much eliminates any tendency towards spagettification. We have a flat list of components, and AngularJS hands them to us one by one as and when we need them.
es: Esto hace que el cableado de las cosas sea muy fácil,y prácticamente elimina cualquier tendencia a la espaguetización.Tenemos una lista plana de componentes,y AngularJS nos los entrega uno por uno cuando los necesitamos.

source: This might sound complicated, in fact, once you relax into it, it's like flying. You don't need to create the $scope object, AngularJS instantiates and configures it for you, correctly and appropriately based on your template hierarchy. AngularJS then makes it available to your component using the magic of dependency injection (more on this later).
es: Esto puede sonar complicado,de hecho,una vez que te relajas en él,es como volar.No necesitas crear el objeto $scope,AngularJS lo instanciará y configurará por ti,correcta y apropiadamente basado en tu jerarquía de plantillas.AngularJS entonces lo pone a disposición de su componente usando la magia de la inyección de dependencia (más sobre esto más adelante).

source: Those are some very nice, but lengthy answers.
es: Esas son algunas respuestas muy bonitas,pero largas.

source: Though I didn't show it here, the data binding is two-way. So those log messages could also be editable in the view just by doing this: <code>&lt;input ng-model="entry.msg" /&gt;</code>. And there was much rejoicing.
es: Aunque no lo mostr&eacute; aqu&iacute;, el enlace de datos es bidireccional. Entonces, esos mensajes de registro tambi&eacute;n podr&iacute;an ser editables en la vista simplemente haciendo esto: <code>&lt;input ng-model="entry.msg" /&gt;</code> . Y hubo mucho regocijo.

source: To answer this question, I want to share my experience on the first enterprise application with AngularJS. These are the most awesome features that Angular provide where we start changing our jQuery mindset and we get the Angular like a framework and not the library.
es: Para responder a esta pregunta,quiero compartir mi experiencia en la primera aplicación empresarial con AngularJS.Estas son las características más impresionantes que Angular proporciona donde empezamos a cambiar nuestra mentalidad de jQuery y obtenemos el Angular como un marco de trabajo y no la biblioteca.

source: To describe the "paradigm shift", I think a short answer can suffice.
es: Para describir el "cambio de paradigma",creo que una respuesta corta puede ser suficiente.

source: To help us out with separation of concerns is <a href="http://en.wikipedia.org/wiki/Dependency_injection">dependency injection</a> (DI). If you come from a server-side language (from <a href="http://en.wikipedia.org/wiki/Java_%28programming_language%29">Java</a> to <a href="http://en.wikipedia.org/wiki/PHP">PHP</a>) you're probably familiar with this concept already, but if you're a client-side guy coming from jQuery, this concept can seem anything from silly to superfluous to hipster. But it's not. :-)
es: Para ayudarnos con la separaci&oacute;n de preocupaciones es <a href="http://en.wikipedia.org/wiki/Dependency_injection">la inyecci&oacute;n de dependencia</a> (DI). Si vienes de un lenguaje del lado del servidor (de <a href="http://en.wikipedia.org/wiki/Java_%28programming_language%29">Java</a> a <a href="http://en.wikipedia.org/wiki/PHP">PHP</a> ) probablemente ya est&eacute;s familiarizado con este concepto, pero si eres un chico del lado del cliente que viene de jQuery, este concepto puede parecer desde tonto hasta superfluo o hipster . Pero no lo es. :-)

source: To put in another way, in jQuery, you need to think about CSS selectors, that is, where is the <code>div</code> or <code>td</code> that has a class or attribute, etc., so that I can get their HTML or color or value, but in AngularJS, you will find yourself thinking like this: what model am I dealing with, I will set the model's value to true. You are not bothering yourself of whether the view reflecting this value is a checked box or resides in a <code>td</code> element (details you would have often needed to think about in jQuery).
es: Para decirlo de otra manera, en jQuery, debe pensar en los selectores CSS, es decir, d&oacute;nde est&aacute; el <code>div</code> o <code>td</code> que tiene una clase o atributo, etc., para que pueda obtener su HTML o color o valor, pero en AngularJS, se encontrar&aacute; pensando as&iacute;: con qu&eacute; modelo estoy tratando, establecer&eacute; el valor del modelo en verdadero. No se molesta en si la vista que refleja este valor es una casilla marcada o reside en un elemento <code>td</code> (detalles que a menudo habr&iacute;a tenido que pensar en jQuery).

source: To sum up
es: Para resumir

source: To sum up my experiences:
es: Para resumir mis experiencias:

source: Unobtrusive JavaScript with Selectors vs. Declarative Templates
es: Javascript discreto con selectores vs.plantillas declarativas

source: Until you start to use this, it's hard to explain just what a massive time boon this is. Nothing like AngularJS DI exists inside jQuery.
es: Hasta que no empieces a usar esto,es difícil explicar la enorme ventaja temporal que supone.No existe nada como AngularJS DI dentro de jQuery.

source: Until you want to make a small change.
es: Hasta que quieras hacer un pequeño cambio.

source: View - Your views are written in HTML. The view is usually not semantic because your data lives in the model.
es: Vista-Sus vistas están escritas en HTML.La vista no suele ser semántica porque tus datos viven en el modelo.

source: What is the biggest difference? What should I stop doing/using; what should I start doing/using instead?
es: ¿Cuál es la mayor diferencia? ¿Qué debería dejar de consumir,qué debería empezar a consumir en su lugar?

source: What should I stop doing/using; What should I start doing/using instead?
es: ¿Qué debería dejar de consumir? ¿Qué debería empezar a consumir en su lugar?

source: What this means is that AngularJS reads your entire DOM from top to bottom and treats it as code, literally as instructions to the compiler. As it traverses the DOM, It looks for specific <strong>directives</strong> (compiler directives) that tell the AngularJS compiler how to behave and what to do. Directives are little objects full of JavaScript which can match against attributes, tags, classes or even comments.
es: Lo que esto significa es que AngularJS lee todo su DOM de arriba a abajo y lo trata como c&oacute;digo, literalmente como instrucciones para el compilador. A medida que atraviesa el DOM, busca <strong>directivas</strong> espec&iacute;ficas ( <strong>directivas del</strong> compilador) que le dicen al compilador AngularJS c&oacute;mo comportarse y qu&eacute; hacer. Las directivas son peque&ntilde;os objetos llenos de JavaScript que pueden coincidir con atributos, etiquetas, clases o incluso comentarios.

source: When the Angular compiler determines that a piece of the DOM matches a particular directive, it calls the directive function, passing it the DOM element, any attributes, the current $scope (which is a local variable store), and some other useful bits. These attributes may contain expressions which can be interpreted by the Directive, and which tell it how to render, and when it should redraw itself.
es: Cuando el compilador Angular determina que una parte del DOM coincide con una directiva particular,llama a la función directiva,pasándole el elemento DOM,cualquier atributo,el $scope actual (que es un almacén de variables locales),y algunos otros bits útiles.Estos atributos pueden contener expresiones que pueden ser interpretadas por la directiva,y que le dicen cómo rendir,y cuándo debe redibujarse.

source: When we just look at the view, it's not immediately obvious that there is any functionality here. For small applications, that's fine. But for non-trivial applications, things quickly get confusing and hard to maintain.
es: Cuando miramos la vista,no es inmediatamente obvio que haya alguna funcionalidad aquí.Para aplicaciones pequeñas,está bien.Pero para aplicaciones no triviales,las cosas se vuelven rápidamente confusas y difíciles de mantener.

source: When you first see this you might be tempted to write AngularJS off as old school intrusive JavaScript (like I did at first). In fact, AngularJS does not play by those rules. In AngularJS, your HTML5 is a template. It is compiled by AngularJS to produce your web page.
es: Cuando veas esto por primera vez,podrías estar tentado de escribir AngularJS como un JavaScript intrusivo de la vieja escuela (como lo hice yo al principio).De hecho,AngularJS no juega con esas reglas.En AngularJS,tu HTML5 es una plantilla.Es compilado por AngularJS para producir su página web.

source: With <strong>jQuery</strong> you tell the DOM what needs to happen, step by step. With <strong><a href="http://en.wikipedia.org/wiki/AngularJS">AngularJS</a></strong> you describe what results you want but not how to do it. More on this <a href="https://stackoverflow.com/questions/1784664/what-is-the-difference-between-declarative-and-imperative-programming">here</a>. Also, check out Mark Rajcok's answer.
es: Con <strong>jQuery</strong> le dices al DOM lo que debe suceder, paso a paso. Con <strong><a href="http://en.wikipedia.org/wiki/AngularJS">AngularJS,</a></strong> usted describe qu&eacute; resultados desea pero no c&oacute;mo hacerlo. M&aacute;s sobre esto <a href="https://stackoverflow.com/questions/1784664/what-is-the-difference-between-declarative-and-imperative-programming">aqu&iacute;</a> . Adem&aacute;s, mira la respuesta de Mark Rajcok.

source: With AngularJS you have your model (JavaScript objects you are already used to) and the value of the model tells you about the model (obviously) and about the view, and an operation on the model automatically propagates to the view, so you don't have to think about it. You will find yourself in AngularJS no longer finding things in the DOM.
es: Con AngularJS tienes tu modelo (objetos de JavaScript a los que ya estás acostumbrado)y el valor del modelo te dice sobre el modelo (obviamente)y sobre la vista,y una operación en el modelo se propaga automáticamente a la vista,así que no tienes que pensar en ello.Te encontrarás en AngularJS no encontrando ya cosas en el DOM.

source: With jQuery your HTML page should contain semantic meaningful content. If the JavaScript is turned off (by a user or search engine) your content remains accessible.
es: Con jQuery tu página HTML debe contener contenido semántico significativo.Si el JavaScript está desactivado (por un usuario o un motor de búsqueda)tu contenido permanece accesible.

source: You can do a lot with jQuery without knowing about how JavaScript prototypal inheritance works. When developing AngularJS applications, you will avoid some common pitfalls if you have a good understanding of JavaScript inheritance. Recommended reading: <a href="https://stackoverflow.com/questions/14049480/what-are-the-nuances-of-scope-prototypal-prototypical-inheritance-in-angularjs">What are the nuances of scope prototypal / prototypical inheritance in AngularJS?</a>
es: Puede hacer mucho con jQuery sin saber c&oacute;mo funciona la herencia de prototipos de JavaScript. Al desarrollar aplicaciones de AngularJS, evitar&aacute; algunas trampas comunes si conoce bien la herencia de JavaScript. Lectura recomendada: <a href="https://stackoverflow.com/questions/14049480/what-are-the-nuances-of-scope-prototypal-prototypical-inheritance-in-angularjs">&iquest;Cu&aacute;les son los matices del alcance prototipo / herencia protot&iacute;pica en AngularJS?</a>

source: You get simple code reuse, if you want to write another application based on Flickr, you can just include the Flickr module and voila, you have access to all your Flickr related functions in your new application.
es: Obtienes una simple reutilización de código,si quieres escribir otra aplicación basada en Flickr,sólo tienes que incluir el módulo de Flickr y voila,tienes acceso a todas tus funciones relacionadas con Flickr en tu nueva aplicación.

source: You may use it on existing applications where you are already using pure jQuery. However, if you want to fully take advantage of the AngularJS features you may consider coding the server side using a <a href="http://en.wikipedia.org/wiki/Representational_state_transfer#RESTful_web_services">RESTful</a> approach.
es: Puede usarlo en aplicaciones existentes donde ya est&aacute; usando jQuery puro. Sin embargo, si desea aprovechar al m&aacute;ximo las caracter&iacute;sticas de AngularJS, puede considerar codificar el lado del servidor utilizando un enfoque <a href="http://en.wikipedia.org/wiki/Representational_state_transfer#RESTful_web_services">RESTful</a> .

source: You'll often hear "only do DOM manipulation in a directive". <strong>This is a necessity.</strong> Treat it with due deference!
es: A menudo escuchar&aacute; "solo manipula DOM en una directiva". <strong>Esto es una necesidad</strong> &iexcl;Tr&aacute;telo con la debida deferencia!

source: Your template drives your application. It's treated as a <a href="http://en.wikipedia.org/wiki/Domain-specific_language">DSL</a>. You write AngularJS components, and AngularJS will take care of pulling them in and making them available at the right time based on the structure of your template. This is very different to a standard <a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller">MVC</a> pattern, where the template is just for output.
es: Su plantilla impulsa su aplicaci&oacute;n. Se trata como un <a href="http://en.wikipedia.org/wiki/Domain-specific_language">DSL</a> . Usted escribe los componentes de AngularJS, y AngularJS se encargar&aacute; de incorporarlos y ponerlos a su disposici&oacute;n en el momento adecuado seg&uacute;n la estructura de su plantilla. Esto es muy diferente a un patr&oacute;n <a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller">MVC</a> est&aacute;ndar, donde la plantilla es solo para salida.

source: Your template should be declarative; its meaning should be clear simply by reading it. We use custom attributes with meaningful names. We make up new HTML elements, again with meaningful names. A designer with minimal HTML knowledge and no coding skill can read your AngularJS template and understand what it is doing. He or she can make modifications. <em>This is the Angular way.</em>
es: Su plantilla debe ser declarativa; su significado debe quedar claro simplemente al leerlo. Utilizamos atributos personalizados con nombres significativos. Creamos nuevos elementos HTML, nuevamente con nombres significativos. Un dise&ntilde;ador con un conocimiento m&iacute;nimo de HTML y sin habilidad de codificaci&oacute;n puede leer su plantilla AngularJS y comprender lo que est&aacute; haciendo. &Eacute;l o ella pueden hacer modificaciones. <em>Este es el camino angular.</em>

source: and there is one more thing, that's the directive. It's an attribute you can attach to any DOM element and you can go nuts with jQuery within it without worrying about your jQuery ever conflicts with AngularJs components or messes up with its architecture.
es: y hay una cosa más,esa es la directiva.Es un atributo que puedes adjuntar a cualquier elemento DOM y puedes volverte loco con jQuery dentro de él sin preocuparte de que tu jQuery entre en conflicto con los componentes de AngularJs o se confunda con su arquitectura.
