Repository: translationfeedback/feedback
Catalog: xlf/14/99/43/91/14994391.*.001.xlf
Languages: es

source: jQuery employs <a href="http://en.wikipedia.org/wiki/Unobtrusive_JavaScript">unobtrusive JavaScript</a> - behavior (JavaScript) is separated from the structure (HTML).
es: jQuery emplea <a href="http://en.wikipedia.org/wiki/Unobtrusive_JavaScript">JavaScript discreto</a> : el comportamiento (JavaScript) est&aacute; separado de la estructura (HTML).

source: jQuery gives you a toolkit for selecting arbitrary bits of the DOM and making ad-hoc changes to them. You can do pretty much anything you like piece by piece.
es: jQuery te da un juego de herramientas para seleccionar los bits arbitrarios del DOM y hacer cambios ad-hoc en ellos.Puedes hacer casi todo lo que quieras pieza por pieza.

source: jQuery is a DOM manipulation library.
es: jQuery es una biblioteca de manipulación de DOM.

source: jQuery is a way to make programming JavaScript in the browser easier. Shorter, cross-browser commands, etc.
es: jQuery es una forma de hacer más fácil la programación de JavaScript en el navegador.Comandos más cortos,cruzados en el navegador,etc.

source: jQuery is all about DOM manipulation. It solves all the cross browser pain otherwise you will have to deal with but it's not a framework that allows you to divide your app into components like AngularJS.
es: jQuery es todo sobre la manipulación de DOM.Resuelve todos los dolores del navegador,de lo contrario tendrás que lidiar con ellos,pero no es un marco de trabajo que te permita dividir tu aplicación en componentes como AngularJS.

source: jQuery is typically applied unobtrusively. Your JavaScript code is linked in the header (or the footer), and this is the only place it is mentioned. We use selectors to pick out bits of the page and write plugins to modify those parts.
es: jQuery se aplica típicamente de forma discreta.Su código JavaScript está enlazado en el encabezado (o en el pie de página),y este es el único lugar donde se menciona.Usamos selectores para escoger partes de la página y escribimos plugins para modificar esas partes.

source: jQuery makes ridiculously long JavaScript commands like <code>getElementByHerpDerp</code> shorter and cross-browser.
es: jQuery hace que los comandos de JavaScript sean rid&iacute;culamente largos, como <code>getElementByHerpDerp</code> , m&aacute;s cortos y cruzados.

source: jQuery says very little about how you should organise your code. AngularJS has opinions.
es: jQuery dice muy poco sobre cómo deberías organizar tu código.AngularJS tiene opiniones.

source: jQuery: you think a lot about 'QUERYing the <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a>' for DOM elements and doing something.
es: jQuery: piensas mucho en 'CONSULTAR el <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a> ' para elementos DOM y hacer algo.

source: will output the user name in a paragraph. It's a live binding, so if the <code>$scope.user.name</code> value is updated, the template will update too.
es: mostrar&aacute; el nombre de usuario en un p&aacute;rrafo. Es un enlace en vivo, por lo que si se actualiza el valor de <code>$scope.user.name</code> , la plantilla tambi&eacute;n se actualizar&aacute;.

source: “Thinking in AngularJS” if I have a jQuery background
es: "Pensando en AngularJS" si tengo un fondo de jQuery
