Repository: translationfeedback/feedback
Catalog: xlf/14/99/43/91/14994391.*.001.xlf
Languages: es

source: --&gt;For any developer coming from jQuery background, my first advice would be to "learn JavaScript as a first class language before jumping onto a rich framework like AngularJS!" I learned the above fact the hard way.
es: -&gt; Para cualquier desarrollador que venga de jQuery, mi primer consejo ser&iacute;a "aprender JavaScript como un lenguaje de primera clase antes de saltar a un marco rico como AngularJS". Aprend&iacute; el hecho anterior de la manera dif&iacute;cil.

source: 1. Don't design your page, and then change it with <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a> manipulations
es: 1. No dise&ntilde;e su p&aacute;gina y luego c&aacute;mbiela con manipulaciones <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a>

source: 2. Don't augment jQuery with AngularJS
es: 2.No aumentes la jQuery con AngularJS

source: 3. Always think in terms of architecture
es: 3.Piensa siempre en términos de arquitectura

source: 4. Test-driven development - <em>always</em>
es: 4. Desarrollo basado en pruebas: <em>siempre</em>

source: 5. Conceptually, directives are <em>not</em> packaged jQuery
es: 5. Conceptualmente, las directivas <em>no</em> est&aacute;n empaquetadas jQuery

source: <a href="http://en.wikipedia.org/wiki/Dependency_injection">Dependency injection</a> (DI) vs. Instatiation - aka de-spaghettification
es: <a href="http://en.wikipedia.org/wiki/Dependency_injection">Inyecci&oacute;n de dependencia</a> (DI) vs. Instatiation - tambi&eacute;n conocido como desespaguetificaci&oacute;n

source: <a href="http://en.wikipedia.org/wiki/Separation_of_concerns">Separation of concerns</a> (SOC) is a pattern that grew up over many years of web development for a variety of reasons including SEO, accessibility and browser incompatibility. It looks like this:
es: <a href="http://en.wikipedia.org/wiki/Separation_of_concerns">La separaci&oacute;n de preocupaciones</a> (SOC) es un patr&oacute;n que creci&oacute; durante muchos a&ntilde;os de desarrollo web por una variedad de razones que incluyen SEO, accesibilidad e incompatibilidad del navegador. Se parece a esto:

source: <a href="http://jquery.com">jQuery</a>/ <a href="http://underscorejs.org">Underscore</a> for the <strong>facade pattern</strong> (like WYSIWYG's for manipulating the DOM)
es: <a href="http://jquery.com">jQuery</a> / <a href="http://underscorejs.org">Underscore</a> para el <strong>patr&oacute;n de fachada</strong> (como WYSIWYG para manipular el DOM)

source: <a href="http://knockoutjs.com">KnockoutJS</a> for the <strong>observable, publish/subscribe pattern</strong>
es: <a href="http://knockoutjs.com">KnockoutJS</a> para el <strong>patr&oacute;n observable de publicaci&oacute;n / suscripci&oacute;n</strong>

source: <a href="http://prototypejs.org">Prototype.js</a> for the <strong>prototype/ constructor/ mixin pattern</strong>
es: <a href="http://prototypejs.org">Prototype.js</a> para el <strong>patr&oacute;n prototype / constructor / mixin</strong>

source: <a href="http://requirejs.org">RequireJS</a>/ <a href="https://github.com/cujojs/curl">Curl.js</a> for the <strong>module pattern/ AMD</strong>
es: <a href="http://requirejs.org">RequireJS</a> / <a href="https://github.com/cujojs/curl">Curl.js</a> para el <strong>patr&oacute;n de m&oacute;dulo / AMD</strong>

source: <a href="https://www.google.be/search?q=js+oop">JavaScript Object-oriented Programming</a> (this is a Google search link). It is not a library, but certainly a prerequisite to any application programming. It taught me the native implementations of the <strong>prototype, constructor, singleton &amp; decorator patterns</strong>
es: <a href="https://www.google.be/search?q=js+oop">Programaci&oacute;n orientada a objetos JavaScript</a> (este es un enlace de b&uacute;squeda de Google). No es una biblioteca, pero ciertamente es un requisito previo para la programaci&oacute;n de cualquier aplicaci&oacute;n. Me ense&ntilde;&oacute; las implementaciones nativas de los <strong>patrones de prototipo, constructor, singleton y decorador.</strong>

source: <em>The AngularJS way is to extend the capabilities of native looking HTML.</em> You should write HTML that looks like HTML, extended with custom attributes and elements.
es: <em>La forma AngularJS es extender las capacidades de HTML de aspecto nativo.</em> Debe escribir HTML que se parezca a HTML, extendido con atributos y elementos personalizados.

source: <strong>AngularJS and jQuery:</strong>
es: <strong>AngularJS y jQuery:</strong>

source: <strong>AngularJS</strong> is a beautiful client-side framework, highly testable, that combines tons of cool stuff such as MVC, <a href="http://en.wikipedia.org/wiki/Dependency_injection">dependency injection</a>, data binding and much more.
es: <strong>AngularJS</strong> es un hermoso marco del lado del cliente, altamente comprobable, que combina toneladas de cosas interesantes como MVC, <a href="http://en.wikipedia.org/wiki/Dependency_injection">inyecci&oacute;n de dependencia</a> , enlace de datos y mucho m&aacute;s.

source: <strong>Controllers are great:</strong> Controllers take care of their own HTML, but this separation works well for common functionality well as. If you want to call the same function on the click of a button on master HTML, just write the same function name in each controller and write individual code.
es: <strong>Los controladores son geniales: los</strong> controladores se encargan de su propio HTML, pero esta separaci&oacute;n tambi&eacute;n funciona bien para la funcionalidad com&uacute;n. Si desea llamar a la misma funci&oacute;n haciendo clic en un bot&oacute;n en HTML maestro, simplemente escriba el mismo nombre de funci&oacute;n en cada controlador y escriba un c&oacute;digo individual.

source: <strong>Extensibility</strong>: Angular has extended the HTML directives using angular directives. Write expressions inside html and evaluate them on runtime. Create your own directives and services and use them in another project without any extra effort.
es: <strong>Extensibilidad</strong> : Angular ha extendido las directivas HTML utilizando directivas angulares. Escribe expresiones dentro de html y eval&uacute;alas en tiempo de ejecuci&oacute;n. Cree sus propias directivas y servicios y &uacute;selos en otro proyecto sin ning&uacute;n esfuerzo adicional.

source: <strong>IGOR</strong>: So think of directive as the instruction to the compiler that tells it whenever you come across this certain element or this CSS in the template, and you keep this kind of code and that code is in charge of the element and everything below that element in the DOM tree.
es: <strong>IGOR</strong> : Piensa en la directiva como la instrucci&oacute;n para el compilador que le dice cada vez que te encuentras con este cierto elemento o este CSS en la plantilla, y mantienes este tipo de c&oacute;digo y ese c&oacute;digo est&aacute; a cargo del elemento y todo lo que est&aacute; debajo de ese elemento en el &aacute;rbol DOM

source: <strong>Ideal for <a href="http://en.wikipedia.org/wiki/Representational_state_transfer#RESTful_web_services">RESTful</a> architecture:</strong> Being a complete frameworks makes AngularJS great to work with a RESTful architecture. To call REST CRUD APIs is very easier and
es: <strong>Ideal para arquitectura <a href="http://en.wikipedia.org/wiki/Representational_state_transfer#RESTful_web_services">RESTful</a> :</strong> ser un marco completo hace que AngularJS sea ideal para trabajar con una arquitectura RESTful. Llamar a las API REST CRUD es muy f&aacute;cil y

source: <strong>If you have some data and are now trying to update HTML... STOP! update the model, and make sure your HTML is bound to the model.</strong>
es: <strong>Si tiene algunos datos y ahora est&aacute; tratando de actualizar HTML ... &iexcl;DET&Eacute;NGASE!</strong> <strong>actualice el modelo y aseg&uacute;rese de que su HTML est&eacute; vinculado al modelo.</strong>

source: <strong>Imperative vs Declarative</strong>
es: <strong>Imperativo vs declarativo</strong>

source: <strong>MISKO</strong>: [...] one of the things we thought about very hardly in Angular is, how do we provide lots of escape hatches so that you can get out and basically figure out a way out of this. So to us, the answer is this thing called &ldquo;Directives&rdquo;. <strong>And with directives, you essentially become a regular little jQuery JavaScript, you can do whatever you want.</strong>
es: <strong>MISKO</strong> : [...] una de las cosas en las que pensamos muy poco en Angular es c&oacute;mo proporcionamos muchas trampillas de escape para que pueda salir y, b&aacute;sicamente, encontrar una manera de salir de esto. Entonces, para nosotros, la respuesta es esta cosa llamada "Directivas". <strong>Y con las directivas, esencialmente te conviertes en un peque&ntilde;o JavaScript jQuery regular, puedes hacer lo que quieras.</strong>

source: <strong>Plugins extend jQuery. AngularJS Directives extend the capabilities of your browser.</strong>
es: <strong>Los complementos extienden jQuery.</strong> <strong>Las directivas de AngularJS ampl&iacute;an las capacidades de su navegador.</strong>

source: <strong>Plugins:</strong> There are many other similar features like showing an overlay in your app. You don't need to write code for it, just use an overlay plugin available as wc-overlay, and this will automatically take care of all <a href="http://en.wikipedia.org/wiki/XMLHttpRequest">XMLHttpRequest</a> (XHR) requests.
es: <strong>Complementos:</strong> hay muchas otras caracter&iacute;sticas similares, como mostrar una superposici&oacute;n en su aplicaci&oacute;n. No necesita escribir c&oacute;digo para ello, solo use un complemento de superposici&oacute;n disponible como wc-overlay, y esto se encargar&aacute; autom&aacute;ticamente de todas las solicitudes <a href="http://en.wikipedia.org/wiki/XMLHttpRequest">XMLHttpRequest</a> (XHR).

source: <strong>Reusable directives are super:</strong> Write directives in one place and use it throughout the application. OMG!!! I used these directive for paging, regex, validations, etc. It is really cool!
es: <strong>Las directivas reutilizables son excelentes:</strong> escriba directivas en un solo lugar y &uacute;selas en toda la aplicaci&oacute;n. &iexcl;&iexcl;&iexcl;DIOS MIO!!! Us&eacute; estas directivas para paginaci&oacute;n, expresiones regulares, validaciones, etc. &iexcl;Es realmente genial!

source: <strong>Routing is strong:</strong> It's up to your implementation how you want to use it, but it requires very few lines of code to route the request to specify HTML and controller (JavaScript)
es: <strong>El enrutamiento es s&oacute;lido:</strong> depende de su implementaci&oacute;n c&oacute;mo desea usarlo, pero requiere muy pocas l&iacute;neas de c&oacute;digo para enrutar la solicitud para especificar HTML y controlador (JavaScript)

source: <strong>Services</strong>: Write common codes using services and less code in controllers. Sevices can be used to share common functionalities among the controllers.
es: <strong>Servicios</strong> : escriba c&oacute;digos comunes utilizando servicios y menos c&oacute;digo en los controladores. Los servicios se pueden usar para compartir funcionalidades comunes entre los controladores.

source: <strong>Stop trying to drive your application from your JavaScript. Let the template drive the application, and let AngularJS take care of wiring the components together. This also is the Angular way.</strong>
es: <strong>Deja de intentar manejar tu aplicaci&oacute;n desde tu JavaScript.</strong> <strong>Deje que la plantilla controle la aplicaci&oacute;n y deje que AngularJS se encargue de conectar los componentes entre s&iacute;.</strong> <strong>Esta tambi&eacute;n es la forma angular.</strong>

source: <strong>This means that Angular is Template Driven</strong>. Your template drives the JavaScript, not the other way around. This is a radical reversal of roles, and the complete opposite of the unobtrusive JavaScript we have been writing for the last 10 years or so. This can take some getting used to.
es: <strong>Esto significa que Angular est&aacute; controlado por plantillas</strong> . Su plantilla impulsa el JavaScript, no al rev&eacute;s. Esta es una inversi&oacute;n radical de roles, y todo lo contrario del discreto JavaScript que hemos estado escribiendo durante los &uacute;ltimos 10 a&ntilde;os m&aacute;s o menos. Esto puede llevar un tiempo acostumbrarse.

source: <strong>Two-way data binding is amazing:</strong> I had a grid with all functionality UPDATE, DELTE, INSERT. I have a data object that binds the grid's model using ng-repeat. You only need to write a single line of simple JavaScript code for delete and insert and that's it. grid automatically updates as the grid model changes instantly. Update functionality is real time, no code for it. You feel amazing!!!
es: <strong>El enlace de datos bidireccional es sorprendente:</strong> ten&iacute;a una cuadr&iacute;cula con todas las funcionalidades ACTUALIZAR, ELIMINAR, INSERTAR. Tengo un objeto de datos que une el modelo de la cuadr&iacute;cula usando ng-repeat. Solo necesita escribir una sola l&iacute;nea de c&oacute;digo JavaScript simple para eliminar e insertar y eso es todo. La cuadr&iacute;cula se actualiza autom&aacute;ticamente a medida que el modelo de cuadr&iacute;cula cambia instant&aacute;neamente. La funcionalidad de actualizaci&oacute;n es en tiempo real, no hay c&oacute;digo para ello. &iexcl;&iexcl;&iexcl;Te sientes incre&iacute;ble!!!

source: <strong>Your HTML source is no longer semantic, instead, your API and compiled DOM are semantic.</strong>
es: <strong>Su fuente HTML ya no es sem&aacute;ntica, en cambio, su API y DOM compilado son sem&aacute;nticos.</strong>

source: <strong>jQuery</strong> is a library
es: <strong>jQuery</strong> es una biblioteca

source: A nice thing about AngularJs is that it allows you to separate/isolate the DOM manipulation in the directives. There are built-in directives ready for you to use such as ng-click. You can create your own custom directives that will contain all your view logic or DOM manipulation so you don't end up mingle DOM manipulation code in the controllers or services that should take care of the business logic.
es: Lo bueno de AngularJs es que te permite separar la manipulación de DOM en las directivas.Hay directivas incorporadas listas para que las uses,como ng-click.Puedes crear tus propias directivas personalizadas que contendrán toda tu lógica de vista o manipulación DOM para que no termines mezclando el código de manipulación DOM en los controladores o servicios que deben cuidar la lógica del negocio.

source: A transcript of the entire episode is available at the link provided above.
es: La transcripción de todo el episodio puede consultarse en el enlace que figura más arriba.

source: Actually, if you're using AngularJS, you don't need jQuery anymore. AngularJS itself has the binding and directive, which is a very good "replacement" for most things you can do with jQuery.
es: En realidad,si estás usando AngularJS,no necesitas más jQuery.AngularJS en sí mismo tiene la vinculación y la directiva,que es un muy buen "reemplazo" para la mayoría de las cosas que puedes hacer con jQuery.

source: Again, AngularJS does not play by their rules. In a stroke, <strong>AngularJS does away with a decade of received wisdom</strong> and instead implements an MVC pattern in which the template is no longer semantic, not even a little bit.
es: Nuevamente, AngularJS no juega con sus reglas. En un momento, <strong>AngularJS elimina una d&eacute;cada de sabidur&iacute;a recibida</strong> y en su lugar implementa un patr&oacute;n MVC en el que la plantilla ya no es sem&aacute;ntica, ni siquiera un poco.

source: Again, the template stuff is in the template, so you (or your users) can easily swap it out for one that meets any style necessary, and the <strong>logic</strong> never had to be touched. Reusability - boom!
es: Una vez m&aacute;s, el contenido de la plantilla est&aacute; en la plantilla, por lo que usted (o sus usuarios) pueden cambiarlo f&aacute;cilmente por uno que cumpla con cualquier estilo necesario, y la <strong>l&oacute;gica</strong> nunca tuvo que ser tocada. Reutilizaci&oacute;n - &iexcl;boom!

source: Ajax all of the time
es: Ajax todo el tiempo

source: And I decided to make a tiny code snippet that help me quickly start a website using AngularJS with the power of jQuery Selector (using Sizzle).
es: Y decidí hacer un pequeño fragmento de código que me ayudara a iniciar rápidamente un sitio web usando AngularJS con el poder de jQuery Selector (usando Sizzle).

source: And all of the above tie into this over-arching theme: keep your concerns separate. Your view acts as the official record of what is supposed to happen (for the most part); your model represents your data; you have a service layer to perform reusable tasks; you do DOM manipulation and augment your view with directives; and you glue it all together with controllers. This was also mentioned in other answers, and the only thing I would add pertains to testability, which I discuss in another section below.
es: Y todo lo anterior se relaciona con este tema general:mantener sus preocupaciones separadas.Tu vista actúa como el registro oficial de lo que se supone que debe ocurrir (en su mayor parte);tu modelo representa tus datos;tienes una capa de servicio para realizar tareas reutilizables;haces manipulación DOM y aumentas tu vista con directivas;y lo pegas todo junto con los controladores.Esto también se mencionó en otras respuestas,y lo único que yo añadiría se refiere a la comprobabilidad,que discutiré en otra sección más adelante.

source: And fifth, which we've mentioned in previous sections, why are we mixing template stuff into our logic?
es: Y quinto,que hemos mencionado en secciones anteriores,¿por qué estamos mezclando cosas de plantilla en nuestra lógica?

source: And now instead of using an unordered list, we're using Bootstrap alert boxes. And we never had to change the controller code! But more importantly, no matter <em>where</em> or <em>how</em> the log gets updated, the view will change too. Automatically. Neat!
es: Y ahora, en lugar de usar una lista desordenada, estamos usando cuadros de alerta de Bootstrap. &iexcl;Y nunca tuvimos que cambiar el c&oacute;digo del controlador! Pero lo m&aacute;s importante, no importa <em>d&oacute;nde</em> o <em>c&oacute;mo</em> se actualice el registro, la vista tambi&eacute;n cambiar&aacute;. Autom&aacute;ticamente. &iexcl;Ordenado!

source: And our view can look like this:
es: Y nuestra vista puede verse así:

source: And there are still all those other benefits, like testing - it's easy! No matter what's in the template, the directive's internal API is never touched, so refactoring is easy. You can change the template as much as you want without touching the directive. And no matter what you change, your tests still pass.
es: Y todavía hay todos esos otros beneficios,como las pruebas...¡es fácil! No importa lo que haya en la plantilla,la API interna de la directiva nunca se toca,así que la refactorización es fácil.Puede cambiar la plantilla tanto como quiera sin tocar la directiva.Y no importa lo que cambie,sus pruebas siguen pasando.

source: And when we run our test, we can confirm that it fails. Only now should we create our directive:
es: Y cuando hagamos la prueba,podremos confirmar que falla.Sólo ahora debemos crear nuestra directiva:

source: And with DOM manipulation in AngularJS, you find yourself adding directives and filters, which you can think of as valid HTML extensions.
es: Y con la manipulación DOM en AngularJS,te encuentras añadiendo directivas y filtros,que puedes considerar como extensiones HTML válidas.

source: Angular and jQuery do different things. AngularJS gives you a set of tools to produce web applications. jQuery mainly gives you tools for modifying the DOM. If jQuery is present on your page, AngularJS will use it automatically. If it isn't, AngularJS ships with jQuery Lite, which is a cut down, but still perfectly usable version of jQuery.
es: Angular y jQuery hacen cosas diferentes.AngularJS te da un conjunto de herramientas para producir aplicaciones web.jQuery principalmente te da herramientas para modificar el DOM.Si jQuery está presente en tu página,AngularJS lo usará automáticamente.Si no lo está,AngularJS se envía con jQuery Lite,que es una versión reducida pero perfectamente utilizable de jQuery.

source: Angular breaks down your app into - Controllers - Services - Views - etc.
es: Angular desglosa tu aplicación en-Controladores-Servicios-Vistas-etc.

source: AngularJS allows you to make your own HTML tags/attributes that do things which work well with dynamic web applications (since HTML was designed for static pages).
es: AngularJS le permite hacer sus propios tagsattributes HTML que hacen cosas que funcionan bien con aplicaciones web dinámicas (ya que el HTML fue diseñado para páginas estáticas).

source: AngularJS and jQuery adopt very different ideologies. If you're coming from jQuery you may find some of the differences surprising. Angular may make you angry.
es: AngularJS y jQuery adoptan ideologías muy diferentes.Si vienes de jQuery puedes encontrar algunas de las diferencias sorprendentes.La angular puede hacerte enojar.

source: AngularJS and jQuery are not enemies. It's possible to use jQuery within AngularJS very nicely. If you're using AngularJS well (templates, data-binding, $scope, directives, etc.) you will find you need a <strong>lot</strong> less jQuery than you might otherwise require.
es: AngularJS y jQuery no son enemigos. Es posible usar jQuery dentro de AngularJS muy bien. Si est&aacute; utilizando bien AngularJS (plantillas, enlace de datos, $ scope, directivas, etc.), encontrar&aacute; que necesita <strong>mucho</strong> menos jQuery de lo que podr&iacute;a necesitar.

source: AngularJS changes the way you <em>find</em> elements
es: AngularJS cambia la forma de <em>encontrar</em> elementos

source: AngularJS comes with an entire set of tools to make this very easy; with <code>ngClass</code> we can dynamically update the class; <code>ngModel</code> allows two-way data binding; <code>ngShow</code> and <code>ngHide</code> programmatically show or hide an element; and many more - including the ones we write ourselves. In other words, we can do all kinds of awesomeness <em>without</em> DOM manipulation. The less DOM manipulation, the easier directives are to test, the easier they are to style, the easier they are to change in the future, and the more re-usable and distributable they are.
es: AngularJS viene con un conjunto completo de herramientas para hacer esto muy f&aacute;cil; Con <code>ngClass</code> podemos actualizar din&aacute;micamente la clase; <code>ngModel</code> permite el enlace de datos bidireccional; <code>ngShow</code> y <code>ngHide</code> muestran u ocultan mediante programaci&oacute;n un elemento; y muchos m&aacute;s, incluidos los que escribimos nosotros mismos. En otras palabras, podemos hacer todo tipo de genialidad <em>sin la</em> manipulaci&oacute;n DOM. Cuanta menos manipulaci&oacute;n DOM, m&aacute;s f&aacute;ciles de probar las directivas, m&aacute;s f&aacute;ciles de dise&ntilde;ar, m&aacute;s f&aacute;ciles de cambiar en el futuro y m&aacute;s reutilizables y distribuibles.
