Repository: translationfeedback/feedback
Catalog: xlf/14/99/43/91/14994391.*.001.xlf
Languages: es

source: Let's say in our application, we require a service that implements server-side storage through a <a href="http://en.wikipedia.org/wiki/Representational_State_Transfer">REST</a> API and, depending on application state, local storage as well. When running tests on our controllers, we don't want to have to communicate with the server - we're testing the <em>controller</em>, after all. We can just add a mock service of the same name as our original component, and the injector will ensure that our controller gets the fake one automatically - our controller doesn't and needn't know the difference.
es: Digamos que en nuestra aplicaci&oacute;n, requerimos un servicio que implemente el almacenamiento del lado del servidor a trav&eacute;s de una API <a href="http://en.wikipedia.org/wiki/Representational_State_Transfer">REST</a> y, dependiendo del estado de la aplicaci&oacute;n, tambi&eacute;n el almacenamiento local. Cuando ejecutamos pruebas en nuestros controladores, no queremos tener que comunicarnos con el servidor; despu&eacute;s de todo, estamos probando el <em>controlador</em> . Simplemente podemos agregar un servicio simulado con el mismo nombre que nuestro componente original, y el inyector se asegurar&aacute; de que nuestro controlador obtenga el falso autom&aacute;ticamente; nuestro controlador no sabe y no necesita saber la diferencia.

source: Let's say we have a shopping cart. We might define a ShoppingCartService which maintains our cart and contains methods for adding and removing items. Because the service is a singleton, and is shared by all other components, any object that needs to can write to the shopping cart and pull data from it. It's always the same cart.
es: Digamos que tenemos un carrito de compras.Podríamos definir un servicio de carrito de compras que mantenga nuestro carrito y contenga métodos para agregar y quitar artículos.Debido a que el servicio es un solo botón,y es compartido por todos los demás componentes,cualquier objeto que lo necesite puede escribir en el carrito de compras y sacar datos de él.Siempre es el mismo carro.

source: Like me, you will quickly realize that AngularJS (or <a href="http://en.wikipedia.org/wiki/Ember.js">Ember.js</a>, Durandal, &amp; other MV* frameworks for that matter) is one complex framework assembling many of the different JavaScript design patterns.
es: Al igual que yo, se dar&aacute; cuenta r&aacute;pidamente de que AngularJS (o <a href="http://en.wikipedia.org/wiki/Ember.js">Ember.js</a> , Durandal y otros marcos MV * para el caso) es un marco complejo que ensambla muchos de los diferentes patrones de dise&ntilde;o de JavaScript.

source: Listen to the podcast <em><a href="http://javascriptjabber.com/032-jsj-angular-js/">JavaScript Jabber: Episode #32</a></em> that features the original creators of AngularJS: Misko Hevery &amp; Igor Minar. They talk a lot about what it's like to come to AngularJS from other JavaScript backgrounds, especially jQuery.
es: Escuche el podcast <em><a href="http://javascriptjabber.com/032-jsj-angular-js/">JavaScript Jabber: Episodio # 32</a></em> que presenta a los creadores originales de AngularJS: Misko Hevery e Igor Minar. Hablan mucho sobre c&oacute;mo es llegar a AngularJS desde otros fondos de JavaScript, especialmente jQuery.

source: Lots of small directives vs. big plugins with configuration switches
es: Muchas pequeñas directivas frente a grandes plugins con interruptores de configuración

source: MVC and SOC are not on opposite ends of the same scale, they are on completely different axes. SOC makes no sense in an AngularJS context. You have to forget it and move on.
es: MVC y SOC no están en extremos opuestos de la misma escala,están en ejes completamente diferentes.El SOC no tiene sentido en un contexto de AngularJS.Tienes que olvidarlo y seguir adelante.

source: Manual DOM changes vs. Data Binding
es: Cambios manuales de DOM frente a la vinculación de datos

source: Misko likes jQuery and doesn't object to you using it. However you will find as you advance that you can get a pretty much all of your work done using a combination of scope, templates and directives, and you should prefer this workflow where possible because your code will be more discrete, more configurable, and more Angular.
es: A Misko le gusta el jQuery y no se opone a que lo uses.Sin embargo,a medida que avance descubrirá que puede hacer casi todo su trabajo usando una combinación de alcance,plantillas y directivas,y debería preferir este flujo de trabajo siempre que sea posible porque su código será más discreto,más configurable y más angular.

source: Model - your models contains your semantic data. Models are usually <a href="http://en.wikipedia.org/wiki/JSON">JSON</a> objects. Models exist as attributes of an object called $scope. You can also store handy utility functions on $scope which your templates can then access.
es: Modelo: sus modelos contienen sus datos sem&aacute;nticos. Los modelos suelen ser objetos <a href="http://en.wikipedia.org/wiki/JSON">JSON</a> . Los modelos existen como atributos de un objeto llamado $ scope. Tambi&eacute;n puede almacenar pr&aacute;cticas funciones de utilidad en $ scope a las que pueden acceder sus plantillas.

source: Modular service architecture
es: Arquitectura de servicio modular

source: Modules contain AngularJS components. <strong>When we include a module, all the components in that module become available to us as a simple list identified by their unique strings</strong>. We can then inject those components into each other using AngularJS's dependency injection mechanism.
es: Los m&oacute;dulos contienen componentes AngularJS. <strong>Cuando incluimos un m&oacute;dulo, todos los componentes de ese m&oacute;dulo est&aacute;n disponibles para nosotros como una lista simple identificada por sus cadenas &uacute;nicas</strong> . Luego podemos inyectar esos componentes entre s&iacute; utilizando el mecanismo de inyecci&oacute;n de dependencia de AngularJS.

source: My little book
es: Mi pequeño libro

source: NB: This list is not complete, nor 'the best libraries'; they just happen to be the libraries I used. These libraries also include more patterns, the ones mentioned are just their main focuses or original intents. If you feel something is missing from this list, please do mention it in the comments, and I will be glad to add it.
es: NB:Esta lista no está completa,ni "las mejores bibliotecas";sólo son las bibliotecas que yo usé.Estas bibliotecas también incluyen más patrones,los mencionados son sólo sus principales enfoques o intenciones originales.Si sientes que falta algo en esta lista,por favor,menciónalo en los comentarios,y estaré encantado de añadirlo.

source: Need to update on mouseover?
es: ¿Necesitas actualizar el mouseover?

source: Now <strong>in our template</strong> we can wire this up:
es: Ahora <strong>en nuestra plantilla</strong> podemos conectar esto:

source: Now when I want to use that service I just refer to it by name like this:
es: Ahora,cuando quiero usar ese servicio,me refiero a él por su nombre,así:

source: Okay, now we can write a test for the non-existent <code>when-active</code> directive:
es: Bien, ahora podemos escribir una prueba para la directiva inexistente <code>when-active</code> :

source: One approach to designing an AngularJS application:
es: Un enfoque para diseñar una aplicación de AngularJS:

source: One more thing you will experience in AngularJS: in jQuery you call the jQuery functions a lot, in AngularJS, AngularJS will call your functions, so AngularJS will 'tell you how to do things', but the benefits are worth it, so learning AngularJS usually means learning what AngularJS wants or the way AngularJS requires that you present your functions and it will call it accordingly. This is one of the things that makes AngularJS a framework rather than a library.
es: Una cosa más que experimentará en AngularJS:en jQuery usted llama mucho a las funciones de jQuery,en AngularJS,AngularJS llamará a sus funciones,por lo que AngularJS le 'dirá cómo hacer las cosas',pero los beneficios valen la pena,por lo que aprender AngularJS normalmente significa aprender lo que AngularJS quiere o la forma en que AngularJS requiere que usted presente sus funciones y lo llamará en consecuencia.Esta es una de las cosas que hace que AngularJS sea un marco más que una biblioteca.

source: One of the first questions I asked myself when starting AngularJS and running through the tutorials is <strong>"Where is my code?"</strong>. I've written no JavaScript, and yet I have all this behaviour. The answer is obvious. Because AngularJS compiles the DOM, AngularJS is treating your HTML as code. For many simple cases it's often sufficient to just write a template and let AngularJS compile it into an application for you.
es: Una de las primeras preguntas que me hice al iniciar AngularJS y ejecutar los tutoriales es <strong>"&iquest;D&oacute;nde est&aacute; mi c&oacute;digo?"</strong> . No he escrito JavaScript y, sin embargo, tengo todo este comportamiento. La respuesta es obvia. Como AngularJS compila el DOM, AngularJS est&aacute; tratando su HTML como c&oacute;digo. Para muchos casos simples, a menudo es suficiente escribir una plantilla y dejar que AngularJS la compile en una aplicaci&oacute;n para usted.

source: One of the first things your will notice about AngularJS is that <strong>custom attributes are everywhere</strong>. Your HTML will be littered with ng attributes, which are essentially onClick attributes on steroids. These are directives (compiler directives), and are one of the main ways in which the template is hooked to the model.
es: Una de las primeras cosas que notar&aacute; sobre AngularJS es que <strong>los atributos personalizados est&aacute;n en todas partes</strong> . Su HTML estar&aacute; lleno de atributos ng, que son esencialmente atributos onClick en esteroides. Estas son directivas (directivas del compilador) y son una de las principales formas en que la plantilla se engancha al modelo.

source: One of the points made in the podcast made a lot of things click for me with respects to your question:
es: Uno de los puntos del podcast hizo que muchas cosas encajaran para mí con respecto a tu pregunta:

source: Our test now passes <em>and</em> our menu performs as requested. Our development is <em>both</em> iterative <em>and</em> test-driven. Wicked-cool.
es: Nuestra prueba ahora pasa <em>y</em> nuestro men&uacute; funciona seg&uacute;n lo solicitado. Nuestro desarrollo es <em>tanto</em> iterativo <em>como</em> probado. Genial.

source: Out of all of the many jQuery plugins you've seen, used, or written, how many of them had an accompanying test suite? Not very many because jQuery isn't very amenable to that. But AngularJS is.
es: De todos los muchos plugins de jQuery que has visto,usado o escrito,¿cuántos de ellos tenían un paquete de pruebas adjunto? No muchos,porque jQuery no es muy susceptible a eso.Pero AngularJS sí lo es.

source: Plugins vs. Directives
es: Plugins vs.Guías

source: Prototypal inheritance
es: Herencia prototípica

source: Put another way, if AngularJS doesn't do something out of the box, think how the team would accomplish it to fit right in with <code>ngClick</code>, <code>ngClass</code>, et al.
es: Dicho de otra manera, si AngularJS no hace algo fuera de la caja, piense c&oacute;mo lo lograr&iacute;a el equipo para encajar perfectamente con <code>ngClick</code> , <code>ngClass</code> , et al.

source: Remember: don't design, and then mark up. You must architect, and then design.
es: Recuerda:no diseñes,y luego marca.Debes ser arquitecto,y luego diseñar.

source: Say I have a component called 'FlickrService' which defines methods for pulling JSON feeds from Flickr. Now, if I want to write a controller that can access Flickr, I just need to refer to the 'FlickrService' by name when I declare the controller. AngularJS will take care of instantiating the component and making it available to my controller.
es: Digamos que tengo un componente llamado 'FlickrService' que define los métodos para sacar las fuentes de JSON de Flickr.Ahora,si quiero escribir un controlador que pueda acceder a Flickr,sólo necesito referirme al 'FlickrService' por su nombre cuando declare el controlador.AngularJS se encargará de instanciar el componente y ponerlo a disposición de mi controlador.

source: Say you have a menu that you want to unfold on hover. Well now we have a problem. Our plugin has wired in our click handler for us, we're going to need to add a configuration option to make it behave differently in this specific case.
es: Digamos que tienes un menú que quieres desplegar en el aire.Bueno,ahora tenemos un problema.Nuestro plugin se ha cableado en nuestro manejador de clicks para nosotros,vamos a necesitar añadir una opción de configuración para que se comporte de manera diferente en este caso específico.

source: Saying "I have a jQuery background how do I think in AngularJS?" is like saying "I have an HTML background how do I think in JavaScript?" The fact that you're asking the question shows you most likely don't understand the fundamental purposes of these two resources. This is why I chose to answer the question by simply pointing out the fundamental difference rather than going through the list saying "AngularJS makes use of directives whereas jQuery uses CSS selectors to make a jQuery object which does this and that etc....". This question does not require a lengthy answer.
es: Decir "Tengo un fondo de jQuery ¿cómo pienso en AngularJS?" es como decir "Tengo un fondo de HTML ¿cómo pienso en JavaScript?" El hecho de que estés haciendo la pregunta muestra que probablemente no entiendas los propósitos fundamentales de estos dos recursos.Por eso elegí responder a la pregunta señalando simplemente la diferencia fundamental en lugar de ir a través de la lista diciendo "AngularJS hace uso de directivas mientras que jQuery usa selectores CSS para hacer un objeto jQuery que hace esto y aquello etc....".Esta pregunta no requiere una respuesta larga.

source: Second, even if we already have jQuery on our page, there's no reason to use it here; we can simply use <code>angular.element</code> and our component will still work when dropped into a project that doesn't have jQuery.
es: Segundo, incluso si ya tenemos jQuery en nuestra p&aacute;gina, no hay raz&oacute;n para usarlo aqu&iacute;; simplemente podemos usar <code>angular.element</code> y nuestro componente seguir&aacute; funcionando cuando se deje caer en un proyecto que no tenga jQuery.

source: See also <a href="https://stackoverflow.com/a/14346528/215945">https://stackoverflow.com/a/14346528/215945</a>
es: Ver tambi&eacute;n <a href="https://stackoverflow.com/a/14346528/215945">https://stackoverflow.com/a/14346528/215945</a>

source: Semantic HTML vs. Semantic Models
es: HTML semántico vs.modelos semánticos

source: Separation of concerns
es: Separación de las preocupaciones

source: Separation of concerns (SOC) vs. MVC
es: Separación de preocupaciones (SOC)vs.MVC

source: Service Objects vs Helper Functions
es: Objetos de servicio vs.funciones de ayuda

source: Service objects are self-contained AngularJS components which we can use and reuse as we see fit. They are simple JSON objects containing functions and Data. They are always singletons, so if you store data on a service in one place, you can get that data out somewhere else just by requesting the same service.
es: Los objetos de servicio son componentes autónomos de AngularJS que podemos usar y reutilizar como nos parezca.Son simples objetos JSON que contienen funciones y datos.Siempre son singleletons,así que si almacenas datos sobre un servicio en un lugar,puedes obtener esos datos en otro lugar con sólo solicitar el mismo servicio.

source: Services are simple objects that contain functions and data. They are always singletons, meaning there can never be more than one of them. Say we want to access the Stack Overflow API, we might write a <code>StackOverflowService</code> which defines methods for doing so.
es: Los servicios son objetos simples que contienen funciones y datos. Siempre son singletons, lo que significa que nunca puede haber m&aacute;s de uno. Supongamos que queremos acceder a la API de desbordamiento de pila, podr&iacute;amos escribir un <code>StackOverflowService</code> que defina los m&eacute;todos para hacerlo.

source: Similarly, don't start with the idea that jQuery does X, Y, and Z, so I'll just add AngularJS on top of that for models and controllers. This is <em>really</em> tempting when you're just starting out, which is why I always recommend that new AngularJS developers don't use jQuery at all, at least until they get used to doing things the "Angular Way".
es: Del mismo modo, no comience con la idea de que jQuery hace X, Y y Z, por lo que solo agregar&eacute; AngularJS adem&aacute;s de eso para modelos y controladores. Esto es <em>realmente</em> tentador cuando reci&eacute;n est&aacute;s comenzando, por eso siempre recomiendo que los nuevos desarrolladores de AngularJS no usen jQuery en absoluto, al menos hasta que se acostumbren a hacer las cosas de la "manera angular".

source: So if directives aren't just collections of jQuery-like functions, what are they? Directives are actually <strong>extensions of HTML</strong>. If HTML doesn't do something you need it to do, you write a directive to do it for you, and then use it just as if it was part of HTML.
es: Entonces, si las directivas no son solo colecciones de funciones similares a jQuery, &iquest;qu&eacute; son? Las directivas son en realidad <strong>extensiones de HTML</strong> . Si HTML no hace algo que necesita que haga, escriba una directiva para que lo haga por usted y luego lo use como si fuera parte de HTML.

source: So then <em>how</em> do you do that? How do you "think in AngularJS"? Here are some general principles, contrasted with jQuery.
es: Entonces, <em>&iquest;c&oacute;mo</em> haces eso? &iquest;C&oacute;mo "piensas en AngularJS"? Aqu&iacute; hay algunos principios generales, en contraste con jQuery.

source: So when people say "don't include jQuery at all", it's mainly because they don't want you to use selectors; they want you to learn to use directives instead. Direct, not select!
es: Así que cuando la gente dice "no incluyas jQuery en absoluto",es principalmente porque no quieren que uses selectores;quieren que aprendas a usar directivas en su lugar.¡Dirigir,no seleccionar!

source: So, to directly answer your question: AngularJS is -very- opinionated and is a true MV* framework. However, you can still do all of the really cool stuff you know and love with jQuery inside of directives. It's not a matter of "How do I do what I used to in jQuery?" as much as it's a matter of "How do I supplement AngularJS with all of the stuff I used to do in jQuery?"
es: Así que,para responder directamente a su pregunta:AngularJS es -muy opinado y es un verdadero marco de MV*.Sin embargo,todavía puedes hacer todas las cosas realmente geniales que conoces y amas con jQuery dentro de las directivas.No se trata de "¿Cómo hago lo que solía hacer en jQuery?" sino de "¿Cómo complementaba AngularJS con todas las cosas que solía hacer en jQuery?"

source: Some directives just decorate what's already in the view (think <code>ngClass</code>) and therefore sometimes do DOM manipulation straight away and then are basically done. But if a directive is like a "widget" and has a template, it should <em>also</em> respect separation of concerns. That is, the template <em>too</em> should remain largely independent from its implementation in the link and controller functions.
es: Algunas directivas simplemente decoran lo que ya est&aacute; en la vista (piense en <code>ngClass</code> ) y, por lo tanto, a veces realizan la manipulaci&oacute;n DOM de inmediato y luego b&aacute;sicamente se hacen. Pero si una directiva es como un "widget" y tiene una plantilla, tambi&eacute;n debe respetar la separaci&oacute;n de preocupaciones. Es decir, la plantilla <em>tambi&eacute;n</em> debe permanecer en gran medida independiente de su implementaci&oacute;n en las funciones de enlace y controlador.

source: Speaking of testing...
es: Hablando de pruebas...

source: Suppose I'm familiar with developing client-side applications in <a href="http://jquery.com/">jQuery</a>, but now I'd like to start using <a href="http://angularjs.org/">AngularJS</a>. Can you describe the paradigm shift that is necessary? Here are a few questions that might help you frame an answer:
es: Supongamos que estoy familiarizado con el desarrollo de aplicaciones del lado del cliente en <a href="http://jquery.com/">jQuery</a> , pero ahora me gustar&iacute;a comenzar a usar <a href="http://angularjs.org/">AngularJS</a> . &iquest;Puedes describir el cambio de paradigma que es necesario? Aqu&iacute; hay algunas preguntas que pueden ayudarlo a formular una respuesta:

source: Take the example of a dropdown. When writing a dropdown plugin you might be tempted to code in click handlers, perhaps a function to add in a chevron which is either up or down, perhaps change the class of the unfolded element, show hide the menu, all helpful stuff.
es: Tomemos el ejemplo de un desplegable.Cuando escribes un plugin desplegable puedes estar tentado de codificar en manejadores de clic,tal vez una función para añadir un chevron que esté arriba o abajo,tal vez cambiar la clase del elemento desplegado,mostrar ocultar el menú,todas cosas útiles.

source: The JavaScript is in control. The HTML has a completely independent existence. Your HTML remains semantic even without JavaScript. Onclick attributes are very bad practice.
es: El JavaScript está en control.El HTML tiene una existencia completamente independiente.Su HTML permanece semántico incluso sin el JavaScript.Los atributos de Onclick son una muy mala práctica.

source: The best way to start is going through <a href="http://docs.angularjs.org/tutorial/">their awesome tutorial</a>. You can go through the steps in a couple of hours; however, in case you want to master the concepts behind the scenes, they include a myriad of reference for further reading.
es: La mejor manera de comenzar es a trav&eacute;s de <a href="http://docs.angularjs.org/tutorial/">su incre&iacute;ble tutorial</a> . Puedes seguir los pasos en un par de horas; sin embargo, en caso de que desee dominar los conceptos detr&aacute;s de escena, incluyen una mir&iacute;ada de referencias para lecturas adicionales.

source: The big difference (TLDR)
es: La gran diferencia (TLDR)

source: The bottom line is this: when solutioning, first "think in AngularJS"; if you can't think of a solution, ask the community; if after all of that there is no easy solution, <em>then</em> feel free to reach for the jQuery. But don't let jQuery become a crutch or you'll never master AngularJS.
es: La conclusi&oacute;n es esta: al resolver, primero "piense en AngularJS"; si no puede pensar en una soluci&oacute;n, preg&uacute;ntele a la comunidad; si despu&eacute;s de todo eso no hay una soluci&oacute;n f&aacute;cil, no dude en alcanzar jQuery. Pero no dejes que jQuery se convierta en una muleta o nunca dominar&aacute;s AngularJS.

source: The main thing to realise is that your template drives your application. Stop trying to write big plugins that do everything. Instead write little directives that do one thing, then write a simple template to wire them together.
es: Lo más importante es que la plantilla impulse la aplicación.Deja de intentar escribir grandes plugins que lo hacen todo.En lugar de eso,escriba pequeñas directivas que hagan una cosa,y luego escriba una simple plantilla para unirlas.
