Repository: translationfeedback/feedback
Catalog: xlf/14/99/43/91/14994391.*.001.xlf
Languages: es

source: From a broad perspective, DI means that you can declare components very freely and then from any other component, just ask for an instance of it and it will be granted. You don't have to know about loading order, or file locations, or anything like that. The power may not immediately be visible, but I'll provide just one (common) example: testing.
es: Desde una perspectiva amplia,DI significa que puedes declarar los componentes muy libremente y luego de cualquier otro componente,sólo pide una instancia de ello y se te concederá.No tienes que saber sobre el orden de carga,o las ubicaciones de los archivos,o algo así.Puede que la potencia no sea visible inmediatamente,pero te daré sólo un ejemplo (común):las pruebas.

source: Good luck.
es: Buena suerte.

source: HTML - Semantic meaning. The HTML should stand alone.
es: HTML-Significado semántico.El HTML debería ser independiente.

source: HTML and directives define the layout and binding to the model.
es: El HTML y las directivas definen el diseño y la vinculación al modelo.

source: Here's a quick example that shows the pattern I see most frequently. We want a toggleable button. (Note: this example is a little contrived and a skosh verbose to represent more complicated cases that are solved in exactly the same way.)
es: Aquí hay un rápido ejemplo que muestra el patrón que veo con más frecuencia.Queremos un botón que se pueda cambiar.(Nota:este ejemplo es un poco artificioso y un skosh verboso para representar casos más complicados que se resuelven exactamente de la misma manera).

source: How do I architect and design client-side web applications differently? What is the biggest difference?
es: ¿Cómo puedo diseñar aplicaciones web del lado del cliente de forma diferente? ¿Cuál es la mayor diferencia?

source: How do I architect and design client-side web apps differently?
es: ¿Cómo puedo diseñar aplicaciones web del lado del cliente de forma diferente?

source: I find this question interesting, because my first serious exposure to JavaScript programming was <a href="http://en.wikipedia.org/wiki/Node.js">Node.js</a> and AngularJS. I never learned jQuery, and I guess that's a good thing, because I don't have to unlearn anything. In fact, I actively avoid jQuery solutions to my problems, and instead, solely look for an "AngularJS way" to solve them. So, I guess my answer to this question would essentially boil down to, "think like someone who never learned jQuery" and avoid any temptation to incorporate jQuery directly (obviously AngularJS uses it to some extent behind the scenes).
es: Encuentro esta pregunta interesante, porque mi primera exposici&oacute;n seria a la programaci&oacute;n de JavaScript fue <a href="http://en.wikipedia.org/wiki/Node.js">Node.js</a> y AngularJS. Nunca aprend&iacute; jQuery, y supongo que es algo bueno, porque no tengo que desaprender nada. De hecho, evito activamente las soluciones de jQuery a mis problemas y, en cambio, busco &uacute;nicamente una "forma AngularJS" para resolverlos. Entonces, supongo que mi respuesta a esta pregunta se reducir&iacute;a esencialmente a "pensar como alguien que nunca aprendi&oacute; jQuery" y evitar cualquier tentaci&oacute;n de incorporar jQuery directamente (obviamente, AngularJS lo usa en cierta medida detr&aacute;s de escena).

source: I found it easier also, to test <strong>(1)</strong> native JavaScript code and <strong>(2)</strong> smaller libraries for each one of these patterns <strong>separately</strong> before diving into one global framework. This allowed me to better understand which crucial issues a framework adresses (because you are personally faced with the problem).
es: Tambi&eacute;n me result&oacute; m&aacute;s f&aacute;cil probar <strong>(1)</strong> c&oacute;digo JavaScript nativo y <strong>(2)</strong> bibliotecas m&aacute;s peque&ntilde;as para cada uno de estos patrones por <strong>separado</strong> antes de sumergirme en un marco global. Esto me permiti&oacute; comprender mejor qu&eacute; cuestiones cruciales aborda un marco (porque usted se enfrenta personalmente al problema).

source: I got so excited about AngularJS, I wrote a short book on it which you're very welcome to read online <a href="http://nicholasjohnson.com/angular-book/">http://nicholasjohnson.com/angular-book/</a>. I hope it's helpful.
es: Me emocion&eacute; tanto con AngularJS que escrib&iacute; un breve libro sobre &eacute;l que pueden leer en l&iacute;nea en <a href="http://nicholasjohnson.com/angular-book/">http://nicholasjohnson.com/angular-book/</a> . Espero que sea &uacute;til.

source: I heard from a meetup I attended, one of the founders of Angular said they worked really hard to separate out the DOM manipulation so do not try to include them back in.
es: Escuché en una reunión a la que asistí,que uno de los fundadores de Angular dijo que trabajaron muy duro para separar la manipulación de DOM,así que no intenten incluirlos de nuevo.

source: I see lots of developers new to AngularJS using directives as the place to throw a bunch of jQuery. In other words, they think "since I can't do DOM manipulation in the controller, I'll take that code put it in a directive". While that certainly is much better, it's often <em>still wrong</em>.
es: Veo muchos desarrolladores nuevos en AngularJS que usan directivas como el lugar para lanzar un mont&oacute;n de jQuery. En otras palabras, piensan "como no puedo hacer la manipulaci&oacute;n DOM en el controlador, tomar&eacute; ese c&oacute;digo y lo pondr&eacute; en una directiva". Si bien eso ciertamente es mucho mejor, a menudo <em>todav&iacute;a est&aacute; mal</em> .

source: I shared my code here: <a href="https://github.com/huytd/Sizzular">https://github.com/huytd/Sizzular</a>
es: Compart&iacute; mi c&oacute;digo aqu&iacute;: <a href="https://github.com/huytd/Sizzular">https://github.com/huytd/Sizzular</a>

source: I usually develop mobile applications using AngularJS and <a href="http://en.wikipedia.org/wiki/PhoneGap">Cordova</a>. The ONLY thing from jQuery I needed is the Selector.
es: Normalmente desarrollo aplicaciones m&oacute;viles con AngularJS y <a href="http://en.wikipedia.org/wiki/PhoneGap">Cordova</a> . Lo &Uacute;NICO de jQuery que necesitaba es el Selector.

source: I'm not looking for a detailed comparison between <code>jQuery</code> and <code>AngularJS</code>.
es: No estoy buscando una comparaci&oacute;n detallada entre <code>jQuery</code> y <code>AngularJS</code> .

source: I've seen many developers here and on the mailing list create these elaborate solutions with jQuery plugins of 150 or 200 lines of code that they then glue into AngularJS with a collection of callbacks and <code>$apply</code>s that are confusing and convoluted; but they eventually get it working! The problem is that in <strong>most</strong> cases that jQuery plugin could be rewritten in AngularJS in a fraction of the code, where suddenly everything becomes comprehensible and straightforward.
es: He visto a muchos desarrolladores aqu&iacute; y en la lista de correo crear estas elaboradas soluciones con complementos jQuery de 150 o 200 l&iacute;neas de c&oacute;digo que luego pegan en AngularJS con una colecci&oacute;n de devoluciones de llamada y <code>$apply</code> que son confusas y complicadas; &iexcl;pero finalmente lo hacen funcionar! El problema es que, en la <strong>mayor&iacute;a de los</strong> casos, el complemento jQuery podr&iacute;a reescribirse en AngularJS en una fracci&oacute;n del c&oacute;digo, donde de repente todo se vuelve comprensible y directo.

source: If this sounds like it might be over-prescriptive and limiting, nothing could be farther from the truth. Because AngularJS treats your HTML as code, you get <strong>HTML level granularity in your web application</strong>. Everything is possible, and most things are surprisingly easy once you make a few conceptual leaps.
es: Si esto suena como si fuera demasiado prescriptivo y limitante, nada podr&iacute;a estar m&aacute;s lejos de la verdad. Debido a que AngularJS trata su HTML como c&oacute;digo, obtiene <strong>granularidad de nivel HTML en su aplicaci&oacute;n web</strong> . Todo es posible, y la mayor&iacute;a de las cosas son sorprendentemente f&aacute;ciles una vez que haces algunos saltos conceptuales.

source: If you do use jQuery, you shouldn't be sprinkling it all over the place. The correct place for DOM manipulation in AngularJS is in a directive. More on these later.
es: Si usas jQuery,no deberías rociarlo por todos lados.El lugar correcto para la manipulación de DOM en AngularJS está en una directiva.Más sobre esto más tarde.

source: If you need an HTML widget, create a directive.
es: Si necesitas un widget HTML,crea una directiva.

source: If you need to share data between controllers, create a service or factory - they are singletons that are shared across the application.
es: Si necesita compartir datos entre controladores,cree un servicio o una fábrica-son monolitos que se comparten a través de la aplicación.

source: If you want a carousel, just use a <code>&lt;carousel /&gt;</code> element, then define a directive to pull in a template, and make that sucker work.
es: Si desea un carrusel, simplemente use un elemento <code>&lt;carousel /&gt;</code> , luego defina una directiva para extraer una plantilla y hacer que ese tonto funcione.

source: If, like me, you lived through the browser wars, you might find this idea quite offensive. Get over it, it'll be worth it, I promise.
es: Si,como yo,viviste las guerras de navegador,podrías encontrar esta idea bastante ofensiva.Supéralo,valdrá la pena,lo prometo.

source: Imperative &rarr; declarative
es: Imperativo &rarr; declarativo

source: In <strong>AngularJS</strong>, you use <strong>directives</strong> to mark the elements directly, to wire them up:
es: En <strong>AngularJS</strong> , usa <strong>directivas</strong> para marcar los elementos directamente, para conectarlos:

source: In <strong>jQuery</strong>, you typically use <strong>selectors</strong> to find elements, and then wire them up:
es: En <strong>jQuery</strong> , normalmente usa <strong>selectores</strong> para buscar elementos y luego los conecta:

source: In AngularJS we write smaller directives. Our dropdown directive would be ridiculously small. It might maintain the folded state, and provide methods to fold(), unfold() or toggle(). These methods would simply update $scope.menu.visible which is a boolean holding the state.
es: En AngularJS escribimos directivas más pequeñas.Nuestra directiva desplegable sería ridículamente pequeña.Podría mantener el estado de plegado,y proporcionar métodos para plegar(),desplegar()o conmutar().Estos métodos simplemente actualizarían $scope.menu.visible que es un booleano que mantiene el estado.

source: In AngularJS you can do this too, but you are encouraged to make use of data binding. Change your model, and because the DOM is bound to it via a template your DOM will automatically update, no intervention required.
es: En AngularJS también puedes hacer esto,pero se te anima a hacer uso de la vinculación de datos.Cambie su modelo,y como el DOM está vinculado a él a través de una plantilla,su DOM se actualizará automáticamente,sin necesidad de intervención.

source: In AngularJS, Ajax is your default go-to solution and it happens all the time, almost without you noticing. You can include templates with ng-include. You can apply a template with the simplest custom directive. You can wrap an Ajax call in a service and create yourself a <a href="http://en.wikipedia.org/wiki/GitHub">GitHub</a> service, or a <a href="http://en.wikipedia.org/wiki/Flickr">Flickr</a> service, which you can access with astonishing ease.
es: En AngularJS, Ajax es su soluci&oacute;n predeterminada y ocurre todo el tiempo, casi sin que lo note. Puede incluir plantillas con ng-include. Puede aplicar una plantilla con la directiva personalizada m&aacute;s simple. Puede ajustar una llamada Ajax en un servicio y crearse un servicio <a href="http://en.wikipedia.org/wiki/GitHub">GitHub</a> o un servicio <a href="http://en.wikipedia.org/wiki/Flickr">Flickr</a> , al que puede acceder con asombrosa facilidad.

source: In AngularJS, meaning lives in the model, the HTML is just a template, for display only.
es: En AngularJS,es decir,vive en el modelo,el HTML es sólo una plantilla,sólo para mostrar.

source: In AngularJS, think about models, rather than jQuery-selected DOM elements that hold your data. Think about views as projections of those models, rather than registering callbacks to manipulate what the user sees.
es: En AngularJS,piense en los modelos,más que en los elementos DOM seleccionados por jQuery que contienen sus datos.Piense en las vistas como proyecciones de esos modelos,en lugar de registrar llamadas para manipular lo que el usuario ve.

source: In AngularJS, though, the view is the official record of view-based functionality. Our <code>ul</code> declaration would look like this instead:
es: Sin embargo, en AngularJS, la vista es el registro oficial de la funcionalidad basada en la vista. Nuestra declaraci&oacute;n <code>ul</code> se ver&iacute;a as&iacute; en su lugar:

source: In AngularJS, we define directives. A directive is a function which returns a JSON object. This object tells AngularJS what DOM elements to look for, and what changes to make to them. Directives are hooked in to the template using either attributes or elements, which you invent. The idea is to extend the capabilities of HTML with new attributes and elements.
es: En AngularJS,definimos directivas.Una directiva es una función que devuelve un objeto JSON.Este objeto le dice a AngularJS qué elementos DOM buscar,y qué cambios hacer en ellos.Las directivas se enganchan a la plantilla usando atributos o elementos,que usted inventa.La idea es extender las capacidades del HTML con nuevos atributos y elementos.

source: In AngularJS, you want to think about <strong>views</strong> rather than DOM elements. Views are (declarative) HTML that contain AngularJS <strong>directives</strong>. Directives set up the event handlers behind the scenes for us and give us dynamic databinding. Selectors are rarely used, so the need for IDs (and some types of classes) is greatly diminished. Views are tied to <strong>models</strong> (via scopes). Views are a projection of the model. Events change models (that is, data, scope properties), and the views that project those models update "automatically."
es: En AngularJS, desea pensar en <strong>vistas en</strong> lugar de elementos DOM. Las vistas son HTML (declarativo) que contienen <strong>directivas</strong> AngularJS. Las directivas configuran los controladores de eventos detr&aacute;s de escena para nosotros y nos brindan un enlace de datos din&aacute;mico. Los selectores rara vez se usan, por lo que la necesidad de ID (y algunos tipos de clases) se ve muy disminuida. Las vistas est&aacute;n vinculadas a <strong>modelos</strong> (a trav&eacute;s de &aacute;mbitos). Las vistas son una proyecci&oacute;n del modelo. Los eventos cambian los modelos (es decir, datos, propiedades del alcance) y las vistas que proyectan esos modelos se actualizan "autom&aacute;ticamente".

source: In fact, AngularJS is one of the few JavaScript MV* frameworks (many JavaScript MVC tools still fall under the category library).
es: De hecho,AngularJS es uno de los pocos marcos de trabajo de JavaScript MV*(muchas herramientas de JavaScript MVC todavía entran en la biblioteca de categorías).

source: In jQuery making an Ajax call is fairly simple, but it's still something you might think twice about. There's the added complexity to think about, and a fair chunk of script to maintain.
es: En jQuery hacer una llamada a Ajax es bastante simple,pero es algo que podrías pensar dos veces.Hay que pensar en la complejidad añadida,y un buen trozo de guión que mantener.

source: In jQuery we define plugins by adding functions to the jQuery.prototype. We then hook these into the DOM by selecting elements and calling the plugin on the result. The idea is to extend the capabilities of jQuery.
es: En jQuery definimos los plugins añadiendo funciones al prototipo jQuery.prototype.Luego las enganchamos en el DOM seleccionando elementos y llamando al plugin en el resultado.La idea es extender las capacidades de jQuery.

source: In jQuery you make all your DOM changes by hand. You construct new DOM elements programatically. If you have a JSON array and you want to put it to the DOM, you must write a function to generate the HTML and insert it.
es: En jQuery haces todos tus cambios de DOM a mano.Construyes nuevos elementos DOM de forma programada.Si tienes una matriz JSON y quieres ponerla en el DOM,debes escribir una función para generar el HTML e insertarlo.

source: In jQuery, <em>selectors</em> are used to find <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a> elements and then bind/register event handlers to them. When an event triggers, that (imperative) code executes to update/change the DOM.
es: En jQuery, los <em>selectores</em> se utilizan para buscar elementos <a href="http://en.wikipedia.org/wiki/Document_Object_Model">DOM</a> y luego vincularlos / registrar controladores de eventos. Cuando se activa un evento, ese c&oacute;digo (imperativo) se ejecuta para actualizar / cambiar el DOM.

source: In jQuery, if we want to accomplish a small non-dom related task such as pulling a feed from an API, we might write a little function to do that in our closure. That's a valid solution, but what if we want to access that feed often? What if we want to reuse that code in another application?
es: En jQuery,si queremos realizar una pequeña tarea no relacionada con el dom,como extraer un feed de una API,podríamos escribir una pequeña función para hacerlo en nuestro cierre.Esa es una solución válida,pero ¿qué pasa si queremos acceder a ese feed a menudo? ¿Y si queremos reutilizar ese código en otra aplicación?

source: In jQuery, in our application logic, we would activate it with something like:
es: En jQuery,en nuestra lógica de aplicación,lo activábamos con algo como:

source: In jQuery, the DOM is kind of like the model. But in AngularJS, we have a separate model layer that we can manage in any way we want, completely independently from the view. This helps for the above data binding, maintains <a href="http://en.wikipedia.org/wiki/Separation_of_concerns">separation of concerns</a>, and introduces far greater testability. Other answers mentioned this point, so I'll just leave it at that.
es: En jQuery, el DOM es algo as&iacute; como el modelo. Pero en AngularJS, tenemos una capa de modelo separada que podemos administrar de la forma que queramos, completamente independiente de la vista. Esto ayuda para el enlace de datos anterior, mantiene la <a href="http://en.wikipedia.org/wiki/Separation_of_concerns">separaci&oacute;n de las preocupaciones</a> e introduce una capacidad de prueba mucho mayor. Otras respuestas mencionaron este punto, as&iacute; que lo dejar&eacute; as&iacute;.

source: In jQuery, the only way to test is often to create the component independently with a sample/demo page against which our tests can perform DOM manipulation. So then we have to develop a component separately and <em>then</em> integrate it into our application. How inconvenient! So much of the time, when developing with jQuery, we opt for iterative instead of test-driven development. And who could blame us?
es: En jQuery, la &uacute;nica forma de probar es a menudo crear el componente de forma independiente con una p&aacute;gina de muestra / demostraci&oacute;n contra la cual nuestras pruebas pueden realizar la manipulaci&oacute;n DOM. Entonces, tenemos que desarrollar un componente por separado y <em>luego</em> integrarlo en nuestra aplicaci&oacute;n. &iexcl;Qu&eacute; inconveniente! Gran parte del tiempo, al desarrollar con jQuery, optamos por un desarrollo iterativo en lugar de un desarrollo basado en pruebas. &iquest;Y qui&eacute;n podr&iacute;a culparnos?

source: In jQuery, we programmatically change the view. We could have a dropdown menu defined as a <code>ul</code> like so:
es: En jQuery, cambiamos la vista mediante programaci&oacute;n. Podr&iacute;amos tener un men&uacute; desplegable definido como un <code>ul</code> as&iacute;:

source: In jQuery, you design a page, and then you make it dynamic. This is because jQuery was designed for augmentation and has grown incredibly from that simple premise.
es: En jQuery,diseñas una página,y luego la haces dinámica.Esto se debe a que jQuery fue diseñado para aumentar y ha crecido increíblemente desde esa simple premisa.

source: It focuses on <a href="http://en.wikipedia.org/wiki/Separation_of_concerns">separation of concerns</a> and testing (<a href="http://en.wikipedia.org/wiki/Unit_testing">unit testing</a> and end-to-end testing), which facilitates test-driven development.
es: Se centra en la <a href="http://en.wikipedia.org/wiki/Separation_of_concerns">separaci&oacute;n de preocupaciones</a> y pruebas (pruebas <a href="http://en.wikipedia.org/wiki/Unit_testing">unitarias</a> y pruebas de extremo a extremo), lo que facilita el desarrollo basado en pruebas.

source: It looks like this:
es: Se parece a esto:

source: It's more similar to <a href="http://en.wikipedia.org/wiki/XSLT">XSLT</a> than <a href="http://en.wikipedia.org/wiki/Ruby_on_Rails">Ruby on Rails</a> for example.
es: Es m&aacute;s similar a <a href="http://en.wikipedia.org/wiki/XSLT">XSLT</a> que <a href="http://en.wikipedia.org/wiki/Ruby_on_Rails">Ruby on Rails,</a> por ejemplo.

source: It's really two very different states of mind.
es: En realidad son dos estados de ánimo muy diferentes.

source: JQuery plugins are created in a closure. Privacy is maintained within that closure. It's up to you to maintain your scope chain within that closure. You only really have access to the set of DOM nodes passed in to the plugin by jQuery, plus any local variables defined in the closure and any globals you have defined. This means that plugins are quite self contained. This is a good thing, but can get restrictive when creating a whole application. Trying to pass data between sections of a dynamic page becomes a chore.
es: Los plugins de JQuery se crean en un cierre.La privacidad se mantiene dentro de ese cierre.Depende de ti mantener tu cadena de alcance dentro de ese cierre.Sólo tienes acceso al conjunto de nodos DOM pasados al plugin por jQuery,más cualquier variable local definida en el cierre y cualquier global que hayas definido.Esto significa que los plugins son bastante autocontenidos.Esto es algo bueno,pero puede volverse restrictivo al crear una aplicación completa.Intentar pasar datos entre secciones de una página dinámica se convierte en una tarea.

source: JavaScript - Behaviour, without the script the content remains.
es: JavaScript-Comportamiento,sin el guión el contenido permanece.

source: Let's get down to the nitty gritty.
es: Vayamos al grano.
