Repository: translationfeedback/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: es

source: ** It won't work if you reference for urls outsite of your domain because of 'X-Frame-Options' to 'sameorigin'.
es: **No funcionará si haces referencia a urls fuera de tu dominio debido a "X-Frame-Opciones" a "mismo origen".

source: .. denotes a folder - denotes a file while four | denote a sub directory or file in parent folder
es: denote a sub directory or file in parent folder

source: 7 Ways to do that:
es: 7 maneras de hacerlo:

source: <a href="http://getbootstrap.com/2.3.2/base-css.html#buttons">Bootstrap (v2)</a> sample appearance:
es: <a href="http://getbootstrap.com/2.3.2/base-css.html#buttons"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apariencia de muestra </font><font style="vertical-align: inherit;">Bootstrap (v2)</font><font style="vertical-align: inherit;"> :</font></font>

source: <a href="http://jsfiddle.net/q4616mvr/">Here's</a> a <a href="http://jsfiddle.net/">jsFiddle</a> to check it out and play around with it.
es: <a href="http://jsfiddle.net/q4616mvr/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; hay</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> un </font></font><a href="http://jsfiddle.net/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jsFiddle</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para verlo y jugar con &eacute;l.</font></font>

source: <a href="https://getbootstrap.com/docs/3.3/css/#buttons">Bootstrap (v3)</a> sample appearance:
es: <a href="https://getbootstrap.com/docs/3.3/css/#buttons"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apariencia de muestra de </font><font style="vertical-align: inherit;">Bootstrap (v3)</font><font style="vertical-align: inherit;"> :</font></font>

source: <a href="https://getbootstrap.com/docs/4.0/components/buttons/">Bootstrap (v4)</a> sample appearance:
es: <a href="https://getbootstrap.com/docs/4.0/components/buttons/"><font style="vertical-align: inherit;"></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apariencia de muestra </font><font style="vertical-align: inherit;">Bootstrap (v4)</font><font style="vertical-align: inherit;"> :</font></font>

source: <a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button">Styling a link like a button</a> is relatively easy and can provide similar experience across different browsers. <a href="https://en.wikipedia.org/wiki/Bootstrap_%28front-end_framework%29">Bootstrap</a> does this, but it is also easy to achieve on your own using simple styles.
es: <a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dise&ntilde;ar un enlace como un bot&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es relativamente f&aacute;cil y puede proporcionar una experiencia similar en diferentes navegadores. </font></font><a href="https://en.wikipedia.org/wiki/Bootstrap_%28front-end_framework%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> hace esto, pero tambi&eacute;n es f&aacute;cil de lograr usando estilos simples.</font></font>

source: <code>&lt;button&gt;</code> type must be "submit" (or unspecified), I couldn't get it working with type "button." Which brings up point below.
es: <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> debe ser "submit" (o no especificado), no pude hacerlo funcionar con el tipo "button". </font><font style="vertical-align: inherit;">Lo que trae el siguiente punto.</font></font>

source: <strong>BUT</strong> then recently, I encountered a problem when I used a link inside a <code>&lt;form&gt;&lt;/form&gt;</code>.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">PERO</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> recientemente, encontr&eacute; un problema cuando utilic&eacute; un enlace dentro de un </font></font> <code>&lt;form&gt;&lt;/form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: <strong>For HTML 5 and styled button along with image background</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para HTML 5 y bot&oacute;n con estilo junto con fondo de imagen</font></font></strong>

source: @Nicolas,following worked for me as yours didn't have <code>type="button"</code> due to which it started behaving as submit type..since i already have one submit type.it didn't worked for me ....and now you can either add class to button or to <code>&lt;a&gt;</code> to get required layout:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">@ Nicolas, lo siguiente funcion&oacute; para m&iacute;, ya que el tuyo no ten&iacute;a </font></font> <code>type="button"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> debido a que comenz&oacute; a comportarse como tipo de env&iacute;o ... ya que ya tengo un tipo de env&iacute;o, no funcion&oacute; para m&iacute; ... y ahora puede agregar clase al bot&oacute;n o </font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener el dise&ntilde;o requerido:</font></font>

source: Adds extra <code>&lt;form&gt;</code> element
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A&ntilde;ade adicional </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> elemento</font></font>

source: Allows you to cleanly separte the button styling and text styling from each other (stretch advantage? Sure, but CSS can get nasty-looking so it's nice to decompose it).
es: Permite separar limpiamente el estilo de los botones y el estilo del texto entre sí (¿ventaja de estirar? Claro,pero el CSS puede tener un aspecto desagradable,así que es bueno descomponerlo).

source: Also you can use a button:
es: También puedes usar un botón:

source: And it will load the href into the same page. Want a new page? Just use <code>target="_blank"</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y cargar&aacute; el href en la misma p&aacute;gina. </font><font style="vertical-align: inherit;">&iquest;Quieres una nueva p&aacute;gina? </font><font style="vertical-align: inherit;">Solo usa </font></font> <code>target="_blank"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: And then create your link with a <em>class</em> tag named after the CSS style you have made:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y luego cree su enlace con una </font><font style="vertical-align: inherit;">etiqueta de </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">clase con el</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> nombre del estilo CSS que ha creado:</font></font>

source: Another option is to create a link in the button:
es: Otra opción es crear un enlace en el botón:

source: As of HTML5, buttons support the <code>formaction</code> attribute. Best of all, no Javascript or trickery is needed.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A partir de HTML5, los botones admiten el </font><font style="vertical-align: inherit;">atributo de </font></font> <code>formaction</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Lo mejor de todo es que no se necesita Javascript ni trucos.</font></font>

source: Based on the answers posted so far, I am currently doing this:
es: Basándome en las respuestas publicadas hasta ahora,estoy haciendo esto actualmente:

source: Be careful to make sure the button doesn't trigger any action, as that will result in a conflict. Also as Arius pointed out, you should be aware that, for the above reason, this isn't strictly speaking considered valid HTML, according to the standard. It does however work as expected in Firefox and Chrome, but I haven't yet tested it for Internet&nbsp;Explorer.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga cuidado de asegurarse de que el bot&oacute;n no active ninguna acci&oacute;n, ya que eso generar&aacute; un conflicto. </font><font style="vertical-align: inherit;">Adem&aacute;s, como se&ntilde;al&oacute; Arius, debe tener en cuenta que, por la raz&oacute;n anterior, esto no se considera estrictamente HTML v&aacute;lido, de acuerdo con el est&aacute;ndar. </font><font style="vertical-align: inherit;">Sin embargo, funciona como se esperaba en Firefox y Chrome, pero a&uacute;n no lo he probado para Internet Explorer.</font></font>

source: Benefits of this setup: 1. Making the div wrapper display: block makes it easy to center (using margin: 0 auto) and position (while an &lt;a&gt; is inline and harder to positionand not possible to center).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Beneficios de esta configuraci&oacute;n: 1. Hacer que la pantalla de envoltura div: el bloque facilite el centrado (usando el margen: 0 autom&aacute;tico) y la posici&oacute;n (mientras que un &lt;a&gt; est&aacute; en l&iacute;nea y es m&aacute;s dif&iacute;cil de posicionar y no es posible centrarlo).</font></font>

source: But the problem with this is that in some version of popular browsers such as Chrome, Safari and Internet Explorer, it adds a question mark character to the end of the URL. So in other words for the code above your URL will end up looking like this:
es: Pero el problema es que en algunas versiones de navegadores populares como Chrome,Safari e Internet Explorer,añade un carácter de signo de interrogación al final de la URL.Así que,en otras palabras,para el código de arriba,tu URL terminará viéndose así:

source: But this obviously requires JavaScript, and for that reason it is less accessible to screen readers. The point of a link is to go to another page. So trying to make a button act like a link is the wrong solution. My suggestion is that you should use a link and <a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button">style it to look like a button</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pero esto obviamente requiere JavaScript, y por eso es menos accesible para los lectores de pantalla. </font><font style="vertical-align: inherit;">El punto de un enlace es ir a otra p&aacute;gina. </font><font style="vertical-align: inherit;">Por lo tanto, tratar de hacer que un bot&oacute;n act&uacute;e como un enlace es la soluci&oacute;n incorrecta. </font><font style="vertical-align: inherit;">Mi sugerencia es que debe usar un enlace y </font></font><a href="https://stackoverflow.com/questions/710089/how-do-i-make-an-html-link-look-like-a-button"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">darle un estilo para que parezca un bot&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Couple of years later, while my solution still works, keep in mind you can use a lot of CSS to make it look whatever you want. This was just a fast way.
es: Un par de años después,mientras mi solución aún funciona,ten en cuenta que puedes usar mucho CSS para que se vea como quieras.Esto fue sólo una manera rápida.

source: Create a CSS class and add it to your anchor. The code is below.
es: Crea una clase CSS y añádela a tu ancla.El código está abajo.

source: Create a CSS style button like the one below:
es: Crear un botón de estilo CSS como el que se muestra a continuación:

source: Does not need JavaScript to work.
es: No necesita JavaScript para funcionar.

source: Does not need a <code>&lt;form&gt;</code> to work.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No necesita un </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para funcionar.</font></font>

source: Element positioning when using multiple forms can be tricky and becomes even worse when dealing with responsive designs. Some layout can become impossible to achieve with this solution depending on the order of the elements. This can end up impacting usability if the design is impacted by this challenge.
es: El posicionamiento de los elementos cuando se usan múltiples formas puede ser complicado y se vuelve aún peor cuando se trata de diseños sensibles.Algunos diseños pueden llegar a ser imposibles de lograr con esta solución dependiendo del orden de los elementos.Esto puede terminar impactando la usabilidad si el diseño se ve afectado por este desafío.

source: Expand snippet
es: Ampliar fragmento

source: For example, in <em>ASP.NET Core syntax</em>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por ejemplo, en la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sintaxis de ASP.NET Core</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Furthermore the ?_ijt=xxxxxxxxxxxxxx at the end off the main.html URL, x is determined by your own connection so obviously will not be equal to mine.
es: Además,el ?_ijt=xxxxxxxxxxxxxx al final de la URL main.html,x está determinado por su propia conexión así que obviamente no será igual a la mía.

source: Going along with what a few others have added, you can go wild with just using a simple CSS class with no PHP, no <a href="http://en.wikipedia.org/wiki/JQuery">jQuery</a> code, just simple HTML and CSS.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Siguiendo lo que otros han agregado, puede volverse loco con solo usar una clase CSS simple sin PHP, sin </font><font style="vertical-align: inherit;">c&oacute;digo </font></font><a href="http://en.wikipedia.org/wiki/JQuery"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">jQuery</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , solo HTML y CSS simples.</font></font>

source: Have you considered styling a normal link like a button? You can't achieve OS specific buttons that way, but it's still the best way IMO.
es: ¿Has considerado el estilo de un enlace normal como un botón? No se pueden conseguir botones específicos del sistema operativo de esa manera,pero sigue siendo la mejor manera de la OMI.

source: Here's a fiddle:
es: Aquí hay un violín:

source: How can I achieve this?
es: ¿Cómo puedo lograrlo?

source: How to create an HTML button that acts like a link
es: Cómo crear un botón HTML que actúe como un enlace

source: However, when I clicked the button inside main.html to change to secondary.html, the URL would be,
es: Sin embargo,cuando hice clic en el botón dentro de main.html para cambiar a secondary.html,el URL sería,

source: I have created a <a href="http://codepen.io/lukeocom/pen/LpdKz">demo here</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">He creado una </font></font><a href="http://codepen.io/lukeocom/pen/LpdKz"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">demostraci&oacute;n aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: I know there have been a lot of answers submitted, but none of them seemed to really nail the problem. Here is my take at a solution:
es: Sé que se han presentado muchas respuestas,pero ninguna de ellas parecía realmente clavar el problema.Esta es mi opinión sobre la solución:

source: I used this for a website I'm currently working on and it works great!. If you want some cool styling too I'll put the CSS down here.
es: Usé esto para un sitio web en el que estoy trabajando actualmente y funciona muy bien!.Si quieres un estilo genial también pondré el CSS aquí abajo.

source: I would also like it so there aren't any extra characters, or parameters in the URL.
es: También me gustaría que no hubiera caracteres extra,o parámetros en la URL.

source: I would like to create an HTML button that acts like a link. So, when you click the button, it redirects to a page. I would like it to be as accessible as possible.
es: Me gustaría crear un botón HTML que actúe como un enlace.Así,cuando haces clic en el botón,se redirige a una página.Me gustaría que fuera lo más accesible posible.

source: If CSS is allowed, simply use an <code>&lt;a&gt;</code> which you style to look like a button using among others the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/-moz-appearance"><code>appearance</code></a> property (<a href="https://caniuse.com/#feat=css-appearance">it's only not supported in Internet&nbsp;Explorer</a>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si se permite CSS, simplemente use un </font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cuyo estilo parezca un bot&oacute;n usando, entre otros, la </font><font style="vertical-align: inherit;">propiedad de </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/-moz-appearance"> <code>appearance</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font><a href="https://caniuse.com/#feat=css-appearance"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">solo no es compatible con Internet Explorer</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>

source: If I open main.html the URL would be,
es: Si abro main.html la URL sería,

source: If JavaScript is allowed, set the <code>window.location.href</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si JavaScript est&aacute; permitido, configure </font></font> <code>window.location.href</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: If JavaScript is not an obstacle to your accessibility requirements, then solution #2 (<strong>JavaScript</strong>) would be preferred over #1 and #3.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si JavaScript no es un obst&aacute;culo para sus requisitos de accesibilidad, la soluci&oacute;n # 2 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JavaScript</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) ser&iacute;a preferible a la # 1 y # 3.</font></font>

source: If for some reason, accessibility is vital (JavaScript is not an option) but you are in a situation where your design and/or your server configuration is preventing you from using option #1, then solution #3 (<strong>Anchor styled like a button</strong>) is a good alternative solve this problem with minimal usability impact.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si por alguna raz&oacute;n, la accesibilidad es vital (JavaScript no es una opci&oacute;n) pero se encuentra en una situaci&oacute;n en la que su dise&ntilde;o y / o la configuraci&oacute;n de su servidor le impiden usar la opci&oacute;n n. &deg; 1, entonces la soluci&oacute;n n. &deg; 3 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Anchor tiene el estilo de un bot&oacute;n</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) Es una buena alternativa para resolver este problema con un impacto de usabilidad m&iacute;nimo.</font></font>

source: If it's the visual appearance of a button you're looking for in a basic HTML anchor tag then you can use the <a href="http://getbootstrap.com/">Twitter Bootstrap</a> framework to format any of the following common HTML type links/buttons to appear as a button. Please note the visual differences between version 2, 3 or 4 of the framework:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si se trata de la apariencia visual de un bot&oacute;n que est&aacute; buscando en una etiqueta de anclaje HTML b&aacute;sica, puede usar el </font><font style="vertical-align: inherit;">marco </font></font><a href="http://getbootstrap.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Twitter Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para formatear cualquiera de los siguientes enlaces / botones de tipo HTML comunes para que aparezcan como un bot&oacute;n. </font><font style="vertical-align: inherit;">Tenga en cuenta las diferencias visuales entre la versi&oacute;n 2, 3 o 4 del marco:</font></font>

source: If my project structure was...
es: Si la estructura de mi proyecto fuera...

source: If necessary, set CSS <code>display: inline;</code> on the form to keep it in the flow with the surrounding text. Instead of <code>&lt;input type="submit"&gt;</code> in above example, you can also use <code>&lt;button type="submit"&gt;</code>. The only difference is that the <code>&lt;button&gt;</code> element allows children.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si es necesario, configure la </font></font> <code>display: inline;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> CSS </font><font style="vertical-align: inherit;">: en l&iacute;nea; </font><font style="vertical-align: inherit;">en el formulario para mantenerlo en el flujo con el texto circundante. </font><font style="vertical-align: inherit;">En lugar de </font></font> <code>&lt;input type="submit"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el ejemplo anterior, tambi&eacute;n puede usar </font></font> <code>&lt;button type="submit"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">La &uacute;nica diferencia es que el </font><font style="vertical-align: inherit;">elemento </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> permite hijos.</font></font>

source: If what you need is that it will look like a button, <strong>with emphasis on the gradient image</strong>, you can do this:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si lo que necesita es que se ver&aacute; como un bot&oacute;n, </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">con &eacute;nfasis en la imagen de degradado</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puede hacer esto:</font></font>
