Repository: translationfeedback/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: es

source: If you are using an inside form, add the attribute <strong>type="reset"</strong> along with the button element. It will prevent the form action.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si est&aacute; utilizando un formulario interno, agregue el atributo </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">type = "reset"</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> junto con el elemento del bot&oacute;n. </font><font style="vertical-align: inherit;">Evitar&aacute; la acci&oacute;n del formulario.</font></font>

source: If you want to avoid having to use a form or an input and you're looking for a button-looking link, you can create good-looking button links with a div wrapper, an anchor and an <code>h1</code> tag. You'd potentially want this so you can freely place the link-button around your page. This is especially useful for horizontally centering buttons and having vertically-centered text inside of them. Here's how:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea evitar tener que usar un formulario o una entrada y est&aacute; buscando un enlace de bot&oacute;n, puede crear enlaces de botones atractivos con un envoltorio div, un ancla y una </font><font style="vertical-align: inherit;">etiqueta </font></font> <code>h1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Es posible que desee esto para poder colocar libremente el bot&oacute;n de enlace alrededor de su p&aacute;gina. </font><font style="vertical-align: inherit;">Esto es especialmente &uacute;til para centrar botones horizontalmente y tener texto centrado verticalmente dentro de ellos. </font><font style="vertical-align: inherit;">As&iacute; es c&oacute;mo:</font></font>

source: If you want to create a button that is used for a URL anywhere, create a button class for an anchor.
es: Si desea crear un botón que se utilice para una URL en cualquier lugar,cree una clase de botón para un ancla.

source: If you want to redirect for pages which reside within your website, then then here's my method - I've added the attribute <em>href</em> to the button, and onclick assigned <em>this.getAttribute('href')</em> to document.location.href
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea redirigir las p&aacute;ginas que residen dentro de su sitio web, entonces este es mi m&eacute;todo: agregu&eacute; el atributo </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">href</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al bot&oacute;n y onclick asign&oacute; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">this.getAttribute ('href')</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a document.location.href</font></font>

source: In HTML
es: En HTML

source: In JavaScript
es: En JavaScript

source: In Your Case-
es: En tu caso...

source: Instead of <code>&lt;input type="button"&gt;</code> in above example, you can also use <code>&lt;button&gt;</code>. The only difference is that the <code>&lt;button&gt;</code> element allows children.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En lugar de </font></font> <code>&lt;input type="button"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el ejemplo anterior, tambi&eacute;n puede usar </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">La &uacute;nica diferencia es que el </font><font style="vertical-align: inherit;">elemento </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> permite hijos.</font></font>

source: It definitely made my life easier styling a mobile website for variable-sized screens.
es: Definitivamente me facilitó la vida estilizando un sitio web móvil para pantallas de tamaño variable.

source: It is actualy very simple and without using any form elements. You can just use the &lt;a&gt; tag with a button inside :).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es realmente muy simple y sin usar ning&uacute;n elemento de formulario. </font><font style="vertical-align: inherit;">Puede usar la etiqueta &lt;a&gt; con un bot&oacute;n dentro :).</font></font>

source: It might seem like I'm stating some really basic points but I just want to explain as best as I can. Thank you for reading and I hope this help someone at the very least. Happy programming.
es: Puede parecer que estoy exponiendo algunos puntos realmente básicos,pero sólo quiero explicar lo mejor que pueda.Gracias por leer y espero que esto ayude a alguien por lo menos.Feliz programación.

source: It will not reproduce all behaviors of solution #1. It will not support the same behavior as button. For example, links react differently when dragged. Also the "space bar" link trigger will not work without some extra JavaScript code. It will add a lot of complexity since browsers are not consistent on how they support <code>keypress</code> events on buttons.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">No reproducir&aacute; todos los comportamientos de la soluci&oacute;n # 1. </font><font style="vertical-align: inherit;">No admitir&aacute; el mismo comportamiento que el bot&oacute;n. </font><font style="vertical-align: inherit;">Por ejemplo, los enlaces reaccionan de manera diferente cuando se arrastran. </font><font style="vertical-align: inherit;">Adem&aacute;s, el activador de enlace "barra espaciadora" no funcionar&aacute; sin alg&uacute;n c&oacute;digo JavaScript adicional. </font><font style="vertical-align: inherit;">Agregar&aacute; mucha complejidad ya que los navegadores no son consistentes en c&oacute;mo admiten </font><font style="vertical-align: inherit;">eventos de </font></font> <code>keypress</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en botones.</font></font>

source: JSBin Example (code snippet can't follow links)
es: Ejemplo de JSBin (el fragmento de código no puede seguir los enlaces)

source: Like this:
es: Así:

source: Must be surrounded by <code>&lt;form&gt;</code> tags.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debe estar rodeado de </font><font style="vertical-align: inherit;">etiquetas </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: No JavaScript, no complex style required.
es: No se requiere JavaScript,ni un estilo complejo.

source: No special characters included at the end of the URL. I hope this helps. By the way - (%20 denotes a space in a URL its encoded and inserted in the place of them.)
es: No se incluyen caracteres especiales al final del URL.Espero que esto ayude.Por cierto-(%20 denota un espacio en un URL su codificado e insertado en el lugar de ellos.)

source: Note that the <code>type="button"</code> attribute is important, since <a href="https://www.w3.org/TR/2011/WD-html5-20110525/the-button-element.html#the-button-element">its missing value default is the Submit Button state</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que el </font><font style="vertical-align: inherit;">atributo </font></font> <code>type="button"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es importante, ya que el </font></font><a href="https://www.w3.org/TR/2011/WD-html5-20110525/the-button-element.html#the-button-element"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">valor predeterminado que falta es el estado del bot&oacute;n Enviar</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Note: The localhost:0000 will obviously not be 0000 you'll have your own port number there.
es: Nota:El localhost:0000 obviamente no será 0000 tendrás tu propio número de puerto allí.

source: Or create a new one here : <a href="http://button.csscook.com/">CSS Button Generator</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O cree uno nuevo aqu&iacute;: </font></font><a href="http://button.csscook.com/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">CSS Button Generator</font></font></a>

source: Or pick one of those many CSS libraries like <a href="https://getbootstrap.com/docs/4.4/components/buttons/">Bootstrap</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O elija una de esas muchas bibliotecas CSS como </font></font><a href="https://getbootstrap.com/docs/4.4/components/buttons/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Bootstrap</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Overrides the default action in a form. In other words, if you do this inside another form it's going to cause a conflict.
es: Anula la acción predeterminada en un formulario.En otras palabras,si haces esto dentro de otra forma va a causar un conflicto.

source: People who have answered using <code>&lt;a&gt;&lt;/a&gt;</code> attributes on a <code>&lt;button&gt;&lt;/button&gt;</code> was helpful.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las personas que respondieron usando los </font><font style="vertical-align: inherit;">atributos </font></font> <code>&lt;a&gt;&lt;/a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en un </font></font> <code>&lt;button&gt;&lt;/button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> fueron &uacute;tiles.</font></font>

source: Reference: <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction">https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction</a> Browser Support: <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#Browser_compatibility">https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#Browser_compatibility</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Referencia: </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#attr-formaction</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Soporte del navegador: </font></font><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button#Browser_compatibility"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://developer.mozilla.org/en-US/docs/Web/ HTML / Elemento / bot&oacute;n # Navegador_compatibilidad</font></font></a>

source: Replace <code>http://www.google.com</code> with your website, make sure to include <code>http://</code> before the URL.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Reemplace </font></font> <code>http://www.google.com</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con su sitio web, aseg&uacute;rese de incluir </font></font> <code>http://</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> antes de la URL.</font></font>

source: Requires JavaScript which means less accessible. This is not ideal for a base (core) element such as a link.
es: Requiere JavaScript,lo que significa menos accesible.Esto no es ideal para un elemento base (núcleo)como un enlace.

source: Sample code:
es: Código de muestra:

source: Semantic is sort of broken, because you want a button that acts like a link and not a link that acts like a button.
es: La semántica está algo rota,porque quieres un botón que actúe como un vínculo y no un vínculo que actúe como un botón.

source: Similar configurations can vary depending on the webserver and stack used. So a summary of this approach:
es: Configuraciones similares pueden variar dependiendo del servidor web y la pila utilizada.Así que un resumen de este enfoque:

source: Simple (for basic requirement) and good cross-browser support.
es: Simple (para el requerimiento básico)y un buen soporte para el cross-browser.

source: Simple (for basic requirement) and keep semantic while not requiring an extra form.
es: Simple (para el requisito básico)y mantener la semántica sin requerir una forma extra.

source: Since it is a real button, it will also act like a real button (e.g. draggable behavior and/or mimic a click when pressing space bar when active).
es: Dado que es un botón real,también actuará como un botón real (por ejemplo,se puede arrastrar o imitar un clic cuando se pulsa la barra espaciadora cuando está activa).

source: So For redirect another page you can set <code>href</code> value with your link.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Entonces, para redirigir otra p&aacute;gina, puede establecer el </font><font style="vertical-align: inherit;">valor </font></font> <code>href</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con su enlace.</font></font>

source: Solution #1 (<strong>Button in a form</strong>) seems like the most transparent for users with minimal work required. If your layout is not impacted by this choice and the server side tweak is feasible, this is a good option for cases where accessibility is the top priority (e.g. links on an error page or error messages).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La soluci&oacute;n n. &deg; 1 ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bot&oacute;n en un formulario</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) parece la m&aacute;s transparente para los usuarios con un trabajo m&iacute;nimo requerido. </font><font style="vertical-align: inherit;">Si su dise&ntilde;o no se ve afectado por esta elecci&oacute;n y el ajuste del lado del servidor es factible, esta es una buena opci&oacute;n para los casos en que la accesibilidad es la m&aacute;xima prioridad (por ejemplo, enlaces en una p&aacute;gina de error o mensajes de error).</font></font>

source: Solution 1: Button in a form.
es: Solución 1:Botón en forma.

source: Solution 2: Using JavaScript.
es: Solución 2:Usar JavaScript.

source: Solution 3: Anchor (link) styled like a button.
es: Solución 3:Ancla (enlace)con el estilo de un botón.

source: Sometimes when you embed an &lt;a&gt; within a div, only the text is clickable, this setup makes the whole button clickable.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">A veces, cuando incrusta un &lt;a&gt; dentro de un div, solo se puede hacer clic en el texto, esta configuraci&oacute;n hace que se pueda hacer clic en todo el bot&oacute;n.</font></font>

source: That is it. It is very easy to do and lets you be as creative as you'd like. You control the colors, the size, the shapes(radius), etc. For more detailsm, see <a href="http://www.usabilitypost.com/2012/01/10/pressed-button-state-with-css3">the site I found this on</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Eso es. </font><font style="vertical-align: inherit;">Es muy f&aacute;cil de hacer y te permite ser tan creativo como quieras. </font><font style="vertical-align: inherit;">Usted controla los colores, el tama&ntilde;o, las formas (radio), etc. Para obtener m&aacute;s detalles, consulte </font></font><a href="http://www.usabilitypost.com/2012/01/10/pressed-button-state-with-css3"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">el sitio en el que encontr&eacute; esto</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: The JavaScript code prevents the default action from happening and then follows the link given in the <code>&lt;form&gt;</code><code>action</code> attribute.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El c&oacute;digo JavaScript evita que suceda la acci&oacute;n predeterminada y luego sigue el enlace proporcionado en el </font><font style="vertical-align: inherit;">atributo de </font> <code>action</code> </font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font><font style="vertical-align: inherit;"></font><font style="vertical-align: inherit;"></font>

source: The JavaScript code uses event delegation so you can attach an event listener before the <code>&lt;form&gt;</code> or <code>&lt;button&gt;</code> even exist. I'm using jQuery in this example, because it is quick and easy, but it can be done in 'vanilla' JavaScript as well.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El c&oacute;digo JavaScript usa la delegaci&oacute;n de eventos para que pueda adjuntar un detector de eventos antes de que </font><font style="vertical-align: inherit;">exista </font><font style="vertical-align: inherit;">el </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font> <code>&lt;button&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Estoy usando jQuery en este ejemplo, porque es r&aacute;pido y f&aacute;cil, pero tambi&eacute;n se puede hacer en JavaScript 'vainilla'.</font></font>

source: The button is now regarded like/as a submit button (HTML5). I've tried working a way around, and have found this method.
es: El botón se considera ahora como un botón de envío (HTML5).He tratado de trabajar de una manera diferente,y he encontrado este método.

source: The only way to do this (except for BalusC's ingenious form idea!) is by adding a JavaScript <code>onclick</code> event to the button, which is not good for accessibility.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La &uacute;nica forma de hacer esto (&iexcl;excepto la ingeniosa idea de forma de BalusC!) Es agregando un </font><font style="vertical-align: inherit;">evento </font></font> <code>onclick</code> de<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> JavaScript </font><font style="vertical-align: inherit;">al bot&oacute;n, que no es bueno para la accesibilidad.</font></font>

source: The plain HTML way is to put it in a <code>&lt;form&gt;</code> wherein you specify the desired target URL in the <code>action</code> attribute.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La forma HTML simple es ponerlo en un </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en el que especifique la URL de destino deseada en el </font><font style="vertical-align: inherit;">atributo de </font></font> <code>action</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Then use CSS to style the link and button, so that the link takes up the entire space within the button (so there's no miss-clicking by the user):
es: Luego usa el CSS para dar estilo al enlace y al botón,para que el enlace ocupe todo el espacio dentro del botón (para que el usuario no se equivoque al hacer clic):

source: There are two other solutions to do this: Using JavaScript or styling a link to look like a button.
es: Hay otras dos soluciones para hacer esto:Usar JavaScript o estilizar un enlace para que parezca un botón.

source: There is one way to fix this, but it will require server-side configuration. One example using <strong>Apache Mod_rewrite</strong> would be to redirect all requests with a trailing <code>?</code> to their corresponding URL without the <code>?</code>. Here is an example using .htaccess, but there is a full thread <a href="https://stackoverflow.com/questions/14165287/removing-trailing-question-mark-with-htaccess">here</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay una forma de solucionar esto, pero requerir&aacute; una configuraci&oacute;n del lado del servidor. </font><font style="vertical-align: inherit;">&iquest;Un ejemplo usando </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Apache Mod_rewrite</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ser&iacute;a redirigir todas las solicitudes con un seguimiento </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a su URL correspondiente sin el </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Aqu&iacute; hay un ejemplo usando .htaccess, pero hay una rosca completa </font></font><a href="https://stackoverflow.com/questions/14165287/removing-trailing-question-mark-with-htaccess"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: There seems to be three solutions to this problem (all with pros and cons).
es: Parece que hay tres soluciones a este problema (todas con pros y contras).

source: This allows you to make the &lt;a&gt; display: inline-table and the &lt;h1&gt; display: table-cell, which allows you to use vertical-align: middle on the &lt;h1&gt; and center it vertically (which is always nice on a button). Yes, you could use padding, but if you want your button to dynamically resize, that won't be as clean.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto le permite hacer que la &lt;a&gt; pantalla: tabla en l&iacute;nea y la pantalla &lt;h1&gt;: tabla-celda, que le permite usar vertical-align: middle en la &lt;h1&gt; y centrarla verticalmente (que siempre es bueno en un bot&oacute;n). </font><font style="vertical-align: inherit;">S&iacute;, podr&iacute;a usar relleno, pero si desea que su bot&oacute;n cambie de tama&ntilde;o din&aacute;micamente, no ser&aacute; tan limpio.</font></font>

source: This does not add any character onto the end of the URL either, however it does have the files project path as the url before ending with the name of the file. e.g
es: Esto tampoco añade ningún carácter al final del URL,sin embargo tiene la ruta de proyecto de los archivos como el url antes de terminar con el nombre del archivo.por ejemplo

source: This is a real button, and semantically it makes sense.
es: Este es un botón real,y semánticamente tiene sentido.
