Repository: translationfeedback/feedback
Catalog: xlf/29/06/58/2/2906582.*.001.xlf
Languages: es

source: This seems to work perfectly for me and does not add any %20 tags to the link, just how you want it. I have used a link to google to demonstrate.
es: Esto parece funcionar perfectamente para mí y no añade ninguna etiqueta de %20 al enlace,tal y como lo quieres.He usado un enlace de Google para demostrarlo.

source: This way the first button redirects the user, while the second submits the form.
es: De esta manera el primer botón redirige al usuario,mientras que el segundo envía el formulario.

source: This way you could have another button in the same form that does submit the form, in case that's needed. I also think this is preferable in most cases over setting the form method and action to be a link (unless it's a search-form I guess...)
es: De esta manera,podría tener otro botón en la misma forma que el que envía el formulario,en caso de que sea necesario.También creo que esto es preferible en la mayoría de los casos a establecer el método y la acción del formulario como un enlace (a menos que sea un formulario de búsqueda,supongo...)

source: Trailing <code>?</code> looks ugly in some browsers. This can be fixed by a hack (in some cases) using POST instead of GET, but the clean way is to have a server-side redirect. The downside with the server side redirect is that it will cause an extra HTTP call for these links because of the 304 redirect.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Trailing </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">se ve feo en algunos navegadores. </font><font style="vertical-align: inherit;">Esto puede solucionarse mediante un hack (en algunos casos) usando POST en lugar de GET, pero la forma m&aacute;s limpia es tener una redirecci&oacute;n del lado del servidor. </font><font style="vertical-align: inherit;">La desventaja con la redirecci&oacute;n del lado del servidor es que causar&aacute; una llamada HTTP adicional para estos enlaces debido a la redirecci&oacute;n 304.</font></font>

source: Type <code>window.location</code> and press <code>enter</code> in your browser console. Then you can get the clear idea what <code>location</code> contains
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Escriba </font></font> <code>window.location</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y presione </font></font> <code>enter</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en la consola de su navegador. </font><font style="vertical-align: inherit;">Entonces puede tener una idea clara de qu&eacute; </font></font> <code>location</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> contiene</font></font>

source: Unfortunately, this markup is no longer valid in HTML5 and will neither validate nor always work as potentially expected. Use another approach.
es: Desafortunadamente,este marcado ya no es válido en HTML5 y no valida ni funciona siempre como se espera.Utilice otro enfoque.

source: Use jQuery/JavaScript to do the link following when JavaScript is enabled so that <code>?</code> doesn't end up appended to the URL. It will seamlessly fallback to the <code>&lt;form&gt;</code> method for the very small fraction of users who don't have JavaScript enabled.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Utilice jQuery / JavaScript para hacer el siguiente enlace cuando JavaScript est&eacute; habilitado, de modo que </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no termina agregado a la URL. </font><font style="vertical-align: inherit;">Se recurrir&aacute; sin problemas al </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>&lt;form&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para la fracci&oacute;n muy peque&ntilde;a de usuarios que no tienen habilitado JavaScript.</font></font>

source: Use the <code>&lt;form method="get"&gt;</code> method that the OP is starting with. This works really well, but it sometimes appends a <code>?</code> to the URL. The <code>?</code> is the main problem.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Utilice el </font></font> <code>&lt;form method="get"&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que est&aacute; comenzando el OP. </font><font style="vertical-align: inherit;">Esto funciona muy bien, pero a veces agrega un </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a la URL. </font><font style="vertical-align: inherit;">El </font></font> <code>?</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es el problema principal.</font></font>

source: Using <code>window.location = 'URL'</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usando </font></font> <code>window.location = 'URL'</code>

source: Using <code>window.location.assign('URL')</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usando </font></font> <code>window.location.assign('URL')</code>

source: Using <code>window.location.href = 'URL'</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Utilizando </font></font> <code>window.location.href = 'URL'</code>

source: Using <code>window.location.replace('URL')</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usando </font></font> <code>window.location.replace('URL')</code>

source: Using <code>window.open('URL')</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usando </font></font> <code>window.open('URL')</code>

source: Using HTML <strong>anchor</strong> tag
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El uso de HTML </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ancla</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> etiqueta</font></font>

source: Using HTML <strong>form</strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usando </font><strong><font style="vertical-align: inherit;">formulario</font></strong><font style="vertical-align: inherit;"> HTML</font></font><strong><font style="vertical-align: inherit;"></font></strong>

source: Using JavaScript:
es: Usando JavaScript:

source: When linking another local file just put it in the same folder and add the file name as the reference. Or specify the location of the file if in is not in the same folder.
es: Al enlazar otro archivo local sólo hay que ponerlo en la misma carpeta y añadir el nombre del archivo como referencia.O especifique la ubicación del archivo si no está en la misma carpeta.

source: Why not just place your button inside of a reference tag e.g
es: ¿Por qué no colocas tu botón dentro de una etiqueta de referencia,por ejemplo...

source: Working JSFiddle <a href="http://jsfiddle.net/sfwqsgLm/">here</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Trabajando JSFiddle </font></font><a href="http://jsfiddle.net/sfwqsgLm/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: You can set any value from here.
es: Puedes establecer cualquier valor desde aquí.

source: You can simply put an a tag around the element:
es: Puedes simplemente poner una etiqueta alrededor del elemento:

source: You can use JavaScript to trigger onclick and other events to mimic the behavior of a link using a button. The example below could be improve and remove from the HTML, but it is there simply to illustrate the idea:
es: Puedes usar JavaScript para activar onclick y otros eventos para imitar el comportamiento de un enlace usando un botón.El siguiente ejemplo podría ser mejorado y eliminado del HTML,pero está ahí simplemente para ilustrar la idea:

source: You can use javascript:
es: Puedes usar javascript:

source: You could also set the buttons <code>type-property</code> to "button" (it makes it not submit the form), and then nest it inside a link (makes it redirect the user).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tambi&eacute;n puede establecer la </font></font> <code>type-property</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> botones </font><font style="vertical-align: inherit;">en "bot&oacute;n" (hace que no env&iacute;e el formulario) y luego anidarlo dentro de un enlace (hace que redirija al usuario).</font></font>

source: You could just make the &lt;a&gt; display:block, move it around, and style it as a button, but then vertically aligning text inside of it becomes hard.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Podr&iacute;as hacer que la pantalla &lt;a&gt;: bloquee, mu&eacute;velo y dale estilo como un bot&oacute;n, pero luego alinear verticalmente el texto dentro de &eacute;l se vuelve dif&iacute;cil.</font></font>

source: You could of course wrap this in a form tag but it is not necessary.
es: Por supuesto,podría envolver esto en una etiqueta de forma,pero no es necesario.

source: You don't have to deal with forms if you're just trying to move to another page. Forms are meant for inputting information, and they should be reserved for that.
es: No tienes que ocuparte de los formularios si sólo quieres pasar a otra página.Los formularios están pensados para introducir información,y deben ser reservados para eso.

source: You'd intuitively expect to be able to use <code>&lt;button href="https://google.com"&gt;</code> analogous with the <code>&lt;a&gt;</code> element, but unfortunately no, this attribute does not exist according to <a href="https://www.w3.org/TR/html5/forms.html#the-button-element">HTML specification</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Intuitivamente esperar&iacute;a poder usar </font></font> <code>&lt;button href="https://google.com"&gt;</code> de forma<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> an&aacute;loga al </font><font style="vertical-align: inherit;">elemento </font></font> <code>&lt;a&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , pero desafortunadamente no, este atributo no existe de acuerdo con las </font></font><a href="https://www.w3.org/TR/html5/forms.html#the-button-element"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">especificaciones HTML</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Your button will be comprised of three nested pieces: a div wrapper, an anchor, and an h1, like so:
es: Su botón estará compuesto de tres piezas anidadas:un envoltorio de buceo,un ancla y un h1,así:

source: but the problem with this is that in <a href="http://en.wikipedia.org/wiki/Safari_%28web_browser%29">Safari</a> and <a href="http://en.wikipedia.org/wiki/Internet_Explorer">Internet&nbsp;Explorer</a>, it adds a question mark character to the end of the URL. I need to find a solution that doesn't add any characters to the end of the URL.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">pero el problema con esto es que en </font></font><a href="http://en.wikipedia.org/wiki/Safari_%28web_browser%29"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Safari</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> e </font></font><a href="http://en.wikipedia.org/wiki/Internet_Explorer"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Internet Explorer</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , agrega un car&aacute;cter de signo de interrogaci&oacute;n al final de la URL. </font><font style="vertical-align: inherit;">Necesito encontrar una soluci&oacute;n que no agregue ning&uacute;n car&aacute;cter al final de la URL.</font></font>

source: if you are using SSL Certificate
es: si está usando un certificado SSL

source: |||| ..html
es: ...público

source: |||| |||| -main.html
es: ...público

source: |||| |||| -secondary.html
es: ...público
