Repository: translationfeedback/feedback
Catalog: xlf/75/01/72/750172.*.001.xlf
Languages: es

source: There was a slight flaw in my original response. If there are any merge commits between the current <code>HEAD</code> and your <code>&lt;some HEAD before all your bad commits&gt;</code>, then <code>git rebase</code> will flatten them (and by the way, if you use GitHub pull requests, there are going to be a ton of merge commits in your history). This can very often lead to very different history (as duplicate changes may be "rebased out"), and in the worst case, it can lead to <code>git rebase</code> asking you to resolve difficult merge conflicts (which were likely already resolved in the merge commits). The solution is to use the <code>-p</code> flag to <code>git rebase</code>, which will preserve the merge structure of your history. The manpage for <code>git rebase</code> warns that using <code>-p</code> and <code>-i</code> can lead to issues, but in the <code>BUGS</code> section it says "Editing commits and rewording their commit messages should work fine."
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hubo un peque&ntilde;o defecto en mi respuesta original. Si hay confirmaciones de fusi&oacute;n entre el </font></font> <code>HEAD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> actual </font><font style="vertical-align: inherit;">y su </font></font> <code>&lt;some HEAD before all your bad commits&gt;</code> <font style="vertical-align: inherit;"></font> <code>git rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&gt;</font><font style="vertical-align: inherit;"> , entonces </font><font style="vertical-align: inherit;">git rebase</font><font style="vertical-align: inherit;"> los </font><font style="vertical-align: inherit;">aplanar&aacute;</font><font style="vertical-align: inherit;"> (y por cierto, si usa solicitudes de extracci&oacute;n de GitHub, habr&aacute; una tonelada de fusi&oacute;n se compromete en tu historia). Esto a menudo puede conducir a un historial muy diferente (ya que los cambios duplicados pueden "eliminarse") y, en el peor de los casos, puede conducir a </font></font> <code>git rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> pidi&eacute;ndole que resuelva conflictos de fusi&oacute;n dif&iacute;ciles (que probablemente ya se resolvieron en los compromisos de fusi&oacute;n ) La soluci&oacute;n es usar el </font><font style="vertical-align: inherit;">indicador </font></font> <code>-p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para </font></font> <code>git rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , lo que preservar&aacute; la estructura de fusi&oacute;n de su historial. La p&aacute;gina de manual para</font></font> <code>git rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> advierte que usar </font></font> <code>-p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>-i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> puede generar problemas, pero en la </font><font style="vertical-align: inherit;">secci&oacute;n </font></font> <code>BUGS</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dice "Editar confirmaciones y volver a redactar sus mensajes de confirmaci&oacute;n deber&iacute;a funcionar bien".</font></font>

source: This has the advantage of all the other solutions here in that you don't have to rewrite history, which can cause problems if you have an upstream, and is always a good way to accidentally lose data.
es: Esto tiene la ventaja de todas las otras soluciones aquí en que no tienes que reescribir la historia,lo que puede causar problemas si tienes una corriente ascendente,y siempre es una buena manera de perder datos accidentalmente.

source: This page <a href="http://inputvalidation.blogspot.com/2008/08/how-to-change-git-commit-author.html">http://inputvalidation.blogspot.com/2008/08/how-to-change-git-commit-author.html</a> describes how to do it. (I haven't tried this so YMMV)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta p&aacute;gina </font></font><a href="http://inputvalidation.blogspot.com/2008/08/how-to-change-git-commit-author.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://inputvalidation.blogspot.com/2008/08/how-to-change-git-commit-author.html</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> describe c&oacute;mo hacerlo. </font><font style="vertical-align: inherit;">(No he probado esto, as&iacute; que YMMV)</font></font>

source: This solution may be longer to type than some others, but it's highly controllable - I know exactly what commits it hits.
es: Esta solución puede ser más larga de teclear que otras,pero es muy controlable.Sé exactamente qué es lo que la compromete.

source: This will change the author to the name specified, but the committer will be set to your configured user in <code>git config user.name</code> and <code>git config user.email</code>. If you want to set the committer to something you specify, this will set both the author and the committer:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto cambiar&aacute; el autor al nombre especificado, pero el confirmador se configurar&aacute; para su usuario configurado en </font></font> <code>git config user.name</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>git config user.email</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Si desea establecer el confirmador en algo que especifique, esto establecer&aacute; tanto el autor como el confirmador:</font></font>

source: This will create a todo-list that looks like this:
es: Esto creará una lista de tareas que se verá así:

source: This will keep all the other commit information (including the dates). The <code>--reuse-message=HEAD</code> option prevents the message editor from launching.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto mantendr&aacute; toda la otra informaci&oacute;n de confirmaci&oacute;n (incluidas las fechas). </font><font style="vertical-align: inherit;">La </font></font> <code>--reuse-message=HEAD</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> evita que se </font><font style="vertical-align: inherit;">inicie</font><font style="vertical-align: inherit;"> el editor de mensajes.</font></font>

source: To change the author and committer, you can do this (with linebreaks in the string which is possible in bash):
es: Para cambiar el autor y el committer,puedes hacerlo (con saltos de línea en la cadena,lo cual es posible en bash):

source: To speed things up, you can specify a range of revisions you want to rewrite:
es: Para acelerar las cosas,puedes especificar un rango de revisiones que quieras reescribir:

source: Try this out. It will do the same as above mentioned, but interactively.
es: Pruebe esto.Hará lo mismo que el anterior,pero de forma interactiva.

source: Using Interactive Rebase
es: Usando el Rebase Interactivo

source: Using interactive rebase, you can place an amend command after each commit you want to alter. For instance:
es: Usando la base interactiva,puedes colocar un comando de modificación después de cada confirmación que quieras alterar.Por ejemplo:

source: We had trouble with running this on OS X because it somehow messed up line endings in commit messages, so we had to re-run it on a Linux machine afterwards.
es: Tuvimos problemas con la ejecución de esto en OS X porque de alguna manera estropeaba los finales de línea en los mensajes de confirmación,así que tuvimos que volver a ejecutarlo en una máquina Linux después.

source: We have experienced an issue today where a UTF8 character in an author name was causing trouble on the build server, so we had to rewrite the history to correct this. The steps taken were:
es: Hoy hemos experimentado un problema en el que un personaje UTF8 en un nombre de autor estaba causando problemas en el servidor de construcción,así que tuvimos que reescribir la historia para corregirlo.Los pasos que se tomaron fueron:

source: We used this in conjunction with <code>cvs2git</code> to migrate our repository from cvs to git.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usamos esto junto con </font></font> <code>cvs2git</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para migrar nuestro repositorio de cvs a git.</font></font>

source: When taking over an unmerged commit from another author, there is an easy way to handle this.
es: Cuando se hace cargo de un compromiso no fusionado de otro autor,hay una forma fácil de manejar esto.

source: While changing the author of your last commit is as simple as <code>git commit --amend --author "Author Name &lt;email@example.com&gt;"</code>, there is no one-liner or argument to do the same to the committer information.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si bien cambiar el autor de su &uacute;ltimo commit es tan simple como </font></font> <code>git commit --amend --author "Author Name &lt;email@example.com&gt;"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , no hay una sola l&iacute;nea o argumento para hacer lo mismo con la informaci&oacute;n del committer.</font></font>

source: With linebreaks in the string (which is possible in bash):
es: Con roturas de línea en la cuerda (lo que es posible en el bash):

source: You can also do:
es: También puedes hacerlo:

source: You can of course automate this procedure... well, all except using <code>git replace</code> which doesn't have (yet) batch mode, so you would have to use shell loop for that, or replace "by hand".
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por supuesto, puede automatizar este procedimiento ... bueno, todo excepto usar </font></font> <code>git replace</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que no tiene (todav&iacute;a) modo por lotes, por lo que tendr&iacute;a que usar el bucle de shell para eso, o reemplazarlo "a mano".</font></font>

source: You can then still modify some lines to see where you want to change the author. This gives you a nice middle ground between automation and control: you see the steps that will run, and once you save everything will be applied at once.
es: Entonces todavía puedes modificar algunas líneas para ver dónde quieres cambiar el autor.Esto te da un buen punto medio entre la automatización y el control:ves los pasos que se ejecutarán,y una vez que guardes todo se aplicará de una vez.

source: You can use this as a <strong>alias</strong> so you can do:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar esto como un </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">alias</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para que pueda hacer:</font></font>

source: You could do
es: Podrías hacer

source: You could skip opening the editor altogether here by appending <code>--no-edit</code> so that the command will be:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede omitir la apertura del editor por completo agregando </font></font> <code>--no-edit</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para que el comando sea:</font></font>

source: You might get one of these errors:
es: Podrías tener uno de estos errores:

source: Your problem is really common. See "<a href="http://stacktoheap.com/blog/2013/01/06/using-mailmap-to-fix-authors-list-in-git/">Using Mailmap to Fix Authors List in Git</a>"
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tu problema es muy com&uacute;n. </font><font style="vertical-align: inherit;">Consulte " </font></font><a href="http://stacktoheap.com/blog/2013/01/06/using-mailmap-to-fix-authors-list-in-git/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Uso de Mailmap para corregir la lista de autores en Git</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> "</font></font>

source: and check if replacements take place
es: y comprobar si se producen sustituciones

source: and this will work all automatically, which works when you have hundreds of commits.
es: y esto funcionará de forma automática,lo cual funciona cuando tienes cientos de compromisos.

source: edit or just close the editor that opens, and then do
es: editar o simplemente cerrar el editor que se abre,y luego hacer

source: i.e. Sample <code>author-conv-file</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">es decir, muestra </font></font> <code>author-conv-file</code>

source: loop the following two commands until you have processed all the commits:
es: ...hasta que hayas procesado todas las confirmaciones:

source: mark all commits that you want to change with <code>edit</code> (or <code>e</code>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">marque todas las confirmaciones que desea cambiar con </font></font> <code>edit</code> ar<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ( </font></font> <code>e</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>

source: or for the last 10 commits:
es: o para los últimos 10 compromisos:

source: run <code>git rebase -i &lt;sha1 or ref of starting point&gt;</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ejecute </font></font> <code>git rebase -i &lt;sha1 or ref of starting point&gt;</code>

source: save and exit editor (to run).
es: guardar y salir del editor (para ejecutar).

source: tested with git version 1.7.5.4
es: probado con la versión 1.7.5.4 de git

source: the <code>--no-edit</code> flag makes sure the <code>git commit --amend</code> doesn't ask an extra confirmation
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">el </font><font style="vertical-align: inherit;">indicador </font></font> <code>--no-edit</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se asegura de que </font></font> <code>git commit --amend</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no solicite una confirmaci&oacute;n adicional</font></font>

source: the file you edit will look like this:
es: el archivo que edites se verá así:

source: this works in mint-linux-17.3
es: esto funciona en el mint-linux-17.3

source: to continue the rebase.
es: para continuar con el rebase.

source: when you use <code>git rebase -i</code>, you can manually select the commits where to change the author,
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">cuando usas </font></font> <code>git rebase -i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , puedes seleccionar manualmente los commits donde cambiar el autor,</font></font>

source: which presents you with the editable list of commits:
es: que le presenta la lista de compromisos editables:
