Repository: translationfeedback/feedback
Catalog: xlf/75/01/72/750172.*.001.xlf
Languages: es

source: If other developers use feature branches, and/or <code>git pull --rebase</code> doesn't work e.g. because upstream is not set up, they have to <a href="http://git-scm.com/docs/git-rebase"><em>rebase</em></a> their work on top of post-rewrite commits. For example just after fetching new changes (<code>git fetch</code>), for a <code>master</code> branch based on / forked from <code>origin/master</code>, one needs to run
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si otros desarrolladores usan ramas de caracter&iacute;sticas y / o </font></font> <code>git pull --rebase</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> no funciona, por ejemplo, porque el </font><font style="vertical-align: inherit;">flujo</font><font style="vertical-align: inherit;"> ascendente no est&aacute; configurado, tienen que </font></font><a href="http://git-scm.com/docs/git-rebase"><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">volver</font></font></em></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a </font><em><font style="vertical-align: inherit;">basar</font></em><font style="vertical-align: inherit;"> su trabajo sobre los compromisos posteriores a la reescritura. </font><font style="vertical-align: inherit;">Por ejemplo, justo despu&eacute;s de buscar nuevos cambios ( </font></font> <code>git fetch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), para una </font><font style="vertical-align: inherit;">rama </font></font> <code>master</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> basada en / bifurcada desde </font></font> <code>origin/master</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , es necesario ejecutar</font></font>

source: If the commits you want to fix are the latest ones, and just a couple of them, you can use a combination of <code>git reset</code> and <code>git stash</code> to go back an commit them again after configuring the right name and email.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si las confirmaciones que desea corregir son las m&aacute;s recientes, y solo un par de ellas, puede usar una combinaci&oacute;n de </font></font> <code>git reset</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>git stash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para volver y confirmarlas nuevamente despu&eacute;s de configurar el nombre y el correo electr&oacute;nico correctos.</font></font>

source: If you are the only user of this repo or you don't care about possibly breaking the repo for other users, then yes. If you've pushed these commits and they exist where somewhere else can access them, then no, unless you don't care about breaking other people's repos. The problem is by changing these commits you will be generating new SHAs which will cause them to be treated as different commits. When someone else tries to pull in these changed commits, the history is different and kaboom.
es: Si eres el único usuario de este repo o no te importa la posibilidad de romper el repo para otros usuarios,entonces sí.Si has pulsado estas confirmaciones y existen donde otros pueden acceder a ellas,entonces no,a menos que no te importe romper los repos de otras personas.El problema es que al cambiar estas confirmaciones estarás generando nuevos SHAs que harán que sean tratados como diferentes confirmaciones.Cuando alguien más trata de usar estas confirmaciones cambiadas,la historia es diferente y kaboom.

source: If you are the only user of this repository, you can <strong>rewrite history</strong> using either <a href="http://git-scm.com/docs/git-filter-branch"><code>git filter-branch</code></a> (as <a href="https://stackoverflow.com/questions/3401732/git-rewrite-author-in-history/3401835#3401835">svick wrote</a>), or <a href="http://www.kernel.org/pub/software/scm/git/docs/git-fast-export.html"><code>git fast-export</code></a>/<a href="http://www.kernel.org/pub/software/scm/git/docs/git-fast-import.html"><code>git fast-import</code></a> plus filter script (as described in article referenced in <a href="https://stackoverflow.com/questions/3401732/git-rewrite-author-in-history/3401801#3401801">docgnome answer</a>), or interactive <a href="http://git-scm.com/docs/git-rebase">rebase</a>. But either of those would change revisions from first changed commit onwards; this means trouble for anybody that based his/her changes on your branch pre-rewrite.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si usted es el &uacute;nico usuario de este repositorio, puede </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">reescribir el historial</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> utilizando </font></font><a href="http://git-scm.com/docs/git-filter-branch"> <code>git filter-branch</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (como </font></font><a href="https://stackoverflow.com/questions/3401732/git-rewrite-author-in-history/3401835#3401835"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">escribi&oacute; svick</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) o </font></font><a href="http://www.kernel.org/pub/software/scm/git/docs/git-fast-export.html"> <code>git fast-export</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font><a href="http://www.kernel.org/pub/software/scm/git/docs/git-fast-import.html"> <code>git fast-import</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> plus script de filtro (como se describe en el art&iacute;culo al que se hace referencia en </font></font><a href="https://stackoverflow.com/questions/3401732/git-rewrite-author-in-history/3401801#3401801"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">docgnome answer</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), o </font></font><a href="http://git-scm.com/docs/git-rebase"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">rebase</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> interactivo </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Pero cualquiera de los dos cambiar&iacute;a las revisiones desde el primer cambio modificado en adelante; </font><font style="vertical-align: inherit;">Esto significa problemas para cualquiera que haya basado sus cambios en la reescritura de su rama.</font></font>

source: If you are using Eclipse with EGit, then there is a quite easy solution.
es: Si está usando Eclipse con EGit,entonces hay una solución bastante fácil.

source: If you want to force the run in spite of these errors, add the <strong><code>--force</code></strong> flag:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea forzar la ejecuci&oacute;n a pesar de estos errores, agregue el </font><font style="vertical-align: inherit;">indicador </font></font><strong> <code>--force</code> </strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: In the case where just the top few commits have bad authors, you can do this all inside <code>git rebase -i</code> using the <code>exec</code> command and the <code>--amend</code> commit, as follows:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el caso de que solo los pocos commits principales tengan autores malos, puede hacer todo esto dentro de </font></font> <code>git rebase -i</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> usando el </font><font style="vertical-align: inherit;">comando </font></font> <code>exec</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y el </font><font style="vertical-align: inherit;">commit </font></font> <code>--amend</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , de la siguiente manera:</font></font>

source: Is there any way to change the author of these commits to my name?
es: ¿Hay alguna manera de cambiar el autor de estos compromisos a mi nombre?

source: It happens when you do not have a $HOME/.gitconfig initialized. You may fix this as:
es: Ocurre cuando no tienes un $HOME.gitconfig inicializado.Puedes arreglar esto como:

source: Kudos to leif81 for the all option.
es: Felicitaciones a Leif81 por la opción "todo".

source: Note on Merge Commits
es: Nota sobre los compromisos de fusión

source: Note that git stores <strong>two</strong> different e-mail addresses, one for the <em>committer</em> (the person who committed the change) and another one for the <em>author</em> (the person who wrote the change).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que git almacena </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">dos</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> direcciones de correo electr&oacute;nico diferentes, una para el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">emisor</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (la persona que cometi&oacute; el cambio) y otra para el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">autor</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (la persona que escribi&oacute; el cambio).</font></font>

source: Note, if you are using this command in the Windows command prompt, then you need to use <code>"</code> instead of <code>'</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que si est&aacute; utilizando este comando en el s&iacute;mbolo del sistema de Windows, debe usar </font></font> <code>"</code> en<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de </font></font> <code>'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Now that you have corrected commit in object database, you have to tell git to automatically and transparently replace wrong commit by corrected one using <a href="http://www.kernel.org/pub/software/scm/git/docs/git-replace.html"><code>git replace</code></a> command:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ahora que ha corregido el commit en la base de datos de objetos, tiene que decirle a git que reemplace de manera autom&aacute;tica y transparente el commit incorrecto por uno corregido usando el </font><font style="vertical-align: inherit;">comando </font></font><a href="http://www.kernel.org/pub/software/scm/git/docs/git-replace.html"> <code>git replace</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Of course, if you committed something as yourself and it should really be someone else, and you don't mind rewriting history at this point, changing the commit author is probably a good idea for attribution purposes (in which case I direct you to my other answer here).
es: Por supuesto,si usted cometió algo como usted mismo y realmente debería ser otra persona,y no le importa reescribir la historia en este momento,cambiar el autor de la comisión es probablemente una buena idea a efectos de atribución (en cuyo caso le dirijo a mi otra respuesta aquí).

source: One liner, but be careful if you have a multi-user repository - this will change <em>all</em> commits to have the same (new) author and committer.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una l&iacute;nea, pero tenga cuidado si tiene un repositorio multiusuario: esto cambiar&aacute; </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todas las</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> confirmaciones para tener el mismo (nuevo) autor y confirmador.</font></font>

source: Push to remote 'master'
es: Empuje hacia el "maestro" remoto

source: Quick overview: Checkout your repository to a temp file, checkout all the remote branches, run the script which will rewrite the history, do a force push of the new state, and tell all your colleagues to do a rebase pull to get the changes.
es: Una rápida visión general:Revisa tu repositorio a un archivo temporal,revisa todas las ramas remotas,ejecuta el script que reescribirá el historial,haz un empuje de fuerza del nuevo estado,y dile a todos tus colegas que hagan un tirón de la base para obtener los cambios.

source: Reference: <a href="https://github.com/majdarbash/git-author-change-script">https://github.com/majdarbash/git-author-change-script</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Referencia: </font></font><a href="https://github.com/majdarbash/git-author-change-script"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/majdarbash/git-author-change-script</font></font></a>

source: Refs starting with <em>refs/original</em> exists already
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las referencias que comienzan con </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">referencias / original</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ya existen</font></font>

source: Right-click - Replace with - Branch - 'local_master_user_x'
es: Clic derecho-Reemplazar con-Rama-'local_master_user_x'

source: Select the projects/folders/files for which 'local_master_user_x' contains changes
es: Selecciona los archivos de carpetas de proyectos para los cuales 'local_master_user_x' contiene cambios

source: Show existing users on repo
es: Mostrar a los usuarios existentes en repo

source: Single Commit
es: Compromiso único

source: Source: <a href="https://github.com/brauliobo/gitconfig/blob/master/configs/.gitconfig">https://github.com/brauliobo/gitconfig/blob/master/configs/.gitconfig</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Fuente: </font></font><a href="https://github.com/brauliobo/gitconfig/blob/master/configs/.gitconfig"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://github.com/brauliobo/gitconfig/blob/master/configs/.gitconfig</font></font></a>

source: Specifically, you can fix all the wrong author names and emails <strong>for all branches and tags</strong> with this command (source: <a href="https://help.github.com/articles/changing-author-info/">GitHub help</a>):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Espec&iacute;ficamente, puede corregir todos los nombres de autor y correos electr&oacute;nicos incorrectos </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">para todas las ramas y etiquetas</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con este comando (fuente: </font></font><a href="https://help.github.com/articles/changing-author-info/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ayuda de GitHub</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>

source: Step 1: Change your username in git for all future commits, as per instructions here: <a href="https://help.github.com/articles/setting-your-username-in-git/">https://help.github.com/articles/setting-your-username-in-git/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Paso 1: cambie su nombre de usuario en git para todas las futuras confirmaciones, seg&uacute;n las instrucciones aqu&iacute;: </font></font><a href="https://help.github.com/articles/setting-your-username-in-git/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://help.github.com/articles/setting-your-username-in-git/</font></font></a>

source: Step 2: Run the following bash script:
es: Paso 2:Ejecutar el siguiente guión:

source: Thanks to @asmeurer for the inspiration.
es: Gracias a @asmeurer por la inspiración.

source: The committer information isn't displayed in most places, but you can see it with <code>git log -1 --format=%cn,%ce</code> (or use <code>show</code> instead of <code>log</code> to specify a particular commit).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La informaci&oacute;n de confirmaci&oacute;n no se muestra en la mayor&iacute;a de los lugares, pero puede verla con </font></font> <code>git log -1 --format=%cn,%ce</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (o use </font></font> <code>show</code> en<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de </font></font> <code>log</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para especificar una confirmaci&oacute;n particular).</font></font>

source: The fastest, easiest way to do this is to use the --exec argument of git rebase:
es: La forma más rápida y fácil de hacerlo es usar el argumento --exec de git rebase:

source: The procedure goes something like this:
es: El procedimiento es algo así:

source: The script:
es: El guión:

source: The sequence will be something like this (for 2 wrong commits, no pending changes):
es: La secuencia será algo así (para 2 compromisos erróneos,sin cambios pendientes):

source: The solution is to (temporarily, or not) change your user information, then amend the commit, which will update the committer to your current information:
es: La solución es cambiar (temporalmente,o no)su información de usuario,y luego modificar el commit,lo que actualizará el committer a su información actual:

source: The temporary directory exists already
es: El directorio temporal ya existe

source: The version below does work on all branches and changes the author and comitter separately to prevent that.
es: La versión que se muestra a continuación funciona en todas las ramas y cambia el autor y el comitente por separado para evitarlo.

source: Then add <code>exec ... --author="..."</code> lines after all lines with bad authors:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Luego agregue las </font><font style="vertical-align: inherit;">l&iacute;neas </font></font> <code>exec ... --author="..."</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> despu&eacute;s de todas las l&iacute;neas con autores malos:</font></font>

source: Then mark all of your bad commits as "edit" in the rebase file. If you also want to change your first commit, you have to manually add it as first line in the rebase file (follow the format of the other lines). Then, when git asks you to amend each commit, do
es: Entonces marca todos tus errores como "editar" en el archivo de la base de datos.Si también quieres cambiar tu primera confirmación,tienes que añadirla manualmente como primera línea en el fichero de rebase (sigue el formato de las otras líneas).Entonces,cuando git te pida que modifiques cada confirmación,haz

source: Then, as described in the <a href="http://git-scm.com/docs/git-filter-branch">MAN page of filter-branch</a>, remove all original refs backed up by <code>filter-branch</code> (this is destructive, backup first):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Luego, como se describe en la </font></font><a href="http://git-scm.com/docs/git-filter-branch"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">p&aacute;gina MAN de filter-branch</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , elimine todas las referencias originales respaldadas por </font></font> <code>filter-branch</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (esto es destructivo, primero haga una copia de seguridad):</font></font>
