Repository: translationfeedback/feedback
Catalog: xlf/75/01/72/750172.*.001.xlf
Languages: es

source: (extracted from asmeurer's answer)
es: (extraído de la respuesta de asmeurer)

source: (this means another filter-branch has been run previously on the repository and the then original branch reference is backed up at <em>refs/original</em>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(esto significa que otra rama de filtro se ha ejecutado previamente en el repositorio y la referencia de rama original se respalda en </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">refs / original</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>

source: <code>git commit --amend --reuse-message=HEAD --author="New Author &lt;new@author.email&gt;"</code> ; <code>git rebase --continue</code>
es: <code>git commit --amend --reuse-message=HEAD --author="New Author &lt;new@author.email&gt;"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; </font></font> <code>git rebase --continue</code>

source: <strong>NOT TESTED!</strong> YMMV.
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iexcl;NO PROBADO! </font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">YMMV.</font></font>

source: <strong>NOTE: This answer changes SHA1s, so take care on using it on a branch that has already been pushed. If you only want to fix the spelling of a name or update an old email, git lets you do this without rewriting history using <code>.mailmap</code>. See <a href="https://stackoverflow.com/a/9491696/161801">my other answer</a>.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NOTA: Esta respuesta cambia los SHA1, as&iacute; que tenga cuidado al usarla en una rama que ya ha sido enviada. </font><font style="vertical-align: inherit;">Si solo desea corregir la ortograf&iacute;a de un nombre o actualizar un correo electr&oacute;nico antiguo, git le permite hacerlo sin reescribir el historial utilizando </font></font> <code>.mailmap</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Mira </font></font><a href="https://stackoverflow.com/a/9491696/161801"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">mi otra respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font></strong>

source: <strong>This is a more elaborated version of @Brian's version:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta es una versi&oacute;n m&aacute;s elaborada de la versi&oacute;n de @ Brian:</font></font></strong>

source: <sup>Note that you might encounter some rough corners when using <code>refs/replace/</code> mechanism: it is new, and not yet very well tested</sup>.
es: <sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que puede encontrar algunas esquinas &aacute;speras al usar </font></font> <code>refs/replace/</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> mecanismo: es nuevo y a&uacute;n no est&aacute; muy bien probado</font></font></sup><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: A <strong>single command</strong> to change the author for the last N commits:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Un </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">solo comando</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para cambiar el autor de los &uacute;ltimos N commits:</font></font>

source: A common "mistake" is to use <code>HEAD</code> instead, which means filtering all revisions on just the <em>current branch</em>. And then no tags (or other refs) would exist in the rewritten branch.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Un "error" com&uacute;n es usar </font></font> <code>HEAD</code> en su<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar, lo que significa filtrar todas las revisiones solo en la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">rama actual</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Y luego no existir&iacute;an etiquetas (u otras referencias) en la rama reescrita.</font></font>

source: A little explanation of the <code>-- --all</code> option might be needed: It makes the filter-branch work on all revisions on <em>all refs</em> (which includes all branches). This means, for example, that tags are also rewritten and is visible on the rewritten branches.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Es </font><font style="vertical-align: inherit;">posible que se necesite </font><font style="vertical-align: inherit;">una peque&ntilde;a explicaci&oacute;n de la </font><font style="vertical-align: inherit;">opci&oacute;n </font></font> <code>-- --all</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : hace que la rama de filtro funcione en todas las revisiones en </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">todas las referencias</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (que incluye todas las ramas). </font><font style="vertical-align: inherit;">Esto significa, por ejemplo, que las etiquetas tambi&eacute;n se reescriben y es visible en las ramas reescritas.</font></font>

source: Add to ~/.gitconfig:
es: Añadir a ~.gitconfig:

source: After putting that script on your path, you can issue commands like:
es: Después de poner ese guión en tu camino,puedes emitir comandos como:

source: Alternate solution would be to use <strong>refs/replace/</strong> mechanism, available in Git since version 1.6.5. In this solution you provide replacements for commits that have wrong email; then anybody who fetches 'replace' refs (something like <code>fetch = +refs/replace/*:refs/replace/*</code> refspec in appropriate place in <em>their</em><code>.git/config</code>) would get replacements transparently, and those who do not fetch those refs would see old commits.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una soluci&oacute;n alternativa ser&iacute;a usar </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">refs / replace /</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> mecanismo, disponible en Git desde la versi&oacute;n 1.6.5. </font><font style="vertical-align: inherit;">En esta soluci&oacute;n, proporciona reemplazos para confirmaciones que tienen correo electr&oacute;nico incorrecto; </font><font style="vertical-align: inherit;">entonces cualquiera que busque referencias de 'reemplazo' (algo as&iacute; como </font></font> <code>fetch = +refs/replace/*:refs/replace/*</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> refspec en el lugar apropiado en </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">su </font></font></em> <code>.git/config</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) obtendr&iacute;a reemplazos de manera transparente, y aquellos que no obtengan esas referencias Ver viejos commits.</font></font>

source: Alternatively they can try <code>git rebase --pull</code>, which would fast-forward if there weren't any changes in their repository, or rebase their branch on top of re-written commits (we want to avoid merge, as it would keep pre-rewrite comits forever). All of this assuming that they do not have not comitted work; use <code>git stash</code> to stash away changes otherwise.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Alternativamente, pueden probar </font></font> <code>git rebase --pull</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que </font><font style="vertical-align: inherit;">avanzar&iacute;a</font><font style="vertical-align: inherit;"> r&aacute;pidamente si no hubiera cambios en su repositorio, o rebase su rama encima de confirmaciones reescritas (queremos evitar la fusi&oacute;n, ya que mantendr&iacute;a reescribe comits para siempre). </font><font style="vertical-align: inherit;">Todo esto suponiendo que no tienen trabajo comprometido; </font><font style="vertical-align: inherit;">use </font></font> <code>git stash</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para esconder los cambios de lo contrario.</font></font>

source: And from then on, commands like <code>git shortlog</code> will consider those two names to be the same (unless you specifically tell them not to). See <a href="http://schacon.github.com/git/git-shortlog.html">http://schacon.github.com/git/git-shortlog.html</a> for more information.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y a partir de entonces, los comandos como </font></font> <code>git shortlog</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> considerar&aacute;n que esos dos nombres son iguales (a menos que usted les indique espec&iacute;ficamente que no lo </font><font style="vertical-align: inherit;">hagan</font><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Consulte </font></font><a href="http://schacon.github.com/git/git-shortlog.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://schacon.github.com/git/git-shortlog.html</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener m&aacute;s informaci&oacute;n.</font></font>

source: Another way <code>Rebasing</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Otra manera </font></font> <code>Rebasing</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: As docgnome mentioned, rewriting history is dangerous and will break other people's repositories.
es: Como mencionó Docgnome,reescribir la historia es peligroso y romperá los depósitos de otras personas.

source: As some of the commenters have noted, if you just want to change the most recent commit, the rebase command is not necessary. Just do
es: Como algunos de los comentaristas han señalado,si sólo se quiere cambiar el compromiso más reciente,el comando de rebase no es necesario.Sólo hazlo.

source: Assumption: you have commits in a local branch 'local_master_user_x' which cannot be pushed to a remote branch 'master' because of the invalid user.
es: Suposición:tienes confirmaciones en una rama local 'local_master_user_x' que no puede ser empujada a una rama remota 'master' debido al usuario inválido.

source: But if you really want to do that and you are in a bash environment (no problem in Linux, on Windows, you can use git bash, that is provided with the installation of git), use <a href="http://git-scm.com/docs/git-filter-branch">git filter-branch</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Pero si realmente quieres hacer eso y est&aacute;s en un entorno bash (no hay problema en Linux, en Windows, puedes usar git bash, que se proporciona con la instalaci&oacute;n de git), usa </font></font><a href="http://git-scm.com/docs/git-filter-branch"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git filter-branch</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: By the way, after making your changes, clean the backup from the filter-branch with: <a href="https://github.com/albfan/git-backup-clean">git-backup-clean</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por cierto, despu&eacute;s de realizar los cambios, limpie la copia de seguridad de la rama de filtro con: </font></font><a href="https://github.com/albfan/git-backup-clean"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git-backup-clean</font></font></a>

source: Change author and committer matchings on &lt;branch&gt; and &lt;branch2&gt;. Pass <code>-f</code> to filter-branch to allow rewriting backups
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cambie las coincidencias de autor y confirmador en &lt;branch&gt; y &lt;branch2&gt;. </font><font style="vertical-align: inherit;">Pase </font></font> <code>-f</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> a filter-branch para permitir reescribir copias de seguridad</font></font>

source: Change author matchings on current branch
es: Cambiar las coincidencias de autores en la rama actual

source: Change commit <code>author name &amp; email</code> by <code>Amend</code>, then replacing <code>old-commit with new-one</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cambie el </font></font> <code>author name &amp; email</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> compromiso </font><font style="vertical-align: inherit;">y el correo electr&oacute;nico</font><font style="vertical-align: inherit;"> mediante </font></font> <code>Amend</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , luego reemplace </font></font> <code>old-commit with new-one</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Changing the author (or committer) would require re-writing all of the history. If you're okay with that and think it's worth it then you should check out <a href="http://schacon.github.com/git/git-filter-branch.html">git filter-branch</a>. The man page includes several examples to get you started. Also note that you can use environment variables to change the name of the author, committer, dates, etc. -- see the "Environment Variables" section of the <a href="http://schacon.github.com/git/git.html">git man page</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cambiar el autor (o el confirmador) requerir&iacute;a reescribir toda la historia. </font><font style="vertical-align: inherit;">Si est&aacute;s de acuerdo con eso y crees que vale la pena, entonces deber&iacute;as revisar </font></font><a href="http://schacon.github.com/git/git-filter-branch.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git filter-branch</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">La p&aacute;gina del manual incluye varios ejemplos para comenzar. </font><font style="vertical-align: inherit;">Tambi&eacute;n tenga en cuenta que puede utilizar variables de entorno para cambiar el nombre del autor, confirmador, fechas, etc. - v&eacute;ase la secci&oacute;n "Variables de entorno" de la </font></font><a href="http://schacon.github.com/git/git.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">p&aacute;gina del manual de git</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Commit these changes again, this time as the correct user and into the local branch 'master'
es: Comete estos cambios de nuevo,esta vez como el usuario correcto y en la sucursal local 'master'.

source: Finally, list all replacement to check if this procedure succeded
es: Por último,enumere todos los reemplazos para comprobar si este procedimiento tuvo éxito

source: Find all commits with wrong email, for example using
es: Encuentra todas las confirmaciones con un correo electrónico erróneo,por ejemplo usando

source: For a single commit:
es: Por un solo compromiso:

source: For each wrong commit, create a replacement commit, and add it to object database
es: Por cada confirmación errónea,crea una confirmación de reemplazo y añádela a la base de datos de objetos.

source: For the sake of simplicity, I have created a script to ease the process: <a href="https://github.com/albfan/git-changemail">git-changemail</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En aras de la simplicidad, he creado un script para facilitar el proceso: </font></font><a href="https://github.com/albfan/git-changemail"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git-changemail</font></font></a>

source: Github has a <a href="http://help.github.com/changing-author-info/">nice solution</a>, which is the following shell script:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Github tiene una </font></font><a href="http://help.github.com/changing-author-info/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">buena soluci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que es el siguiente script de shell:</font></font>

source: Here <code>origin/master@{1}</code> is pre-rewrite state (before fetch), see <a href="http://www.kernel.org/pub/software/scm/git/docs/gitrevisions.html">gitrevisions</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; </font></font> <code>origin/master@{1}</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es el estado previo a la reescritura (antes de buscar), vea </font></font><a href="http://www.kernel.org/pub/software/scm/git/docs/gitrevisions.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">gitrevisions</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Hope it is useful.
es: Espero que sea útil.

source: How to change the author and committer name and e-mail of multiple commits in Git
es: Cómo cambiar el nombre del autor y del committer y el e-mail de múltiples commits en Git

source: I adapted this <a href="http://lists.freedesktop.org/archives/portland/2010-October.txt">solution</a> which works by ingesting a simple <code>author-conv-file</code> (format is the same as one for <a href="http://www.kernel.org/pub/software/scm/git/docs/git-cvsimport.html">git-cvsimport</a>). It works by changing all users as defined in the <code>author-conv-file</code> across all branches.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Adapte esta </font></font><a href="http://lists.freedesktop.org/archives/portland/2010-October.txt"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">soluci&oacute;n</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que funciona ingiriendo un </font></font> <code>author-conv-file</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> simple </font><font style="vertical-align: inherit;">author-conv-file</font><font style="vertical-align: inherit;"> (el formato es el mismo que para </font></font><a href="http://www.kernel.org/pub/software/scm/git/docs/git-cvsimport.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">git-cvsimport</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ). </font><font style="vertical-align: inherit;">Funciona cambiando todos los usuarios como se define en el </font></font> <code>author-conv-file</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en todas las ramas.</font></font>

source: I found the presented versions way to aggressive, especially if you commit patches from other developers, this will essentially steal their code.
es: Encontré que las versiones presentadas son muy agresivas,especialmente si se cometen parches de otros desarrolladores,esto esencialmente robará su código.

source: I should point out that if the only problem is that the author/email is different from your usual, this is not a problem. The correct fix is to create a file called <code>.mailmap</code> at the base of the directory with lines like
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Debo se&ntilde;alar que si el &uacute;nico problema es que el autor / correo electr&oacute;nico es diferente al habitual, esto no es un problema. </font><font style="vertical-align: inherit;">La soluci&oacute;n correcta es crear un archivo llamado </font></font> <code>.mailmap</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en la base del directorio con l&iacute;neas como</font></font>

source: I use the following to rewrite the author for an entire repository, including tags and all branches:
es: Utilizo lo siguiente para reescribir el autor de un repositorio completo,incluyendo las etiquetas y todas las ramas:

source: I want to add my Example too. I want to create a <strong>bash_function with given parameter.</strong>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Quiero agregar mi ejemplo tambi&eacute;n. </font><font style="vertical-align: inherit;">Quiero crear una </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bash_function con el par&aacute;metro dado.</font></font></strong>

source: I was writing a simple script in the school computer, and committing the changes to Git (in a repo that was in my pendrive, cloned from my computer at home). After several commits I realized I was committing stuff as the root user.
es: Estaba escribiendo un simple guión en la computadora de la escuela,y haciendo los cambios en Git (en un repo que estaba en mi pendrive,clonado de mi computadora en casa).Después de varias confirmaciones me di cuenta de que estaba confirmando cosas como el usuario raíz.

source: I've added <code>-p</code> to the above command. For the case where you're just changing the most recent commit, this is not an issue.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">He agregado </font></font> <code>-p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al comando anterior. </font><font style="vertical-align: inherit;">Para el caso en el que solo est&aacute; cambiando la confirmaci&oacute;n m&aacute;s reciente, esto no es un problema.</font></font>

source: If other developers didn't based their work on pre-rewrite version, simplest solution would be to re-clone (clone again).
es: Si otros desarrolladores no basaran su trabajo en la versión previa a la reescritura,la solución más simple sería volver a clonar (clonar de nuevo).
