Repository: translationfeedback/feedback
Catalog: xlf/19/48/52/194852.*.001.xlf
Languages: es

source: The solution above will give incorrect results if a row has a <em>NULL</em> Name value (if there is a <em>NULL</em>, the <em>NULL</em> will make <code>@Names</code><em>NULL</em> after that row, and the next row will start over as an empty string again. Easily fixed with one of two solutions:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La soluci&oacute;n anterior dar&aacute; resultados incorrectos si una fila tiene un </font><font style="vertical-align: inherit;">valor </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NULL</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Name (si hay un </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NULL</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , el </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NULL</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> har&aacute; que </font></font> <code>@Names</code> sea<em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NULL</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> despu&eacute;s de esa fila, y la siguiente fila comenzar&aacute; de nuevo como una cadena vac&iacute;a de nuevo. de dos soluciones:</font></font>

source: Then write below code in sql server,
es: Entonces escribe el código de abajo en el servidor sql,

source: This answer will require some privilege in server to work.
es: Esta respuesta requerirá algún privilegio en el servidor para funcionar.

source: This can be useful too
es: Esto también puede ser útil

source: This puts the stray comma at the beginning.
es: Esto pone la coma perdida al principio.

source: This will work even your data contains invalid XML characters
es: Esto funcionará incluso si sus datos contienen caracteres XML no válidos.

source: This worked for me (<strong>SqlServer 2016</strong>):
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto funcion&oacute; para m&iacute; ( </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SqlServer 2016</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ):</font></font>

source: To avoid null values you can use CONCAT()
es: Para evitar valores nulos puedes usar CONCAT()

source: Use <code>COALESCE</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Utilice </font></font> <code>COALESCE</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Use <strong><em>COALESCE</em></strong> - <a href="https://msdn.microsoft.com/en-IN/library/ms190349.aspx">Learn more from here</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font><strong><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">COALESCE</font></font></em></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - </font></font><a href="https://msdn.microsoft.com/en-IN/library/ms190349.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Obtenga m&aacute;s informaci&oacute;n desde aqu&iacute;</font></font></a>

source: Using XML helped me in getting rows separated with commas. For the extra comma we can use the replace function of SQL&nbsp;Server. Instead of adding a comma, use of the AS 'data()' will concatenate the rows with spaces, which later can be replaced with commas as the syntax written below.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Usar XML me ayud&oacute; a separar las filas con comas. </font><font style="vertical-align: inherit;">Para la coma adicional, podemos usar la funci&oacute;n de reemplazo de SQL Server. </font><font style="vertical-align: inherit;">En lugar de agregar una coma, el uso de AS 'data ()' concatenar&aacute; las filas con espacios, que luego se pueden reemplazar con comas como la sintaxis escrita a continuaci&oacute;n.</font></font>

source: We have Users which can have many Data's and we want to have an output, where we can see all users Datas in a list:
es: Tenemos Usuarios que pueden tener muchos Datos y queremos tener una salida,donde podamos ver todos los Datos de los usuarios en una lista:

source: With the other answers, the person reading the answer must be aware of a specific domain table such as vehicle or student. The table must be created and populated with data to test a solution.
es: Con las otras respuestas,la persona que lee la respuesta debe estar al tanto de una tabla de dominio específico como vehículo o estudiante.La tabla debe ser creada y poblada con datos para probar una solución.

source: You can do the same thing in a more compact way if you can concat the commas at the beginning and use <code>substring</code> to skip the first one so you don't need to do a sub-query:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede hacer lo mismo de una manera m&aacute;s compacta si puede concatenar las comas al principio y usar la </font></font> <code>substring</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para omitir la primera, por lo que no necesita hacer una subconsulta:</font></font>

source: You can replace <code>', '</code> with any string separator
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede reemplazar </font></font> <code>', '</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con cualquier separador de cadenas</font></font>

source: You can use XML path as a correlated subquery in the SELECT clause too (but I'd have to wait until I go back to work because Google doesn't do work stuff at home :-)
es: También puedes usar la ruta XML como una subconsulta correlacionada en la cláusula SELECT (pero tendría que esperar a volver al trabajo porque Google no hace cosas de trabajo en casa :-)

source: You can use the new <a href="https://docs.microsoft.com/en-us/sql/t-sql/functions/string-agg-transact-sql">STRING_AGG function</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puedes usar la nueva </font></font><a href="https://docs.microsoft.com/en-us/sql/t-sql/functions/string-agg-transact-sql"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">funci&oacute;n STRING_AGG</font></font></a>

source: You need to create a variable that will hold your final result and select into it, like so.
es: Necesitas crear una variable que contenga el resultado final y seleccionarla,así.

source: as @user762952 pointed out, and according to Oracle's documentation <a href="http://www.oracle-base.com/articles/misc/string-aggregation-techniques.php">http://www.oracle-base.com/articles/misc/string-aggregation-techniques.php</a>, the WM_CONCAT() function is also an option. It seems stable, but Oracle explicitly recommends against using it for any application SQL, so use at your own risk.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">como se&ntilde;al&oacute; @ user762952, y de acuerdo con la documentaci&oacute;n de Oracle </font></font><a href="http://www.oracle-base.com/articles/misc/string-aggregation-techniques.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">http://www.oracle-base.com/articles/misc/string-aggregation-techniques.php</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , la funci&oacute;n WM_CONCAT () tambi&eacute;n es una opci&oacute;n. </font><font style="vertical-align: inherit;">Parece estable, pero Oracle recomienda expl&iacute;citamente no usarlo para ninguna aplicaci&oacute;n SQL, as&iacute; que &uacute;selo bajo su propio riesgo.</font></font>

source: the <code>'"},{"_":"'</code> is safe because if you data contain <code>'"},{"_":"',</code> it will be escaped to <code>"},{\"_\":\"</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">el </font></font> <code>'"},{"_":"'</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es seguro porque si contenerte de datos </font></font> <code>'"},{"_":"',</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> que se escap&oacute; a </font></font> <code>"},{\"_\":\"</code>

source: you can use the <a href="https://docs.microsoft.com/en-us/sql/t-sql/queries/select-for-clause-transact-sql">FOR JSON syntax</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">puedes usar la </font></font><a href="https://docs.microsoft.com/en-us/sql/t-sql/queries/select-for-clause-transact-sql"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">sintaxis FOR JSON</font></font></a>
