Repository: translationfeedback/feedback
Catalog: xlf/19/48/52/194852.*.001.xlf
Languages: es

source: (Diwakar and Jens Frandsen provided good answers, but need improvement.)
es: (Diwakar y Jens Frandsen dieron buenas respuestas,pero necesitan mejorar.)

source: 1) No need to initialize <code>@Names</code> with an empty string value.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1) No es necesario inicializar </font></font> <code>@Names</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con un valor de cadena vac&iacute;o.</font></font>

source: 2) No need to strip off an extra separator at the end.
es: 2)No hay necesidad de quitar un separador extra al final.

source: <a href="https://msdn.microsoft.com/pt-br/library/ms189524.aspx">Assemblies</a> are a good option for you. There are a lot of sites that explain how to create it. The one I think is very well explained is this <a href="http://www.mssqltips.com/sqlservertip/2022/concat-aggregates-sql-server-clr-function/">one</a>
es: <a href="https://msdn.microsoft.com/pt-br/library/ms189524.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las asambleas</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son una buena opci&oacute;n para ti. </font><font style="vertical-align: inherit;">Hay muchos sitios que explican c&oacute;mo crearlo. </font><font style="vertical-align: inherit;">El que yo creo que est&aacute; muy bien explicado es este </font></font><a href="http://www.mssqltips.com/sqlservertip/2022/concat-aggregates-sql-server-clr-function/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">uno</font></font></a>

source: <em>For an example:</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para un ejemplo:</font></font></em>

source: <strong>Edit:</strong> As adopted from @NReilingh's comment, you can use the following method to remove the trailing comma. Assuming the same table and column names:
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Editar: tal</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como se adopt&oacute; del comentario de @ NReilingh, puede usar el siguiente m&eacute;todo para eliminar la coma final. </font><font style="vertical-align: inherit;">Asumiendo los mismos nombres de tabla y columna:</font></font>

source: <strong>MySQL complete Example:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Ejemplo completo de MySQL:</font></font></strong>

source: <strong>Table Setup:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Configuraci&oacute;n de tabla:</font></font></strong>

source: <strong>This answer may return <a href="https://stackoverflow.com/questions/15138593/nvarchar-concatenation-index-nvarcharmax-inexplicable-behavior/15163136#15163136">unexpected results</a> For consistent results, use one of the FOR XML PATH methods detailed in other answers.</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esta respuesta puede devolver </font></font><a href="https://stackoverflow.com/questions/15138593/nvarchar-concatenation-index-nvarcharmax-inexplicable-behavior/15163136#15163136"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">resultados inesperados</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Para obtener </font><font style="vertical-align: inherit;">resultados</font><font style="vertical-align: inherit;"> consistentes, use uno de los m&eacute;todos FOR XML PATH detallados en otras respuestas.</font></font></strong>

source: <strong>With grouping :</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con agrupaci&oacute;n:</font></font></strong>

source: <strong>With grouping and sub-sorting</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con agrupaci&oacute;n y subclasificaci&oacute;n</font></font></strong>

source: <strong>Without grouping</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin agrupar</font></font></strong>

source: A ready-to-use solution, with no extra commas:
es: Una solución lista para usar,sin comas adicionales:

source: A recursive CTE solution was suggested, but no code was provided. The code below is an example of a recursive CTE. Note that although the results match the question, the data doesn't <em>quite</em> match the given description, as I assume that you really want to be doing this on groups of rows, not all rows in the table. Changing it to match all rows in the table is left as an exercise for the reader.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Se sugiri&oacute; una soluci&oacute;n recursiva de CTE, pero no se proporcion&oacute; ning&uacute;n c&oacute;digo. </font><font style="vertical-align: inherit;">El siguiente c&oacute;digo es un ejemplo de un CTE recursivo. </font><font style="vertical-align: inherit;">Tenga en cuenta que si bien los resultados se ajustan a la pregunta, los datos no </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">bastante</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> coincide con la descripci&oacute;n dada, como supongo que realmente desea estar haciendo esto en grupos de filas, no todas las filas de la tabla. </font><font style="vertical-align: inherit;">Cambiarlo para que coincida con todas las filas de la tabla se deja como ejercicio para el lector.</font></font>

source: Aggregate them in an array:
es: Agréguelos en un conjunto:

source: An empty list will result in NULL value. Usually you will insert the list into a table column or program variable: adjust the 255 max length to your need.
es: Una lista vacía resultará en un valor NULL.Normalmente se inserta la lista en una columna de la tabla o en una variable del programa:ajuste la longitud máxima de 255 a su necesidad.

source: And a solution for <strong>MySql</strong> (since this page show up in Google for MySql)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y una soluci&oacute;n para </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">MySql</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (ya que esta p&aacute;gina aparece en Google para MySql)</font></font>

source: And in SQL Server 2017, Azure SQL Database
es: Y en el SQL Server 2017,la base de datos Azure SQL

source: And the result will become
es: Y el resultado será

source: Assume table called NameList with one column called FName,
es: Supongamos una tabla llamada NameList con una columna llamada FName,

source: Be careful implementing this function if there is possibility of the resulting string going over 4000 characters. It will throw an exception. If that's the case then you need to either handle the exception or roll your own function that prevents the joined string from going over 4000 characters.
es: Tengan cuidado al implementar esta función si existe la posibilidad de que la cadena resultante supere los 4000 caracteres.Hará una excepción.Si ese es el caso,entonces necesitas manejar la excepción o lanzar tu propia función que impida que la cadena unida supere los 4000 caracteres.

source: Below is an example that uses SQL Server "Information_Schema.Columns" table. By using this solution, no tables need to be created or data added. This example creates a comma separated list of column names for all tables in the database.
es: A continuación se muestra un ejemplo que utiliza la tabla "Information_Schema.Columns" de SQL Server.Al utilizar esta solución,no es necesario crear tablas ni agregar datos.Este ejemplo crea una lista separada por comas de los nombres de las columnas para todas las tablas de la base de datos.

source: Coalesce is really just a helpful cheat that accomplishes two things:
es: Coalesce es en realidad sólo un tramposo útil que logra dos cosas:

source: Consider a database table holding names, with three rows:
es: Considere una tabla de base de datos con nombres,con tres filas:

source: Convert the array to a comma delimited string:
es: Convierte la matriz en una cadena delimitada por comas:

source: Create some test data:
es: Crear algunos datos de prueba:

source: Depending on what behavior you want (the first option just filters <em>NULL</em>s out, the second option keeps them in the list with a marker message [replace 'N/A' with whatever is appropriate for you]).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Dependiendo del comportamiento que desee (la primera opci&oacute;n solo filtra los </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">NULL</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , la segunda opci&oacute;n los mantiene en la lista con un mensaje marcador [reemplace 'N / A' con lo que sea apropiado para usted]).</font></font>

source: Easiest Solution
es: La solución más fácil

source: For Oracle DBs, see this question: <a href="https://stackoverflow.com/questions/1076011/how-can-multiple-rows-be-concatenated-into-one-in-oracle-without-creating-a-stor">How can multiple rows be concatenated into one in Oracle without creating a stored procedure?</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para Oracle DB, vea esta pregunta: </font></font><a href="https://stackoverflow.com/questions/1076011/how-can-multiple-rows-be-concatenated-into-one-in-oracle-without-creating-a-stor"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo se pueden concatenar varias filas en una en Oracle sin crear un procedimiento almacenado?</font></font></a>

source: From <a href="https://dev.mysql.com/doc/refman/8.0/en/group-by-functions.html#function_group-concat">MySql Documentations</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">De </font></font><a href="https://dev.mysql.com/doc/refman/8.0/en/group-by-functions.html#function_group-concat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">documentaciones MySql</font></font></a>

source: Here is the source : <a href="https://www.mytecbits.com/microsoft/sql-server/concatenate-multiple-rows-into-single-string">https://www.mytecbits.com/</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Aqu&iacute; est&aacute; la fuente: </font></font><a href="https://www.mytecbits.com/microsoft/sql-server/concatenate-multiple-rows-into-single-string"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://www.mytecbits.com/</font></font></a>

source: Here's a sample:
es: Aquí hay una muestra:

source: Hope it helps!!!
es: ¡¡Espero que ayude!!

source: How to concatenate text from multiple rows into a single text string in SQL server
es: Cómo concatenar texto de varias filas en una sola cadena de texto en el servidor SQL

source: However, if you need other columns, or to CSV a child table you need to wrap this in a scalar user defined field (UDF).
es: Sin embargo,si se necesitan otras columnas,o para CSV una tabla para niños hay que envolverla en un campo escalar definido por el usuario (UDF).

source: I don't have access to a SQL Server at home, so I'm guess at the syntax here, but it's more or less:
es: No tengo acceso a un servidor SQL en casa,así que supongo que la sintaxis aquí,pero es más o menos:

source: I had a similar issue when I was trying to join two tables with one-to-many relationships. In SQL 2005 I found that <code>XML PATH</code> method can handle the concatenation of the rows very easily.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tuve un problema similar cuando intentaba unir dos tablas con relaciones uno a muchos. </font><font style="vertical-align: inherit;">En SQL 2005 descubr&iacute; que el </font><font style="vertical-align: inherit;">m&eacute;todo </font></font> <code>XML PATH</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> puede manejar la concatenaci&oacute;n de las filas muy f&aacute;cilmente.</font></font>

source: I really liked elegancy of <a href="https://stackoverflow.com/questions/194852/concatenate-many-rows-into-a-single-text-string/194886#194886">Dana's answer</a>. Just wanted to make it complete.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Realmente me gust&oacute; la elegancia de </font></font><a href="https://stackoverflow.com/questions/194852/concatenate-many-rows-into-a-single-text-string/194886#194886"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la respuesta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font><font style="vertical-align: inherit;">Dana</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Solo quer&iacute;a completarlo.</font></font>

source: I used the following <code>T-SQL</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Us&eacute; el siguiente </font></font> <code>T-SQL</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: I usually use select like this to concatenate strings in SQL Server:
es: Normalmente utilizo una selección como esta para concatenar cadenas en el servidor SQL:

source: If there is a table called <code>STUDENTS</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si hay una mesa llamada </font></font> <code>STUDENTS</code>

source: If you are on SQL Server 2017 or Azure, see <a href="https://stackoverflow.com/a/42778050/1178676">Mathieu Renda answer</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si est&aacute; utilizando SQL Server 2017 o Azure, consulte la </font></font><a href="https://stackoverflow.com/a/42778050/1178676"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">respuesta de Mathieu Renda</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: If you want to deal with nulls you can do it by adding a where clause or add another COALESCE around the first one.
es: Si quieres lidiar con los nulos puedes hacerlo añadiendo una cláusula where o añadir otra COALESCE alrededor de la primera.

source: If you want, I have already created the assembly, and it is possible to download the DLL <a href="https://drive.google.com/open?id=0B5xK9loevG2yWVN0RVZ2Y1h6MGc&amp;authuser=0">here</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si lo desea, ya he creado el ensamblaje, y es posible descargar la DLL </font></font><a href="https://drive.google.com/open?id=0B5xK9loevG2yWVN0RVZ2Y1h6MGc&amp;authuser=0"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: In <a href="http://en.wikipedia.org/wiki/Microsoft_SQL_Server#SQL_Server_2005">SQL Server 2005</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En </font></font><a href="http://en.wikipedia.org/wiki/Microsoft_SQL_Server#SQL_Server_2005"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">SQL Server 2005</font></font></a>

source: In MySQL there is a function, <a href="http://dev.mysql.com/doc/refman/5.0/en/group-by-functions.html#function_group-concat">GROUP_CONCAT()</a>, which allows you to concatenate the values from multiple rows. Example:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En MySQL hay una funci&oacute;n, </font></font><a href="http://dev.mysql.com/doc/refman/5.0/en/group-by-functions.html#function_group-concat"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">GROUP_CONCAT ()</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , que le permite concatenar los valores de varias filas. </font><font style="vertical-align: inherit;">Ejemplo:</font></font>

source: In Oracle, it is <code>wm_concat</code>. I believe this function is available in the <a href="http://en.wikipedia.org/wiki/Oracle_10g">10g release</a> and higher.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En Oracle, es </font></font> <code>wm_concat</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Creo que esta funci&oacute;n est&aacute; disponible en la </font></font><a href="http://en.wikipedia.org/wiki/Oracle_10g"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">versi&oacute;n 10g</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y superior.</font></font>

source: In SQL Server 2005 and later, use the query below to concatenate the rows.
es: En SQL Server 2005 y posteriores,utilice la consulta que figura a continuación para concatenar las filas.

source: In SQL Server 2016
es: En SQL Server 2016

source: In SQL Server vNext this will be built in with the STRING_AGG function, read more about it here: <a href="https://msdn.microsoft.com/en-us/library/mt790580.aspx">https://msdn.microsoft.com/en-us/library/mt790580.aspx</a>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En SQL Server vNext, esto se integrar&aacute; con la funci&oacute;n STRING_AGG, lea m&aacute;s sobre esto aqu&iacute;: </font></font><a href="https://msdn.microsoft.com/en-us/library/mt790580.aspx"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">https://msdn.microsoft.com/en-us/library/mt790580.aspx</font></font></a>

source: In versions before 9.0 <code>array_agg()</code> can be used as shown by hgmnz
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En versiones anteriores a 9.0, </font></font> <code>array_agg()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> se puede usar como se muestra en hgmnz</font></font>

source: Is there an easy way to turn this into a single string of <code>Peter, Paul, Mary</code>?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Hay una manera f&aacute;cil de convertir esto en una sola cadena de </font></font> <code>Peter, Paul, Mary</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>

source: Just some explanation (since this answer seems to get relatively regular views):
es: Sólo una explicación (ya que esta respuesta parece obtener opiniones relativamente regulares):

source: Observe that the path to assembly may be accessible to server. Since you have successfully done all the steps, you can use the function like:
es: Obsérvese que la ruta de montaje puede ser accesible al servidor.Ya que ha realizado con éxito todos los pasos,puede utilizar la función como:

source: Once you have downloaded it, you will need to run the following script in your SQL Server:
es: Una vez que lo hayas descargado,deberás ejecutar el siguiente script en tu servidor SQL:

source: One method not yet shown via the <code>XML</code><code>data()</code> command in MS SQL Server is:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Un m&eacute;todo que a&uacute;n no se muestra a trav&eacute;s del </font><font style="vertical-align: inherit;">comando </font></font> <code>XML</code> <code>data()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en MS SQL Server es:</font></font>

source: Only the extra comma must be dealt with.
es: Sólo la coma extra debe ser tratada.

source: Oracle 11g Release 2 supports the LISTAGG function. Documentation <a href="http://www.oracle-base.com/articles/misc/StringAggregationTechniques.php">here</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Oracle 11g Release 2 es compatible con la funci&oacute;n LISTAGG. </font><font style="vertical-align: inherit;">Documentaci&oacute;n </font></font><a href="http://www.oracle-base.com/articles/misc/StringAggregationTechniques.php"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Other than that, you will have to write your own function; the Oracle document above has a guide on how to do that.
es: Aparte de eso,tendrás que escribir tu propia función;el documento del Oráculo anterior tiene una guía sobre cómo hacerlo.

source: Output would be:
es: La salida sería:

source: Postgres arrays are awesome. Example:
es: Los arreglos postgres son increíbles.Ejemplo:

source: Result I expected was:
es: El resultado que esperaba era:

source: SQL Server 2017+ and SQL Azure: STRING_AGG
es: SQL Server 2017+y SQL Azure:STRING_AGG

source: Since PostgreSQL 9.0 it is <a href="https://stackoverflow.com/a/13425819/952135">even easier</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Desde PostgreSQL 9.0 es </font></font><a href="https://stackoverflow.com/a/13425819/952135"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">a&uacute;n m&aacute;s f&aacute;cil</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Starting with PostgreSQL 9.0 this is quite simple:
es: Empezando con PostgreSQL 9.0 esto es bastante simple:

source: Starting with the next version of SQL Server, we can finally concatenate across rows without having to resort to any variable or XML witchery.
es: A partir de la próxima versión de SQL Server,podremos finalmente concatenar a través de filas sin tener que recurrir a ninguna variable o brujería XML.

source: The best answer appears to be by @Emmanuel, using the built-in LISTAGG() function, available in Oracle 11g Release 2 and later.
es: La mejor respuesta parece ser @Emmanuel,usando la función incorporada LISTAGG(),disponible en Oracle 11g Versión 2 y posteriores.
