Repository: translationfeedback/feedback
Catalog: xlf/15/75/14/1/1575141.*.001.xlf
Languages: es

source: The flex model is <a href="http://caniuse.com/#search=flex">supported by all major browsers</a> as well as IE11+.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El modelo flexible es </font></font><a href="http://caniuse.com/#search=flex"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">compatible con todos los principales navegadores</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , as&iacute; como con IE11 +.</font></font>

source: The right <code>div</code> has a grey <code>background-color</code>, and I need it to expand vertically depending on the height of the user's browser window. Right now the <code>background-color</code> ends at the last piece of content in that <code>div</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">El </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> derecho </font><font style="vertical-align: inherit;">tiene un color de </font></font> <code>background-color</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> gris </font><font style="vertical-align: inherit;">, y necesito que se expanda verticalmente dependiendo de la altura de la ventana del navegador del usuario. </font><font style="vertical-align: inherit;">En este momento, el </font></font> <code>background-color</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> termina en la &uacute;ltima pieza de contenido en ese </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: The solution I found, which solved both cases, was to combine the top two answers:
es: La solución que encontré,que resolvió ambos casos,fue combinar las dos primeras respuestas:

source: There are a couple of CSS 3 measurement units called:
es: Hay un par de unidades de medida de CSS 3 llamadas:

source: There are many variations on this depending on which columns need to be fixed and which are liquid. You can do this with absolute positioning too but I've generally found better results (particularly in terms of cross-browser) using floats instead.
es: Hay muchas variaciones en esto dependiendo de qué columnas necesitan ser fijadas y cuáles son líquidas.También se puede hacer esto con un posicionamiento absoluto,pero generalmente he encontrado mejores resultados (sobre todo en términos de cruce de navegador)usando flotadores en su lugar.

source: There are several methods available for setting the height of a <code>&lt;div&gt;</code> to 100%.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Hay varios m&eacute;todos disponibles para establecer la altura de un </font></font> <code>&lt;div&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al 100%.</font></font>

source: Therefore, keep these two things in mind:
es: Por lo tanto,tened en cuenta estas dos cosas:

source: These units are <code>vh</code> (viewport height), <code>vw</code> (viewport width), <code>vmin</code> (viewport minimum length) and <code>vmax</code> (viewport maximum length).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Estas unidades son </font></font> <code>vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (altura de la </font><font style="vertical-align: inherit;">ventana </font> <code>vmin</code> <font style="vertical-align: inherit;"> ), </font></font> <code>vw</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (ancho de la ventana </font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">gr&aacute;fica</font></font><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ), </font><font style="vertical-align: inherit;">vmin</font><font style="vertical-align: inherit;"> (longitud m&iacute;nima de la ventana </font><font style="vertical-align: inherit;">gr&aacute;fica</font><font style="vertical-align: inherit;"> ) y </font></font> <code>vmax</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> (longitud m&aacute;xima de la ventana </font><font style="vertical-align: inherit;">gr&aacute;fica</font><font style="vertical-align: inherit;"> ).</font></font>

source: This behavior, however, does not extend to height.
es: Este comportamiento,sin embargo,no se extiende a la altura.

source: This is currently supported on all up-to-date major browsers apart from Opera Mini. Check out <a href="http://caniuse.com/#feat=viewport-units">Can I use...</a> for further support.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Actualmente, esto es compatible con todos los principales navegadores actualizados, aparte de Opera Mini. </font><font style="vertical-align: inherit;">Consulte </font></font><a href="http://caniuse.com/#feat=viewport-units"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;Puedo usar ...</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para obtener m&aacute;s ayuda?</font></font>

source: This is how they meet their design requirement, which is to stack vertically.
es: Así es como cumplen con su requisito de diseño,que es apilar verticalmente.

source: This is literally all that's needed. Here is a <a href="http://jsfiddle.net/JamesD/hr8sL/"><strong>JSFiddle example</strong></a> of this in use.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Esto es literalmente todo lo que se necesita. </font><font style="vertical-align: inherit;">Aqu&iacute; hay un </font></font><a href="http://jsfiddle.net/JamesD/hr8sL/"><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ejemplo</font></font></strong></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de </font><strong><font style="vertical-align: inherit;">JSFiddle</font></strong><font style="vertical-align: inherit;"> de esto en uso.</font></font>

source: This is what worked for me:
es: Esto es lo que funcionó para mí:

source: This worked for me:
es: Esto funcionó para mí:

source: Try This Once...
es: Intenta esto una vez...

source: Try the following CSS:
es: Prueba el siguiente CSS:

source: Try the snippet I created for you as below:
es: Pruebe el recorte que he creado para usted como abajo:

source: Try this - tested:
es: Pruebe esto...probado:

source: Try to set <code>height:100%</code> in <code>html</code> &amp; <code>body</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Intenta establecer la </font></font> <code>height:100%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en </font></font> <code>html</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>body</code>

source: Unlike with width, you need to specify a height if you want extra space.
es: A diferencia de lo que ocurre con el ancho,es necesario especificar una altura si se desea un espacio extra.

source: Use <code>position:fixed</code> instead of <code>position:absolute</code>, that way even if you scroll down the division will expand to the end of the screen.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font> <code>position:fixed</code> en<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> lugar de </font></font> <code>position:absolute</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , de esa manera, incluso si se desplaza hacia abajo, la divisi&oacute;n se expandir&aacute; hasta el final de la pantalla.</font></font>

source: Use FlexBox CSS
es: Usar FlexBox CSS

source: Viewport-Percentage <em>(or Viewport-Relative)</em> Lengths
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Viewport-Porcentaje </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">(o Viewport-Relativa)</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> Longitudes</font></font>

source: What are Viewport-Percentage Lengths?
es: ¿Qué son las longitudes de los porcentajes de los puertos de observación?

source: What browsers support these new units?
es: ¿Qué navegadores soportan estas nuevas unidades?

source: When you specify <code>height: 100%</code>, it only means "take up 100% of available height from the parent element." This means if you don't specify a height at a top level element, the height of all the children will be either <code>0</code> or height of the parent, and that is why you need to set the topmost element to have a <code>min-height</code> of window height.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando especifica </font></font> <code>height: 100%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , solo significa "tomar el 100% de la altura disponible del elemento padre". </font><font style="vertical-align: inherit;">Esto significa que si no especifica una altura en un elemento de nivel superior, la altura de todos los elementos secundarios ser&aacute; </font></font> <code>0</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o altura del elemento primario, y es por eso que debe establecer el elemento superior para tener una </font></font> <code>min-height</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de altura de la ventana</font></font>

source: When you specify <code>width: 100%</code>, it means "take up 100% of the available width from the parent element or width of the window."
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Cuando especifica el </font></font> <code>width: 100%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , significa "tomar el 100% del ancho disponible del elemento principal o el ancho de la ventana".</font></font>

source: With the advent of the <a href="http://philipwalton.github.io/solved-by-flexbox/">CSS flex model</a>, solving the 100% height problem becomes very, very easy: use <code>height: 100%; display: flex</code> on the parent, and <code>flex: 1</code> on the child elements. They'll automatically take up all the available space in their container.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Con la llegada del </font></font><a href="http://philipwalton.github.io/solved-by-flexbox/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">modelo CSS flex</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , resolver el problema de la altura del 100% se vuelve muy, muy f&aacute;cil: </font></font> <code>height: 100%; display: flex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> uso </font><font style="vertical-align: inherit;">: 100%; </font><font style="vertical-align: inherit;">display: flex</font><font style="vertical-align: inherit;"> en el elemento primario y </font></font> <code>flex: 1</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en los elementos secundarios. </font><font style="vertical-align: inherit;">Ocupar&aacute;n autom&aacute;ticamente todo el espacio disponible en su contenedor.</font></font>

source: You can use <code>display: flex</code> and <code>height: 100vh</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar </font></font> <code>display: flex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>height: 100vh</code>

source: You can use <code>vh</code> in this case which is relative to <strong>1% of the height</strong> of the viewport...
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Puede usar </font></font> <code>vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en este caso, que es relativo al </font></font><strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">1% de la altura</font></font></strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> de la ventana gr&aacute;fica ...</font></font>

source: You can use the view-port unit in CSS:
es: Puedes usar la unidad de puerto de vista en el CSS:

source: You don't mention a few important details like:
es: No mencionas algunos detalles importantes como:

source: You need to do two things, one is to set the height to 100% which you already did. Second is set the position to absolute. That should do the trick.
es: Necesitas hacer dos cosas,una es fijar la altura al 100%,lo cual ya hiciste.La segunda es fijar la posición en absoluto.Eso debería servir.

source: unless you want content height, you need to define the height of an element
es: a menos que quieras la altura del contenido,necesitas definir la altura de un elemento

source: unless you want full width, you need to define the width of a block element
es: a menos que quieras el ancho completo,necesitas definir el ancho de un elemento de bloque

source: would do it.
es: lo haría.
