Repository: translationfeedback/feedback
Catalog: xlf/15/75/14/1/1575141.*.001.xlf
Languages: es

source: 100vh === 100% of the height of the viewport.
es: 100vh ===100% de la altura del mirador.

source: 100vw === 100% of the width of the viewport.
es: 100vw ===100% del ancho de la ventana.

source: <code>100%</code> works differently for width and height.
es: <code>100%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> funciona de manera diferente para ancho y alto.</font></font>

source: <em>The viewport-percentage lengths are relative to the size of the initial containing block. When the height or width of the initial containing block is changed, they are scaled accordingly.</em>
es: <em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Las longitudes de porcentaje de ventana gr&aacute;fica son relativas al tama&ntilde;o del bloque contenedor inicial. </font><font style="vertical-align: inherit;">Cuando se cambia la altura o el ancho del bloque contenedor inicial, se escalan en consecuencia.</font></font></em>

source: <strong>9.4.1 Block formatting contexts</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">9.4.1 Contextos de formato de bloque</font></font></strong>

source: <strong><a href="https://jsfiddle.net/ez8w5k57/">JSFiddle Example</a></strong>
es: <strong><a href="https://jsfiddle.net/ez8w5k57/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSFiddle Ejemplo</font></font></a></strong>

source: <strong>Method (A):</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&eacute;todo (A):</font></font></strong>

source: <strong>Method (B) using vh:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&eacute;todo (B) usando vh:</font></font></strong>

source: <strong>Method (c) using flex box:</strong>
es: <strong><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">M&eacute;todo (c) usando caja flexible:</font></font></strong>

source: Actually what worked for me best was using the <code>vh</code> property.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En realidad, lo que mejor me funcion&oacute; fue usar la </font><font style="vertical-align: inherit;">propiedad </font></font> <code>vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Add <code>min-height: 100%</code> and don't specify a height (or put it on auto). It totally did the job for me:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Agregue </font></font> <code>min-height: 100%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y no especifique una altura (ni la ponga en auto). </font><font style="vertical-align: inherit;">Realmente hizo el trabajo por m&iacute;:</font></font>

source: Add this script (to add detection for <code>vh-units</code>)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Agregue este script (para agregar detecci&oacute;n para </font></font> <code>vh-units</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> )</font></font>

source: All the other solutions, including the top-voted one with <code>vh</code> are sub-optimal when compared to the <a href="http://css-tricks.com/snippets/css/a-guide-to-flexbox/">flex model</a> solution.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Todas las otras soluciones, incluida la mejor votada con </font></font> <code>vh</code> ,<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> son sub&oacute;ptimas en comparaci&oacute;n con la </font><font style="vertical-align: inherit;">soluci&oacute;n del </font></font><a href="http://css-tricks.com/snippets/css/a-guide-to-flexbox/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">modelo flexible</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: And if you want to 2 div height same use or set the parent element <code>display:flex</code> property.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Y si desea 2 divisiones de altura, use o configure la </font></font> <code>display:flex</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> elemento primario </font><font style="vertical-align: inherit;">:</font><font style="vertical-align: inherit;"> propiedad </font><font style="vertical-align: inherit;">flex</font><font style="vertical-align: inherit;"> .</font></font>

source: Are either or both of the columns fixed width?
es: ¿Alguna de las columnas,o ambas,son de ancho fijo?

source: Block elements consume the full width of their parent, by default.
es: Los elementos de bloque consumen todo el ancho de su padre,por defecto.

source: By default, most elements are the height of their content (<code>height: auto</code>).
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por defecto, la mayor&iacute;a de los elementos son la altura de su contenido ( </font></font> <code>height: auto</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ).</font></font>

source: Even with all of the answers here, I was surprised to find that none really solved the problem. If I used <code>100vh</code><code>height</code>/<code>min-height</code>, the layout broke when the content was longer than a page. If I instead used <code>100%</code><code>height</code>/<code>min-height</code>, the layout broke when the content was less than the page height.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Incluso con todas las respuestas aqu&iacute;, me sorprendi&oacute; descubrir que ninguna realmente resolvi&oacute; el problema. </font><font style="vertical-align: inherit;">Si us&eacute; </font></font> <code>100vh</code> de <code>height</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font></font> <code>min-height</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , el dise&ntilde;o se rompi&oacute; cuando el contenido era m&aacute;s largo que una p&aacute;gina. </font><font style="vertical-align: inherit;">Si, en cambio, utilic&eacute; el </font></font> <code>100%</code> de <code>height</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> / </font><font style="vertical-align: inherit;">altura </font></font> <code>min-height</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , el dise&ntilde;o se rompi&oacute; cuando el contenido era inferior a la altura de la p&aacute;gina.</font></font>

source: Expand snippet
es: Ampliar fragmento

source: Finally use this function to add the height of the viewport to <code>#your-object</code> if the browser doesn't support <code>vh-units</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Finalmente, use esta funci&oacute;n para agregar la altura de la ventana gr&aacute;fica a </font></font> <code>#your-object</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> si el navegador no admite </font></font> <code>vh-units</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Flexbox is a perfect fit for this type of problem. While mostly known for laying out content in the horizontal direction, Flexbox actually works just as well for vertical layout problems. All you have to do is wrap the vertical sections in a flex container and choose which ones you want to expand. They&rsquo;ll automatically take up all the available space in their container.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Flexbox es perfecto para este tipo de problema. </font><font style="vertical-align: inherit;">Si bien es conocido principalmente por distribuir contenido en direcci&oacute;n horizontal, Flexbox realmente funciona igual de bien para problemas de dise&ntilde;o vertical. </font><font style="vertical-align: inherit;">Todo lo que tiene que hacer es envolver las secciones verticales en un contenedor flexible y elegir cu&aacute;les desea expandir. </font><font style="vertical-align: inherit;">Ocupar&aacute;n autom&aacute;ticamente todo el espacio disponible en su contenedor.</font></font>

source: For browser that don't support <code>vh-units</code>, use modernizr.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para el navegador que no admite </font></font> <code>vh-units</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , use modernizr.</font></font>

source: For height: <code>100vh</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para altura: </font></font> <code>100vh</code>

source: For this question, we can make use of <code>vh</code>: <code>1vh</code> is equal to 1% of the viewport's height. That is to say, <code>100vh</code> is equal to the height of the browser window, regardless of where the element is situated in the DOM tree:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para esta pregunta, podemos hacer uso de </font></font> <code>vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> : </font></font> <code>1vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es igual al 1% de la altura de la ventana </font><font style="vertical-align: inherit;">gr&aacute;fica</font><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Es decir, </font></font> <code>100vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> es igual a la altura de la ventana del navegador, independientemente de d&oacute;nde se encuentre el elemento en el &aacute;rbol DOM:</font></font>

source: For width: <code>100vw</code>
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Para ancho: </font></font> <code>100vw</code>

source: From the linked W3 Candidate Recommendation above:
es: De la Recomendación de Candidatos del W3 vinculada anteriormente:

source: Here is an example:
es: Aquí hay un ejemplo:

source: Here is something that is not exactly like what you had in previous answers, but it could be helpful to some:
es: Aquí hay algo que no es exactamente como lo que tenías en las respuestas anteriores,pero podría ser útil para algunos:

source: Here's a fix for the height.
es: Aquí hay un arreglo para la altura.

source: Here's one possibility:
es: Aquí hay una posibilidad:

source: How can this be used to make a divider fill the height of the browser?
es: ¿Cómo se puede usar esto para hacer que un divisor llene la altura del navegador?

source: How can this be used with multiple columns?
es: ¿Cómo se puede usar esto con múltiples columnas?

source: How is <code>100vh</code> different to <code>100%</code>?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">&iquest;C&oacute;mo es </font></font> <code>100vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> diferente al </font></font> <code>100%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ?</font></font>

source: How to make a div 100% height of the browser window
es: Cómo hacer un div 100% de altura de la ventana del navegador

source: I always specify the body to have a min-height of 100vh and it makes positioning and calculations easy,
es: Siempre especifico que el cuerpo tenga una altura mínima de 100vh y eso hace que el posicionamiento y los cálculos sean fáciles,

source: I have a layout with two columns - a left <code>div</code> and a right <code>div</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tengo un dise&ntilde;o con dos columnas: una </font></font> <code>div</code> isi&oacute;n<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> izquierda </font><font style="vertical-align: inherit;">y una </font></font> <code>div</code> isi&oacute;n<font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> derecha </font><font style="vertical-align: inherit;">.</font></font>

source: I've tried <code>height:100%</code>, <code>min-height:100%;</code>, etc.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">He intentado </font></font> <code>height:100%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> , </font></font> <code>min-height:100%;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">etc.</font></font>

source: If you use <code>position: absolute;</code> and jQuery, you could use
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si usa </font></font> <code>position: absolute;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">y jQuery, podr&iacute;as usar</font></font>

source: If you want to set the <code>div</code> width or height 100% of browser-window-size you should use:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea establecer el </font><font style="vertical-align: inherit;">ancho o la altura </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 100% del tama&ntilde;o de la ventana del navegador, debe usar:</font></font>

source: If you want to set the height of a <code>&lt;div&gt;</code> or any element, you should set the height of <code>&lt;body&gt;</code> and <code>&lt;html&gt;</code> to 100% too. Then you can set the height of element with 100% :)
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si desea establecer la altura de un </font></font> <code>&lt;div&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o cualquier elemento, tambi&eacute;n debe establecer la altura de </font></font> <code>&lt;body&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>&lt;html&gt;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> al 100%. </font><font style="vertical-align: inherit;">Luego puede establecer la altura del elemento con 100% :)</font></font>

source: If you&rsquo;re able to absolutely position your elements,
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Si puede posicionar absolutamente sus elementos,</font></font>

source: In a block formatting context, boxes are laid out one after the other, vertically, beginning at the top of a containing block.
es: En un contexto de formato de bloque,las casillas se colocan una tras otra,verticalmente,comenzando en la parte superior de un bloque de contención.

source: In my React application I wanted the div to match the page high even when resized. I tried <code>height: 100%;</code>, <code>overflow-y: auto;</code>, but none of them worked when setting <code>height:(your percent)vh;</code> it worked as intended.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En mi aplicaci&oacute;n React, quer&iacute;a que el div coincidiera con la p&aacute;gina alta incluso cuando se cambiaba el tama&ntilde;o. </font><font style="vertical-align: inherit;">Intent&eacute; </font></font> <code>height: 100%;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, </font></font> <code>overflow-y: auto;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">, pero ninguno de ellos funcion&oacute; al establecer la </font></font> <code>height:(your percent)vh;</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Funcion&oacute; seg&uacute;n lo previsto.</font></font>

source: In the case of the question at hand, featuring a left and a right divider, here is a <a href="http://jsfiddle.net/JamesD/hr8sL/1/">JSFiddle example</a> showing a two-column layout involving both <code>vh</code> and <code>vw</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">En el caso de la pregunta en cuesti&oacute;n, con un divisor izquierdo y uno derecho, aqu&iacute; hay un </font></font><a href="http://jsfiddle.net/JamesD/hr8sL/1/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">ejemplo de JSFiddle que</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> muestra un dise&ntilde;o de dos columnas que involucra tanto </font></font> <code>vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como </font></font> <code>vw</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: In your CSS use:
es: En su uso de CSS:

source: Is the layout fixed width?
es: ¿La disposición es de ancho fijo?

source: Just use the "vh" unit instead of "px", which means view-port height.
es: Sólo usa la unidad "vh" en lugar de "px",que significa altura del puerto de visión.

source: Learn more about the <a href="http://css-tricks.com/snippets/css/a-guide-to-flexbox/">flex model</a> here.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Obtenga m&aacute;s informaci&oacute;n sobre el </font></font><a href="http://css-tricks.com/snippets/css/a-guide-to-flexbox/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">modelo flexible</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> aqu&iacute;.</font></font>

source: Look at the image below I draw for you here:
es: Mira la imagen de abajo que he dibujado para ti aquí:

source: Note how simple the markup and the CSS are. No table hacks or anything.
es: Fíjate en lo simple que es el marcado y el CSS.No hay hackeo de tablas ni nada.

source: Note: if you are using padding, round corners, etc., make sure to subtract those values from your <code>vh</code> property percent or it adds extra height and make scroll bars appear. Here's my sample:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Nota: si est&aacute; utilizando relleno, esquinas redondeadas, etc., aseg&uacute;rese de restar esos valores del </font><font style="vertical-align: inherit;">porcentaje </font><font style="vertical-align: inherit;">de su </font><font style="vertical-align: inherit;">propiedad </font></font> <code>vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o agrega altura adicional y hace que aparezcan barras de desplazamiento. </font><font style="vertical-align: inherit;">Aqu&iacute; est&aacute; mi muestra:</font></font>

source: One of the options is using CSS table. It has great browser support and even works in Internet&nbsp;Explorer&nbsp;8.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Una de las opciones es usar la tabla CSS. </font><font style="vertical-align: inherit;">Tiene una gran compatibilidad con el navegador e incluso funciona en Internet Explorer 8.</font></font>

source: Or if you want to set it smaller size, use the CSS <code>calc</code> function. Example:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">O si desea establecer un tama&ntilde;o m&aacute;s peque&ntilde;o, use la </font><font style="vertical-align: inherit;">funci&oacute;n de </font></font> <code>calc</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> CSS </font><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Ejemplo:</font></font>

source: Simplest way is to do it like this.
es: La forma más simple es hacerlo así.

source: Take this layout for example:
es: Tome este diseño por ejemplo:

source: Taken from <a href="http://www.gn-webdesign.de/css-tutorials/css-div-height-100.html">this page</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tomado de </font></font><a href="http://www.gn-webdesign.de/css-tutorials/css-div-height-100.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">esta p&aacute;gina</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: That means if you want to cover off the height, just simply use <code>100vh</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Eso significa que si desea cubrir la altura, simplemente use </font></font> <code>100vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: The <code>p</code> tag here is set to 100% height, but because its containing <code>div</code> has 200 pixels height, 100% of 200 pixels becomes 200 pixels, <em>not</em> 100% of the <code>body</code> height. Using <code>100vh</code> instead means that the <code>p</code> tag will be 100% height of the <code>body</code> regardless of the <code>div</code> height. Take a look at this <a href="http://jsfiddle.net/JamesD/hr8sL/2/">accompanying JSFiddle</a> to easily see the difference!
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La </font><font style="vertical-align: inherit;">etiqueta </font></font> <code>p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> aqu&iacute; se establece en 100% de altura, pero como su </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> contiene 200 p&iacute;xeles de altura, el 100% de 200 p&iacute;xeles se convierte en 200 p&iacute;xeles, </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">no en el</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> 100% de la </font><font style="vertical-align: inherit;">altura del </font></font> <code>body</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font></font> <code>100vh</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> cambio, </font><font style="vertical-align: inherit;">usar </font><font style="vertical-align: inherit;">100vh</font><font style="vertical-align: inherit;"> significa que la </font><font style="vertical-align: inherit;">etiqueta </font></font> <code>p</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> tendr&aacute; una altura del 100% del </font></font> <code>body</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> independientemente de la </font><font style="vertical-align: inherit;">altura </font></font> <code>div</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">&iexcl;Eche un vistazo a este </font></font><a href="http://jsfiddle.net/JamesD/hr8sL/2/"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">JSFiddle que lo acompa&ntilde;a</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> para ver f&aacute;cilmente la diferencia!</font></font>
