Repository: translationfeedback/feedback
Catalog: xlf/52/40/78/9/5240789.*.001.xlf
Languages: es

source: <code>scanf</code> will then read the next char (that is, the newline) but not assign it to any pointer.
es: <code>scanf</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> leer&aacute; el siguiente car&aacute;cter (es decir, la nueva l&iacute;nea) pero no lo asignar&aacute; a ning&uacute;n puntero.</font></font>

source: Another option (that I got from <a href="https://faq.cprogramming.com/cgi-bin/smartfaq.cgi?answer=1352443831&amp;id=1043284392">here</a>) is to read and discard the newline by using the <em>assignment-supression option</em>. To do that, we just put a format to read a character with an asterisk between <code>%</code> and <code>c</code>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Otra opci&oacute;n (que obtuve de </font></font><a href="https://faq.cprogramming.com/cgi-bin/smartfaq.cgi?answer=1352443831&amp;id=1043284392"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">aqu&iacute;</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) es leer y descartar la nueva l&iacute;nea utilizando la </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">opci&oacute;n de supresi&oacute;n de asignaci&oacute;n</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> . </font><font style="vertical-align: inherit;">Para hacer eso, solo ponemos un formato para leer un car&aacute;cter con un asterisco entre </font></font> <code>%</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> y </font></font> <code>c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: As I read in the C book, the author says that <code>scanf()</code> left a new line character in the buffer, therefore, the program does not stop at line 4 for user to enter the data, rather it stores the new line character in c2 and moves to line 5.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Como le&iacute; en el libro C, el autor dice que </font></font> <code>scanf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> dej&oacute; un nuevo car&aacute;cter de l&iacute;nea en el b&uacute;fer, por lo tanto, el programa no se detiene en la l&iacute;nea 4 para que el usuario ingrese los datos, sino que almacena el nuevo car&aacute;cter de l&iacute;nea en c2 y se mueve a la l&iacute;nea 5.</font></font>

source: However, does this only happen with <code>char</code> data types? Because I did not see this problem with <code>int</code> data types as in line 1, 2, 3. Is it right?
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Sin embargo, &iquest;esto solo sucede con </font><font style="vertical-align: inherit;">los tipos de datos </font></font> <code>char</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ? </font><font style="vertical-align: inherit;">Porque no vi este problema con </font><font style="vertical-align: inherit;">los tipos de datos </font></font> <code>int</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> como en las l&iacute;neas 1, 2, 3. &iquest;Es correcto?</font></font>

source: I have the following program:
es: Tengo el siguiente programa:

source: In the end, however, I would second <a href="https://faq.cprogramming.com/cgi-bin/smartfaq.cgi?answer=1352443831&amp;id=1043284392">the FAQ's last option</a>:
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Al final, sin embargo, apoyar&iacute;a </font></font><a href="https://faq.cprogramming.com/cgi-bin/smartfaq.cgi?answer=1352443831&amp;id=1043284392"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">la &uacute;ltima opci&oacute;n de las preguntas frecuentes</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> :</font></font>

source: Is that right?
es: ¿Es eso cierto?

source: Note that non-whitespace "directives" (to use <a href="http://pubs.opengroup.org/onlinepubs/9699919799/functions/scanf.html">POSIX scanf terminology</a>) other than conversions, like the literal text in <code>scanf("order = %d", &amp;order);</code> doesn't skip whitespace either. The literal <code>order</code> has to match the next character to be read.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que las "directivas" que no son espacios en blanco (para usar la </font></font><a href="http://pubs.opengroup.org/onlinepubs/9699919799/functions/scanf.html"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">terminolog&iacute;a POSIX scanf</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) que no sean conversiones, como el texto literal en </font></font> <code>scanf("order = %d", &amp;order);</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">tampoco se salta el espacio en blanco. </font><font style="vertical-align: inherit;">El </font></font> <code>order</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> literal </font><font style="vertical-align: inherit;">tiene que coincidir con el siguiente car&aacute;cter a leer.</font></font>

source: Note that this still doesn't consume any trailing whitespace left in the input stream, not even to the end of a line, so beware of that if also using <a href="http://en.cppreference.com/w/c/io/getchar"><code>getchar()</code></a> or <a href="http://en.cppreference.com/w/c/io/fgets"><code>fgets()</code></a> on the same input stream. We're just getting scanf to skip over whitespace <em>before</em> conversions, like it does for <code>%d</code> and other non-character conversions.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Tenga en cuenta que esto todav&iacute;a no consume ning&uacute;n espacio en blanco al final de la secuencia de entrada, ni siquiera al final de una l&iacute;nea, as&iacute; que tenga cuidado con eso si tambi&eacute;n usa </font></font><a href="http://en.cppreference.com/w/c/io/getchar"> <code>getchar()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> o </font></font><a href="http://en.cppreference.com/w/c/io/fgets"> <code>fgets()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> en la misma secuencia de entrada. </font><font style="vertical-align: inherit;">Solo estamos haciendo que scanf omita el espacio en blanco </font></font><em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">antes de las</font></font></em><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> conversiones, como sucede con </font></font> <code>%d</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> otras conversiones que no son de caracteres.</font></font>

source: Or, depending on your requirements, you could also forget about scanf()/getchar(), use fgets() to get a line of text from the user and parse it yourself.
es: O,dependiendo de tus necesidades,también podrías olvidarte de scanf()getchar(),usar fgets()para obtener una línea de texto del usuario y analizarla tú mismo.

source: So you probably want <code>" order = %d"</code> there if you want to skip a newline from the previous line but still require a literal match on a fixed string, <a href="https://stackoverflow.com/questions/49923312/scanf-run-twice-instead-of-one-time-at-assembly-x86-64">like this question</a>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Por lo tanto, probablemente desee </font></font> <code>" order = %d"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> all&iacute; si desea omitir una nueva l&iacute;nea de la l&iacute;nea anterior pero a&uacute;n as&iacute; requiere una coincidencia literal en una cadena fija, </font></font><a href="https://stackoverflow.com/questions/49923312/scanf-run-twice-instead-of-one-time-at-assembly-x86-64"><font style="vertical-align: inherit;"><font style="vertical-align: inherit;">como esta pregunta</font></font></a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: The <a href="http://pubs.opengroup.org/onlinepubs/9699919799/functions/scanf.html"><code>scanf()</code></a> function skips leading whitespace automatically before trying to parse conversions other than characters. The character formats (primarily <code>%c</code>; also scan sets <code>%[&hellip;]</code> &mdash; and <code>%n</code>) are the exception; they don't skip whitespace.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">La funci&oacute;n </font></font><a href="http://pubs.opengroup.org/onlinepubs/9699919799/functions/scanf.html"> <code>scanf()</code> </a><font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> omite los espacios en blanco iniciales autom&aacute;ticamente antes de intentar analizar conversiones que no sean caracteres. </font><font style="vertical-align: inherit;">Los formatos de caracteres (principalmente </font></font> <code>%c</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ; tambi&eacute;n conjuntos de escaneo </font></font> <code>%[&hellip;]</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> - y </font></font> <code>%n</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> ) son la excepci&oacute;n; </font><font style="vertical-align: inherit;">No se saltan los espacios en blanco.</font></font>

source: Use <code>" %c"</code> with a leading blank to skip optional white space. Do not use a trailing blank in a <code>scanf()</code> format string.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font> <code>" %c"</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> con un espacio en blanco inicial para omitir el espacio en blanco opcional. </font><font style="vertical-align: inherit;">No utilice un espacio en blanco final en una </font><font style="vertical-align: inherit;">cadena de formato </font></font> <code>scanf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Use <code>getchar()</code> before calling second <code>scanf()</code>.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font> <code>getchar()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> antes de llamar al segundo </font></font> <code>scanf()</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;"> .</font></font>

source: Use <code>scanf(" %c", &amp;c2);</code>. This will solve your problem.
es: <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">Use </font></font> <code>scanf(" %c", &amp;c2);</code> <font style="vertical-align: inherit;"><font style="vertical-align: inherit;">. </font><font style="vertical-align: inherit;">Esto resolver&aacute; su problema.</font></font>

source: scanf() leaves the new line char in the buffer
es: scanf()deja la nueva línea de caracteres en el buffer
